tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* AAR_INTENCLR: Disable interrupt */
  #define AAR_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define AAR_INTENCLR_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define AAR_INTENCLR_END_Msk (0x1UL << AAR_INTENCLR_END_Pos) /*!< Bit mask of END field.                                     */
  #define AAR_INTENCLR_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Clear (0x1UL)             /*!< Disable                                                              */
  #define AAR_INTENCLR_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* RESOLVED @Bit 1 : Write '1' to disable interrupt for event RESOLVED */
  #define AAR_INTENCLR_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENCLR_RESOLVED_Msk (0x1UL << AAR_INTENCLR_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENCLR_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Clear (0x1UL)        /*!< Disable                                                              */
  #define AAR_INTENCLR_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
  #define AAR_INTENCLR_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Msk (0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENCLR_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Clear (0x1UL)     /*!< Disable                                                              */
  #define AAR_INTENCLR_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* AAR_STATUS: Resolution status */
  #define AAR_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* STATUS @Bits 0..3 : The IRK that was used last time an address was resolved */
  #define AAR_STATUS_STATUS_Pos (0UL)                /*!< Position of STATUS field.                                            */
  #define AAR_STATUS_STATUS_Msk (0xFUL << AAR_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                                */
  #define AAR_STATUS_STATUS_Min (0x0UL)              /*!< Min value of STATUS field.                                           */
  #define AAR_STATUS_STATUS_Max (0xFUL)              /*!< Max size of STATUS field.                                            */


/* AAR_ENABLE: Enable AAR */
  #define AAR_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable AAR */
  #define AAR_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define AAR_ENABLE_ENABLE_Msk (0x3UL << AAR_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Max (0x3UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define AAR_ENABLE_ENABLE_Enabled (0x3UL)          /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ABB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ABB ======================================================== */
/**
  * @brief ABB peripheral
  */
  typedef struct {                                   /*!< ABB Structure                                                        */
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) ABB status                                            */
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000480) ABB control                                           */
  } NRF_ABB_Type;                                    /*!< Size = 1156 (0x484)                                                  */

/* ABB_STATUS: ABB status */
  #define ABB_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* OPPOINT @Bits 0..1 : The current ABB operating point */
  #define ABB_STATUS_OPPOINT_Pos (0UL)               /*!< Position of OPPOINT field.                                           */
  #define ABB_STATUS_OPPOINT_Msk (0x3UL << ABB_STATUS_OPPOINT_Pos) /*!< Bit mask of OPPOINT field.                             */
  #define ABB_STATUS_OPPOINT_Min (0x0UL)             /*!< Min enumerator value of OPPOINT field.                               */
  #define ABB_STATUS_OPPOINT_Max (0x3UL)             /*!< Max enumerator value of OPPOINT field.                               */
  #define ABB_STATUS_OPPOINT_OpPoint0V4 (0x0UL)      /*!< Operating point 0.4V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V5 (0x1UL)      /*!< Operating point 0.5V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V6 (0x2UL)      /*!< Operating point 0.6V                                                 */
  #define ABB_STATUS_OPPOINT_OpPoint0V8 (0x3UL)      /*!< Operating point 0.8V                                                 */

/* EN @Bit 4 : The ABB enable status. */
  #define ABB_STATUS_EN_Pos (4UL)                    /*!< Position of EN field.                                                */
  #define ABB_STATUS_EN_Msk (0x1UL << ABB_STATUS_EN_Pos) /*!< Bit mask of EN field.                                            */
  #define ABB_STATUS_EN_Min (0x0UL)                  /*!< Min enumerator value of EN field.                                    */
  #define ABB_STATUS_EN_Max (0x1UL)                  /*!< Max enumerator value of EN field.                                    */
  #define ABB_STATUS_EN_Disabled (0x0UL)             /*!< ABB disabled                                                         */
  #define ABB_STATUS_EN_Enabled (0x1UL)              /*!< ABB enabled                                                          */

/* LOCKED @Bit 5 : The ABB lock status. */
  #define ABB_STATUS_LOCKED_Pos (5UL)                /*!< Position of LOCKED field.                                            */
  #define ABB_STATUS_LOCKED_Msk (0x1UL << ABB_STATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_Min (0x0UL)              /*!< Min enumerator value of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_Max (0x1UL)              /*!< Max enumerator value of LOCKED field.                                */
  #define ABB_STATUS_LOCKED_NotLocked (0x0UL)        /*!< Not locked                                                           */
  #define ABB_STATUS_LOCKED_Locked (0x1UL)           /*!< Locked.                                                              */


/* ABB_MODE: ABB control */
  #define ABB_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

