tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* OPPOINT @Bits 0..2 : The ABB operating point. */
  #define ABB_MODE_OPPOINT_Pos (0UL)                 /*!< Position of OPPOINT field.                                           */
  #define ABB_MODE_OPPOINT_Msk (0x7UL << ABB_MODE_OPPOINT_Pos) /*!< Bit mask of OPPOINT field.                                 */
  #define ABB_MODE_OPPOINT_Min (0x0UL)               /*!< Min enumerator value of OPPOINT field.                               */
  #define ABB_MODE_OPPOINT_Max (0x4UL)               /*!< Max enumerator value of OPPOINT field.                               */
  #define ABB_MODE_OPPOINT_Auto (0x0UL)              /*!< The peripheral controls the operating point automatically based on
                                                          request from the master ABB controller.*/
  #define ABB_MODE_OPPOINT_OpPoint0V4 (0x1UL)        /*!< Force the operating point to 0.4V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V5 (0x2UL)        /*!< Force the operating point to 0.5V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V6 (0x3UL)        /*!< Force the operating point to 0.6V                                    */
  #define ABB_MODE_OPPOINT_OpPoint0V8 (0x4UL)        /*!< Force the operating point to 0.8V                                    */

/* ABBEN @Bits 4..5 : Enable ABB. */
  #define ABB_MODE_ABBEN_Pos (4UL)                   /*!< Position of ABBEN field.                                             */
  #define ABB_MODE_ABBEN_Msk (0x3UL << ABB_MODE_ABBEN_Pos) /*!< Bit mask of ABBEN field.                                       */
  #define ABB_MODE_ABBEN_Min (0x0UL)                 /*!< Min enumerator value of ABBEN field.                                 */
  #define ABB_MODE_ABBEN_Max (0x2UL)                 /*!< Max enumerator value of ABBEN field.                                 */
  #define ABB_MODE_ABBEN_Auto (0x0UL)                /*!< The peripheral controls the ABB enable automatically based on
                                                          request.*/
  #define ABB_MODE_ABBEN_Enable (0x1UL)              /*!< Force enable ABB                                                     */
  #define ABB_MODE_ABBEN_Disable (0x2UL)             /*!< Force disable ABB                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         ATBFUNNEL                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct ATBFUNNEL ===================================================== */
/**
  * @brief ATB funnel module
  */
  typedef struct {                                   /*!< ATBFUNNEL Structure                                                  */
    __IOM uint32_t CTRLREG;                          /*!< (@ 0x00000000) The IDFILTER0 register enables the programming of ID
                                                                         filtering for master port 0.*/
    __IOM uint32_t PRIORITYCTRLREG;                  /*!< (@ 0x00000004) The Priority_Ctrl_Reg register defines the order in
                                                                         which inputs are selected. Each 3-bit field is a
                                                                         priority for each particular slave interface.*/
    __IM uint32_t RESERVED[953];
    __IOM uint32_t ITATBDATA0;                       /*!< (@ 0x00000EEC) The ITATBDATA0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR2;                        /*!< (@ 0x00000EF0) The ITATBCTR2 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR1;                        /*!< (@ 0x00000EF4) The ITATBCTR1 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR0;                        /*!< (@ 0x00000EF8) The ITATBCTR0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IM uint32_t RESERVED1;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) The ITCTRL register enables the component to switch
                                                                         from a functional mode, which is the default behavior,
                                                                         to integration mode where the inputs and outputs of the
                                                                         component can be directly controlled for the purposes
                                                                         of integration testing and topology detection.*/
    __IM uint32_t RESERVED2[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMSET register sets
                                                                         bits in the claim tag, and determines the number of
                                                                         claim bits implemented.*/
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMCLR register sets
                                                                         the bits in the claim tag to 0 and determines the
                                                                         current value of the claim tag.*/
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED4[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Indicates the capabilities of the component.          */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) The DEVTYPE register provides a debugger with
                                                                         information about the component when the Part Number
                                                                         field is not recognized. The debugger can then report
                                                                         this information.*/
    __IOM uint32_t PIDR4;                            /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t PIDR0;                            /*!< (@ 0x00000FE0) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR1;                            /*!< (@ 0x00000FE4) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR2;                            /*!< (@ 0x00000FE8) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR3;                            /*!< (@ 0x00000FEC) Coresight peripheral identification registers.        */
    __IOM uint32_t CIDR0;                            /*!< (@ 0x00000FF0) Coresight component identification registers.         */
    __IOM uint32_t CIDR1;                            /*!< (@ 0x00000FF4) Coresight component identification registers.         */
    __IOM uint32_t CIDR2;                            /*!< (@ 0x00000FF8) Coresight component identification registers.         */
    __IOM uint32_t CIDR3;                            /*!< (@ 0x00000FFC) Coresight component identification registers.         */
  } NRF_ATBFUNNEL_Type;                              /*!< Size = 4096 (0x1000)                                                 */

/* ATBFUNNEL_CTRLREG: The IDFILTER0 register enables the programming of ID filtering for master port 0. */
  #define ATBFUNNEL_CTRLREG_ResetValue (0x00000000UL) /*!< Reset value of CTRLREG register.                                    */

/* ENS0 @Bit 0 : Enable slave port 0. */
  #define ATBFUNNEL_CTRLREG_ENS0_Pos (0UL)           /*!< Position of ENS0 field.                                              */
  #define ATBFUNNEL_CTRLREG_ENS0_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS0_Pos) /*!< Bit mask of ENS0 field.                        */
  #define ATBFUNNEL_CTRLREG_ENS0_Min (0x0UL)         /*!< Min enumerator value of ENS0 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS0_Max (0x1UL)         /*!< Max enumerator value of ENS0 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS0_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS0_Enabled (0x1UL)     /*!< Slave port enabled.                                                  */

/* ENS1 @Bit 1 : Enable slave port 1. */
  #define ATBFUNNEL_CTRLREG_ENS1_Pos (1UL)           /*!< Position of ENS1 field.                                              */
  #define ATBFUNNEL_CTRLREG_ENS1_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS1_Pos) /*!< Bit mask of ENS1 field.                        */
  #define ATBFUNNEL_CTRLREG_ENS1_Min (0x0UL)         /*!< Min enumerator value of ENS1 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS1_Max (0x1UL)         /*!< Max enumerator value of ENS1 field.                                  */
  #define ATBFUNNEL_CTRLREG_ENS1_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS1_Enabled (0x1UL)     /*!< Slave port enabled.                                                  */

