tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* IME @Bit 0 : Integration Mode Enable. */
  #define ATBFUNNEL_ITCTRL_IME_Pos (0UL)             /*!< Position of IME field.                                               */
  #define ATBFUNNEL_ITCTRL_IME_Msk (0x1UL << ATBFUNNEL_ITCTRL_IME_Pos) /*!< Bit mask of IME field.                             */
  #define ATBFUNNEL_ITCTRL_IME_Min (0x0UL)           /*!< Min enumerator value of IME field.                                   */
  #define ATBFUNNEL_ITCTRL_IME_Max (0x1UL)           /*!< Max enumerator value of IME field.                                   */
  #define ATBFUNNEL_ITCTRL_IME_Disabled (0x0UL)      /*!< Integration mode disabled.                                           */
  #define ATBFUNNEL_ITCTRL_IME_Enabled (0x1UL)       /*!< Integration mode enabled.                                            */


/* ATBFUNNEL_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit functionality.
                        The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the
                        claim tag, and determines the number of claim bits implemented. */

  #define ATBFUNNEL_CLAIMSET_ResetValue (0x00000000UL) /*!< Reset value of CLAIMSET register.                                  */

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT0_Pos (0UL)          /*!< Position of BIT0 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT0_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT0_Pos) /*!< Bit mask of BIT0 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT0_Min (0x0UL)        /*!< Min enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_Max (0x1UL)        /*!< Max enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_NotImplemented (0x0UL) /*!< Claim bit 0 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT0_Implemented (0x1UL) /*!< Claim bit 0 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT0_Set (0x1UL)        /*!< Set claim bit 0.                                                     */

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT1_Pos (1UL)          /*!< Position of BIT1 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT1_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT1_Pos) /*!< Bit mask of BIT1 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT1_Min (0x0UL)        /*!< Min enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_Max (0x1UL)        /*!< Max enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT1_Implemented (0x1UL) /*!< Claim bit 1 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT1_Set (0x1UL)        /*!< Set claim bit 1.                                                     */

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT2_Pos (2UL)          /*!< Position of BIT2 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT2_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT2_Pos) /*!< Bit mask of BIT2 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT2_Min (0x0UL)        /*!< Min enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_Max (0x1UL)        /*!< Max enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT2_Implemented (0x1UL) /*!< Claim bit 2 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT2_Set (0x1UL)        /*!< Set claim bit 2.                                                     */

/* BIT3 @Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT3_Pos (3UL)          /*!< Position of BIT3 field.                                              */
  #define ATBFUNNEL_CLAIMSET_BIT3_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT3_Pos) /*!< Bit mask of BIT3 field.                      */
  #define ATBFUNNEL_CLAIMSET_BIT3_Min (0x0UL)        /*!< Min enumerator value of BIT3 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT3_Max (0x1UL)        /*!< Max enumerator value of BIT3 field.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT3_NotImplemented (0x0UL) /*!< Claim bit 3 is not implemented.                                  */
  #define ATBFUNNEL_CLAIMSET_BIT3_Implemented (0x1UL) /*!< Claim bit 3 is implemented.                                         */
  #define ATBFUNNEL_CLAIMSET_BIT3_Set (0x1UL)        /*!< Set claim bit 3.                                                     */


/* ATBFUNNEL_CLAIMCLR: Software can use the claim tag to coordinate application and debugger access to trace unit functionality.
                        The claim tags have no effect on the operation of the component. The CLAIMCLR register sets the bits in
                        the claim tag to 0 and determines the current value of the claim tag. */

  #define ATBFUNNEL_CLAIMCLR_ResetValue (0x00000000UL) /*!< Reset value of CLAIMCLR register.                                  */

/* BIT0 @Bit 0 : Read or clear claim bit 0. */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Pos (0UL)          /*!< Position of BIT0 field.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT0_Pos) /*!< Bit mask of BIT0 field.                      */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Min (0x0UL)        /*!< Min enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Max (0x1UL)        /*!< Max enumerator value of BIT0 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Cleared (0x0UL)    /*!< Claim bit 0 is not set.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Set (0x1UL)        /*!< Claim bit 0 is set.                                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Clear (0x1UL)      /*!< Clear claim bit 0.                                                   */

