tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ATBREPLICATOR_DEVID: Indicates the capabilities of the component. */
  #define ATBREPLICATOR_DEVID_ResetValue (0x00000000UL) /*!< Reset value of DEVID register.                                    */

/* PORTNUM @Bits 0..3 : Indicates the number of master ports implemented. */
  #define ATBREPLICATOR_DEVID_PORTNUM_Pos (0UL)      /*!< Position of PORTNUM field.                                           */
  #define ATBREPLICATOR_DEVID_PORTNUM_Msk (0xFUL << ATBREPLICATOR_DEVID_PORTNUM_Pos) /*!< Bit mask of PORTNUM field.           */
  #define ATBREPLICATOR_DEVID_PORTNUM_Min (0x0UL)    /*!< Min value of PORTNUM field.                                          */
  #define ATBREPLICATOR_DEVID_PORTNUM_Max (0xFUL)    /*!< Max size of PORTNUM field.                                           */


/* ATBREPLICATOR_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number
                           field is not recognized. The debugger can then report this information. */

  #define ATBREPLICATOR_DEVTYPE_ResetValue (0x00000000UL) /*!< Reset value of DEVTYPE register.                                */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Pos (0UL)      /*!< Position of MAJOR field.                                             */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.             */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Min (0x2UL)    /*!< Min enumerator value of MAJOR field.                                 */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Max (0x2UL)    /*!< Max enumerator value of MAJOR field.                                 */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_InputOutputDevice (0x2UL) /*!< Indicates that this component has ATB inputs and outputs. */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ATBREPLICATOR_DEVTYPE_SUB_Pos (4UL)        /*!< Position of SUB field.                                               */
  #define ATBREPLICATOR_DEVTYPE_SUB_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Min (0x2UL)      /*!< Min enumerator value of SUB field.                                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Max (0x2UL)      /*!< Max enumerator value of SUB field.                                   */
  #define ATBREPLICATOR_DEVTYPE_SUB_Replicator (0x2UL) /*!< Indicates that this component replicates trace from a single source
                                                            to multiple targets.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         BELLBOARD                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct BELLBOARD ===================================================== */
/**
  * @brief BELLBOARD APB registers
  */
  typedef struct {                                   /*!< BELLBOARD Structure                                                  */
    __OM uint32_t TASKS_TRIGGER[32];                 /*!< (@ 0x00000000) Task TRIGGER[n]                                       */
    __IM uint32_t RESERVED[32];
    __IOM uint32_t EVENTS_TRIGGERED[32];             /*!< (@ 0x00000100) Event TRIGGERED[n]                                    */
    __IM uint32_t RESERVED1[96];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000340) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000344) Enable interrupt                                      */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000348) Disable interrupt                                     */
    __IM uint32_t INTPEND4;                          /*!< (@ 0x0000034C) Pending interrupts                                    */
    __IOM uint32_t INTEN5;                           /*!< (@ 0x00000350) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET5;                        /*!< (@ 0x00000354) Enable interrupt                                      */
    __IOM uint32_t INTENCLR5;                        /*!< (@ 0x00000358) Disable interrupt                                     */
    __IM uint32_t INTPEND5;                          /*!< (@ 0x0000035C) Pending interrupts                                    */
    __IOM uint32_t INTEN6;                           /*!< (@ 0x00000360) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET6;                        /*!< (@ 0x00000364) Enable interrupt                                      */
    __IOM uint32_t INTENCLR6;                        /*!< (@ 0x00000368) Disable interrupt                                     */
    __IM uint32_t INTPEND6;                          /*!< (@ 0x0000036C) Pending interrupts                                    */
    __IOM uint32_t INTEN7;                           /*!< (@ 0x00000370) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET7;                        /*!< (@ 0x00000374) Enable interrupt                                      */
    __IOM uint32_t INTENCLR7;                        /*!< (@ 0x00000378) Disable interrupt                                     */
    __IM uint32_t INTPEND7;                          /*!< (@ 0x0000037C) Pending interrupts                                    */
  } NRF_BELLBOARD_Type;                              /*!< Size = 896 (0x380)                                                   */

/* BELLBOARD_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_MaxCount (32UL)    /*!< Max size of TASKS_TRIGGER[32] array.                                 */
  #define BELLBOARD_TASKS_TRIGGER_MaxIndex (31UL)    /*!< Max index of TASKS_TRIGGER[32] array.                                */
  #define BELLBOARD_TASKS_TRIGGER_MinIndex (0UL)     /*!< Min index of TASKS_TRIGGER[32] array.                                */
  #define BELLBOARD_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[32] register.                    */

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL) /*!< Position of TASKS_TRIGGER field.                                */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                  */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                              */


