tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTEN1_TRIGGERED1_Pos (1UL)      /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED1_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED1_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED1_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED1_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTEN1_TRIGGERED2_Pos (2UL)      /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED2_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED2_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED2_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED2_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTEN1_TRIGGERED3_Pos (3UL)      /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED3_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED3_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED3_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED3_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED4 @Bit 4 : Enable or disable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTEN1_TRIGGERED4_Pos (4UL)      /*!< Position of TRIGGERED4 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED4_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED4_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED4_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED4_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED5 @Bit 5 : Enable or disable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTEN1_TRIGGERED5_Pos (5UL)      /*!< Position of TRIGGERED5 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED5_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED5_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED5_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED5_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED6 @Bit 6 : Enable or disable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTEN1_TRIGGERED6_Pos (6UL)      /*!< Position of TRIGGERED6 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED6_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED6_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED6_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED6_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED7 @Bit 7 : Enable or disable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTEN1_TRIGGERED7_Pos (7UL)      /*!< Position of TRIGGERED7 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED7_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED7_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED7_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED7_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED8 @Bit 8 : Enable or disable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTEN1_TRIGGERED8_Pos (8UL)      /*!< Position of TRIGGERED8 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED8_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED8_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED8_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED8_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED9 @Bit 9 : Enable or disable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTEN1_TRIGGERED9_Pos (9UL)      /*!< Position of TRIGGERED9 field.                                        */
  #define BELLBOARD_INTEN1_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.        */
  #define BELLBOARD_INTEN1_TRIGGERED9_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED9_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTEN1_TRIGGERED9_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN1_TRIGGERED9_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED10 @Bit 10 : Enable or disable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTEN1_TRIGGERED10_Pos (10UL)    /*!< Position of TRIGGERED10 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED10_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED10_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED10_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED10_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED11 @Bit 11 : Enable or disable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTEN1_TRIGGERED11_Pos (11UL)    /*!< Position of TRIGGERED11 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED11_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED11_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED11_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED11_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED12 @Bit 12 : Enable or disable interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTEN1_TRIGGERED12_Pos (12UL)    /*!< Position of TRIGGERED12 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED12_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED12_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED12_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED12_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED13 @Bit 13 : Enable or disable interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTEN1_TRIGGERED13_Pos (13UL)    /*!< Position of TRIGGERED13 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED13_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED13_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED13_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED13_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED14 @Bit 14 : Enable or disable interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTEN1_TRIGGERED14_Pos (14UL)    /*!< Position of TRIGGERED14 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED14_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED14_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED14_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED14_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED15 @Bit 15 : Enable or disable interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTEN1_TRIGGERED15_Pos (15UL)    /*!< Position of TRIGGERED15 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED15_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED15_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED15_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED15_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED16 @Bit 16 : Enable or disable interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTEN1_TRIGGERED16_Pos (16UL)    /*!< Position of TRIGGERED16 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED16_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED16_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED16_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED16_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED17 @Bit 17 : Enable or disable interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTEN1_TRIGGERED17_Pos (17UL)    /*!< Position of TRIGGERED17 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED17_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED17_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED17_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED17_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED18 @Bit 18 : Enable or disable interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTEN1_TRIGGERED18_Pos (18UL)    /*!< Position of TRIGGERED18 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED18_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED18_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED18_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED18_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED19 @Bit 19 : Enable or disable interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTEN1_TRIGGERED19_Pos (19UL)    /*!< Position of TRIGGERED19 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED19_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED19_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED19_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED19_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED20 @Bit 20 : Enable or disable interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTEN1_TRIGGERED20_Pos (20UL)    /*!< Position of TRIGGERED20 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED20_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED20_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED20_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED20_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED21 @Bit 21 : Enable or disable interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTEN1_TRIGGERED21_Pos (21UL)    /*!< Position of TRIGGERED21 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED21_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED21_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED21_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED21_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED22 @Bit 22 : Enable or disable interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTEN1_TRIGGERED22_Pos (22UL)    /*!< Position of TRIGGERED22 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED22_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED22_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED22_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED22_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED23 @Bit 23 : Enable or disable interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTEN1_TRIGGERED23_Pos (23UL)    /*!< Position of TRIGGERED23 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED23_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED23 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED23_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED23 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED23_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED23_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED24 @Bit 24 : Enable or disable interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTEN1_TRIGGERED24_Pos (24UL)    /*!< Position of TRIGGERED24 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED24_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED24_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED24_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED24_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED25 @Bit 25 : Enable or disable interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTEN1_TRIGGERED25_Pos (25UL)    /*!< Position of TRIGGERED25 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED25_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED25_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED25_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED25_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED26 @Bit 26 : Enable or disable interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTEN1_TRIGGERED26_Pos (26UL)    /*!< Position of TRIGGERED26 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED26_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED26_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED26_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED26_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED27 @Bit 27 : Enable or disable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTEN1_TRIGGERED27_Pos (27UL)    /*!< Position of TRIGGERED27 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED27_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED27_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED27 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED27_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED27_Enabled (0x1UL) /*!< Enable                                                             */

