tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED28 @Bit 28 : Enable or disable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTEN1_TRIGGERED28_Pos (28UL)    /*!< Position of TRIGGERED28 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED28_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED28_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED28 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED28_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED28_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED29 @Bit 29 : Enable or disable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTEN1_TRIGGERED29_Pos (29UL)    /*!< Position of TRIGGERED29 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED29_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED29_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED29 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED29_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED29_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED30 @Bit 30 : Enable or disable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTEN1_TRIGGERED30_Pos (30UL)    /*!< Position of TRIGGERED30 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED30_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED30_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED30 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED30_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED30_Enabled (0x1UL) /*!< Enable                                                             */

/* TRIGGERED31 @Bit 31 : Enable or disable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTEN1_TRIGGERED31_Pos (31UL)    /*!< Position of TRIGGERED31 field.                                       */
  #define BELLBOARD_INTEN1_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTEN1_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31 field.     */
  #define BELLBOARD_INTEN1_TRIGGERED31_Min (0x0UL)   /*!< Min enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED31_Max (0x1UL)   /*!< Max enumerator value of TRIGGERED31 field.                           */
  #define BELLBOARD_INTEN1_TRIGGERED31_Disabled (0x0UL) /*!< Disable                                                           */
  #define BELLBOARD_INTEN1_TRIGGERED31_Enabled (0x1UL) /*!< Enable                                                             */


/* BELLBOARD_INTENSET1: Enable interrupt */
  #define BELLBOARD_INTENSET1_ResetValue (0x00000000UL) /*!< Reset value of INTENSET1 register.                                */

/* TRIGGERED0 @Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Pos (0UL)   /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Min (0x0UL) /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Max (0x1UL) /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED1 @Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Pos (1UL)   /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Min (0x0UL) /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Max (0x1UL) /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED2 @Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Pos (2UL)   /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Min (0x0UL) /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Max (0x1UL) /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED3 @Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Pos (3UL)   /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Min (0x0UL) /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Max (0x1UL) /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED4 @Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Pos (4UL)   /*!< Position of TRIGGERED4 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Min (0x0UL) /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Max (0x1UL) /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED5 @Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Pos (5UL)   /*!< Position of TRIGGERED5 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Min (0x0UL) /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Max (0x1UL) /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED6 @Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Pos (6UL)   /*!< Position of TRIGGERED6 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Min (0x0UL) /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Max (0x1UL) /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED7 @Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Pos (7UL)   /*!< Position of TRIGGERED7 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Min (0x0UL) /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Max (0x1UL) /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED8 @Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Pos (8UL)   /*!< Position of TRIGGERED8 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Min (0x0UL) /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Max (0x1UL) /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED9 @Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Pos (9UL)   /*!< Position of TRIGGERED9 field.                                        */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.  */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Min (0x0UL) /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Max (0x1UL) /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET1_TRIGGERED9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED10 @Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Pos (10UL) /*!< Position of TRIGGERED10 field.                                       */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10
                                                                            field.*/
  #define BELLBOARD_INTENSET1_TRIGGERED10_Min (0x0UL) /*!< Min enumerator value of TRIGGERED10 field.                          */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Max (0x1UL) /*!< Max enumerator value of TRIGGERED10 field.                          */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET1_TRIGGERED10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED11 @Bit 11 : Write '1' to enable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Pos (11UL) /*!< Position of TRIGGERED11 field.                                       */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTENSET1_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11
                                                                            field.*/
  #define BELLBOARD_INTENSET1_TRIGGERED11_Min (0x0UL) /*!< Min enumerator value of TRIGGERED11 field.                          */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Max (0x1UL) /*!< Max enumerator value of TRIGGERED11 field.                          */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET1_TRIGGERED11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

