tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* BELLBOARD_INTEN2: Enable or disable interrupt */
  #define BELLBOARD_INTEN2_ResetValue (0x00000000UL) /*!< Reset value of INTEN2 register.                                      */

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTEN2_TRIGGERED0_Pos (0UL)      /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED0_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED0_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED0_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED0_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTEN2_TRIGGERED1_Pos (1UL)      /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED1_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED1_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED1_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED1_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTEN2_TRIGGERED2_Pos (2UL)      /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED2_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED2_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED2_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED2_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTEN2_TRIGGERED3_Pos (3UL)      /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED3_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED3_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED3_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED3_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED4 @Bit 4 : Enable or disable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTEN2_TRIGGERED4_Pos (4UL)      /*!< Position of TRIGGERED4 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED4_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED4_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED4_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED4_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED5 @Bit 5 : Enable or disable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTEN2_TRIGGERED5_Pos (5UL)      /*!< Position of TRIGGERED5 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED5_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED5_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED5_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED5_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED6 @Bit 6 : Enable or disable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTEN2_TRIGGERED6_Pos (6UL)      /*!< Position of TRIGGERED6 field.                                        */
  #define BELLBOARD_INTEN2_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.        */
  #define BELLBOARD_INTEN2_TRIGGERED6_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED6_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTEN2_TRIGGERED6_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN2_TRIGGERED6_Enabled (0x1UL) /*!< Enable                                                              */

