tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED28 @Bit 28 : Write '1' to disable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Pos (28UL) /*!< Position of TRIGGERED28 field.                                       */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Min (0x0UL) /*!< Min enumerator value of TRIGGERED28 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Max (0x1UL) /*!< Max enumerator value of TRIGGERED28 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR3_TRIGGERED28_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED29 @Bit 29 : Write '1' to disable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Pos (29UL) /*!< Position of TRIGGERED29 field.                                       */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Min (0x0UL) /*!< Min enumerator value of TRIGGERED29 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Max (0x1UL) /*!< Max enumerator value of TRIGGERED29 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR3_TRIGGERED29_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED30 @Bit 30 : Write '1' to disable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Pos (30UL) /*!< Position of TRIGGERED30 field.                                       */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Min (0x0UL) /*!< Min enumerator value of TRIGGERED30 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Max (0x1UL) /*!< Max enumerator value of TRIGGERED30 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR3_TRIGGERED30_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED31 @Bit 31 : Write '1' to disable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Pos (31UL) /*!< Position of TRIGGERED31 field.                                       */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Min (0x0UL) /*!< Min enumerator value of TRIGGERED31 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Max (0x1UL) /*!< Max enumerator value of TRIGGERED31 field.                          */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Clear (0x1UL) /*!< Disable                                                           */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENCLR3_TRIGGERED31_Enabled (0x1UL) /*!< Read: Enabled                                                   */


/* BELLBOARD_INTPEND3: Pending interrupts */
  #define BELLBOARD_INTPEND3_ResetValue (0x00000000UL) /*!< Reset value of INTPEND3 register.                                  */

/* TRIGGERED0 @Bit 0 : Read pending status of interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTPEND3_TRIGGERED0_Pos (0UL)    /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTPEND3_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.    */
  #define BELLBOARD_INTPEND3_TRIGGERED0_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED0_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND3_TRIGGERED0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED1 @Bit 1 : Read pending status of interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTPEND3_TRIGGERED1_Pos (1UL)    /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTPEND3_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.    */
  #define BELLBOARD_INTPEND3_TRIGGERED1_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED1_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND3_TRIGGERED1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED2 @Bit 2 : Read pending status of interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTPEND3_TRIGGERED2_Pos (2UL)    /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTPEND3_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.    */
  #define BELLBOARD_INTPEND3_TRIGGERED2_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED2_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND3_TRIGGERED2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED3 @Bit 3 : Read pending status of interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTPEND3_TRIGGERED3_Pos (3UL)    /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTPEND3_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.    */
  #define BELLBOARD_INTPEND3_TRIGGERED3_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED3_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTPEND3_TRIGGERED3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND3_TRIGGERED3_Pending (0x1UL) /*!< Read: Pending                                                     */

