tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED2 @Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Pos (2UL)   /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Min (0x0UL) /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Max (0x1UL) /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED3 @Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Pos (3UL)   /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Min (0x0UL) /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Max (0x1UL) /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED3_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED4 @Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Pos (4UL)   /*!< Position of TRIGGERED4 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Min (0x0UL) /*!< Min enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Max (0x1UL) /*!< Max enumerator value of TRIGGERED4 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED4_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED5 @Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Pos (5UL)   /*!< Position of TRIGGERED5 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Min (0x0UL) /*!< Min enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Max (0x1UL) /*!< Max enumerator value of TRIGGERED5 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED5_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED6 @Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Pos (6UL)   /*!< Position of TRIGGERED6 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Min (0x0UL) /*!< Min enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Max (0x1UL) /*!< Max enumerator value of TRIGGERED6 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED6_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED7 @Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Pos (7UL)   /*!< Position of TRIGGERED7 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Min (0x0UL) /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Max (0x1UL) /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED7_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED8 @Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Pos (8UL)   /*!< Position of TRIGGERED8 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Min (0x0UL) /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Max (0x1UL) /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED8_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED9 @Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Pos (9UL)   /*!< Position of TRIGGERED9 field.                                        */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.  */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Min (0x0UL) /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Max (0x1UL) /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET6_TRIGGERED9_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED10 @Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Pos (10UL) /*!< Position of TRIGGERED10 field.                                       */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10
                                                                            field.*/
  #define BELLBOARD_INTENSET6_TRIGGERED10_Min (0x0UL) /*!< Min enumerator value of TRIGGERED10 field.                          */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Max (0x1UL) /*!< Max enumerator value of TRIGGERED10 field.                          */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET6_TRIGGERED10_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED11 @Bit 11 : Write '1' to enable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Pos (11UL) /*!< Position of TRIGGERED11 field.                                       */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTENSET6_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11
                                                                            field.*/
  #define BELLBOARD_INTENSET6_TRIGGERED11_Min (0x0UL) /*!< Min enumerator value of TRIGGERED11 field.                          */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Max (0x1UL) /*!< Max enumerator value of TRIGGERED11 field.                          */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET6_TRIGGERED11_Enabled (0x1UL) /*!< Read: Enabled                                                   */

