tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* VDDAO1V8 @Bits 0..3 : VDD_AO_1V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO1V8_Pos (0UL)       /*!< Position of VDDAO1V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO1V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDAO1V8_Pos) /*!< Bit mask of VDDAO1V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO1V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Max (0xFUL)     /*!< Max enumerator value of VDDAO1V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO1V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO1V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO1V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* VDD1V0 @Bits 4..7 : VDD_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDD1V0_Pos (4UL)         /*!< Position of VDD1V0 field.                                            */
  #define BICR_POWER_CONFIG_VDD1V0_Msk (0xFUL << BICR_POWER_CONFIG_VDD1V0_Pos) /*!< Bit mask of VDD1V0 field.                  */
  #define BICR_POWER_CONFIG_VDD1V0_Min (0x0UL)       /*!< Min enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Max (0xFUL)       /*!< Max enumerator value of VDD1V0 field.                                */
  #define BICR_POWER_CONFIG_VDD1V0_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                       */
  #define BICR_POWER_CONFIG_VDD1V0_Internal (0x0UL)  /*!< Power rail is configured to use the internal regulator.              */
  #define BICR_POWER_CONFIG_VDD1V0_External (0x1UL)  /*!< Power rail is configured to be externally powered.                   */

/* VDDRF1V0 @Bits 8..11 : VDD_RF_1V0 power configuration. */
  #define BICR_POWER_CONFIG_VDDRF1V0_Pos (8UL)       /*!< Position of VDDRF1V0 field.                                          */
  #define BICR_POWER_CONFIG_VDDRF1V0_Msk (0xFUL << BICR_POWER_CONFIG_VDDRF1V0_Pos) /*!< Bit mask of VDDRF1V0 field.            */
  #define BICR_POWER_CONFIG_VDDRF1V0_Min (0x1UL)     /*!< Min enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Max (0xFUL)     /*!< Max enumerator value of VDDRF1V0 field.                              */
  #define BICR_POWER_CONFIG_VDDRF1V0_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDRF1V0_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */
  #define BICR_POWER_CONFIG_VDDRF1V0_Shorted (0x2UL) /*!< Power rail is shorted to VDD_1V0.                                    */

/* VDDAO0V8 @Bits 12..15 : VDD_AO_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDAO0V8_Pos (12UL)      /*!< Position of VDDAO0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDAO0V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDAO0V8_Pos) /*!< Bit mask of VDDAO0V8 field.            */
  #define BICR_POWER_CONFIG_VDDAO0V8_Min (0x0UL)     /*!< Min enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Max (0xFUL)     /*!< Max enumerator value of VDDAO0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDAO0V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDAO0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDAO0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* VDDVS0V8 @Bits 16..19 : VDD_VS_0V8 power configuration. */
  #define BICR_POWER_CONFIG_VDDVS0V8_Pos (16UL)      /*!< Position of VDDVS0V8 field.                                          */
  #define BICR_POWER_CONFIG_VDDVS0V8_Msk (0xFUL << BICR_POWER_CONFIG_VDDVS0V8_Pos) /*!< Bit mask of VDDVS0V8 field.            */
  #define BICR_POWER_CONFIG_VDDVS0V8_Min (0x0UL)     /*!< Min enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Max (0xFUL)     /*!< Max enumerator value of VDDVS0V8 field.                              */
  #define BICR_POWER_CONFIG_VDDVS0V8_Unconfigured (0xFUL) /*!< Power rail is unconfigured.                                     */
  #define BICR_POWER_CONFIG_VDDVS0V8_Internal (0x0UL) /*!< Power rail is configured to use the internal regulator.             */
  #define BICR_POWER_CONFIG_VDDVS0V8_External (0x1UL) /*!< Power rail is configured to be externally powered.                  */

/* INDUCTOR @Bit 31 : DC/DC inductor presence. */
  #define BICR_POWER_CONFIG_INDUCTOR_Pos (31UL)      /*!< Position of INDUCTOR field.                                          */
  #define BICR_POWER_CONFIG_INDUCTOR_Msk (0x1UL << BICR_POWER_CONFIG_INDUCTOR_Pos) /*!< Bit mask of INDUCTOR field.            */
  #define BICR_POWER_CONFIG_INDUCTOR_Min (0x0UL)     /*!< Min enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_Max (0x1UL)     /*!< Max enumerator value of INDUCTOR field.                              */
  #define BICR_POWER_CONFIG_INDUCTOR_NotPresent (0x1UL) /*!< DC/DC inductor is not present.                                    */
  #define BICR_POWER_CONFIG_INDUCTOR_Present (0x0UL) /*!< DC/DC inductor is present.                                           */



/* =================================================== Struct BICR_IOPORT ==================================================== */
/**
  * @brief IOPORT [BICR_IOPORT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER0;                            /*!< (@ 0x00000000) Power configuration for P0 to P7 IO ports.            */
  __IOM uint32_t  POWER1;                            /*!< (@ 0x00000004) Power configuration for P8 to P15 IO ports.           */
  __IOM uint32_t  DRIVECTRL0;                        /*!< (@ 0x00000008) Drive control configuration for P0 to P7 IO ports.    */
  __IOM uint32_t  DRIVECTRL1;                        /*!< (@ 0x0000000C) Drive control configuration for P8 to P15 IO ports.   */
} NRF_BICR_IOPORT_Type;                              /*!< Size = 16 (0x010)                                                    */

/* BICR_IOPORT_POWER0: Power configuration for P0 to P7 IO ports. */
  #define BICR_IOPORT_POWER0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POWER0 register.                                    */

/* P0 @Bits 0..3 : P0 power configuration. */
  #define BICR_IOPORT_POWER0_P0_Pos (0UL)            /*!< Position of P0 field.                                                */
  #define BICR_IOPORT_POWER0_P0_Msk (0xFUL << BICR_IOPORT_POWER0_P0_Pos) /*!< Bit mask of P0 field.                            */
  #define BICR_IOPORT_POWER0_P0_Min (0x0UL)          /*!< Min enumerator value of P0 field.                                    */
  #define BICR_IOPORT_POWER0_P0_Max (0xFUL)          /*!< Max enumerator value of P0 field.                                    */
  #define BICR_IOPORT_POWER0_P0_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P0_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P0_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P0_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */

/* P1 @Bits 4..7 : P1 power configuration. */
  #define BICR_IOPORT_POWER0_P1_Pos (4UL)            /*!< Position of P1 field.                                                */
  #define BICR_IOPORT_POWER0_P1_Msk (0xFUL << BICR_IOPORT_POWER0_P1_Pos) /*!< Bit mask of P1 field.                            */
  #define BICR_IOPORT_POWER0_P1_Min (0x0UL)          /*!< Min enumerator value of P1 field.                                    */
  #define BICR_IOPORT_POWER0_P1_Max (0xFUL)          /*!< Max enumerator value of P1 field.                                    */
  #define BICR_IOPORT_POWER0_P1_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P1_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P1_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P1_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */

/* P2 @Bits 8..11 : P2 power configuration. */
  #define BICR_IOPORT_POWER0_P2_Pos (8UL)            /*!< Position of P2 field.                                                */
  #define BICR_IOPORT_POWER0_P2_Msk (0xFUL << BICR_IOPORT_POWER0_P2_Pos) /*!< Bit mask of P2 field.                            */
  #define BICR_IOPORT_POWER0_P2_Min (0x0UL)          /*!< Min enumerator value of P2 field.                                    */
  #define BICR_IOPORT_POWER0_P2_Max (0xFUL)          /*!< Max enumerator value of P2 field.                                    */
  #define BICR_IOPORT_POWER0_P2_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P2_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P2_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P2_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */

/* P6 @Bits 24..27 : P6 power configuration. */
  #define BICR_IOPORT_POWER0_P6_Pos (24UL)           /*!< Position of P6 field.                                                */
  #define BICR_IOPORT_POWER0_P6_Msk (0xFUL << BICR_IOPORT_POWER0_P6_Pos) /*!< Bit mask of P6 field.                            */
  #define BICR_IOPORT_POWER0_P6_Min (0x0UL)          /*!< Min enumerator value of P6 field.                                    */
  #define BICR_IOPORT_POWER0_P6_Max (0xFUL)          /*!< Max enumerator value of P6 field.                                    */
  #define BICR_IOPORT_POWER0_P6_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P6_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P6_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P6_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */

/* P7 @Bits 28..31 : P7 power configuration. */
  #define BICR_IOPORT_POWER0_P7_Pos (28UL)           /*!< Position of P7 field.                                                */
  #define BICR_IOPORT_POWER0_P7_Msk (0xFUL << BICR_IOPORT_POWER0_P7_Pos) /*!< Bit mask of P7 field.                            */
  #define BICR_IOPORT_POWER0_P7_Min (0x0UL)          /*!< Min enumerator value of P7 field.                                    */
  #define BICR_IOPORT_POWER0_P7_Max (0xFUL)          /*!< Max enumerator value of P7 field.                                    */
  #define BICR_IOPORT_POWER0_P7_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER0_P7_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER0_P7_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER0_P7_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */


