tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* BICR_IOPORT_POWER1: Power configuration for P8 to P15 IO ports. */
  #define BICR_IOPORT_POWER1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POWER1 register.                                    */

/* P9 @Bits 4..7 : P9 power configuration. */
  #define BICR_IOPORT_POWER1_P9_Pos (4UL)            /*!< Position of P9 field.                                                */
  #define BICR_IOPORT_POWER1_P9_Msk (0xFUL << BICR_IOPORT_POWER1_P9_Pos) /*!< Bit mask of P9 field.                            */
  #define BICR_IOPORT_POWER1_P9_Min (0x0UL)          /*!< Min enumerator value of P9 field.                                    */
  #define BICR_IOPORT_POWER1_P9_Max (0xFUL)          /*!< Max enumerator value of P9 field.                                    */
  #define BICR_IOPORT_POWER1_P9_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER1_P9_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER1_P9_Shorted (0x1UL)      /*!< Port supply is shorted to VDD_AO_1V8.                                */
  #define BICR_IOPORT_POWER1_P9_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V.                         */
  #define BICR_IOPORT_POWER1_P9_External3V (0x3UL)   /*!< Port supply is provided externally at 3 V.                           */
  #define BICR_IOPORT_POWER1_P9_ExternalFull (0x4UL) /*!< Port supply is provided externally with a full range of values, from 3
                                                          V to 1.8 V.*/


/* BICR_IOPORT_DRIVECTRL0: Drive control configuration for P0 to P7 IO ports. */
  #define BICR_IOPORT_DRIVECTRL0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DRIVECTRL0 register.                            */

/* P0 @Bits 0..3 : P0 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P0_Pos (0UL)        /*!< Position of P0 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P0_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P0_Pos) /*!< Bit mask of P0 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P0_Min (0xFUL)      /*!< Min enumerator value of P0 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P0_Max (0xFUL)      /*!< Max enumerator value of P0 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P0_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/

/* P1 @Bits 4..7 : P1 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P1_Pos (4UL)        /*!< Position of P1 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P1_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P1_Pos) /*!< Bit mask of P1 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P1_Min (0xFUL)      /*!< Min enumerator value of P1 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P1_Max (0xFUL)      /*!< Max enumerator value of P1 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P1_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/

/* P2 @Bits 8..11 : P2 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P2_Pos (8UL)        /*!< Position of P2 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P2_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P2_Pos) /*!< Bit mask of P2 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P2_Min (0xFUL)      /*!< Min enumerator value of P2 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P2_Max (0xFUL)      /*!< Max enumerator value of P2 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P2_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/

/* P6 @Bits 24..27 : P6 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P6_Pos (24UL)       /*!< Position of P6 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P6_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P6_Pos) /*!< Bit mask of P6 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Min (0x0UL)      /*!< Min enumerator value of P6 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Max (0xFUL)      /*!< Max enumerator value of P6 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms33 (0x0UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms40 (0x1UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms50 (0x2UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms66 (0x3UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms100 (0x4UL)  /*!< PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.                     */

/* P7 @Bits 28..31 : P7 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P7_Pos (28UL)       /*!< Position of P7 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P7_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P7_Pos) /*!< Bit mask of P7 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Min (0x0UL)      /*!< Min enumerator value of P7 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Max (0xFUL)      /*!< Max enumerator value of P7 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms33 (0x0UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms40 (0x1UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms50 (0x2UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms66 (0x3UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms100 (0x4UL)  /*!< PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.                     */


/* BICR_IOPORT_DRIVECTRL1: Drive control configuration for P8 to P15 IO ports. */
  #define BICR_IOPORT_DRIVECTRL1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DRIVECTRL1 register.                            */

/* P9 @Bits 4..7 : P9 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL1_P9_Pos (4UL)        /*!< Position of P9 field.                                                */
  #define BICR_IOPORT_DRIVECTRL1_P9_Msk (0xFUL << BICR_IOPORT_DRIVECTRL1_P9_Pos) /*!< Bit mask of P9 field.                    */
  #define BICR_IOPORT_DRIVECTRL1_P9_Min (0xFUL)      /*!< Min enumerator value of P9 field.                                    */
  #define BICR_IOPORT_DRIVECTRL1_P9_Max (0xFUL)      /*!< Max enumerator value of P9 field.                                    */
  #define BICR_IOPORT_DRIVECTRL1_P9_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/



/* ==================================================== Struct BICR_LFOSC ==================================================== */
/**
  * @brief LFOSC [BICR_LFOSC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) LF oscillator configuration.                          */
  __IOM uint32_t  LFXOCONFIG;                        /*!< (@ 0x00000004) LFXO configuration.                                   */
  __IOM uint32_t  LFXOCAL;                           /*!< (@ 0x00000008) LFXO calibration needed. Must be written to 0xFFFFFFFF
                                                                         after any modification of the LFXO board circuit, load
                                                                         capacitance, or crystal swap.*/
  __IOM uint32_t  LFRCAUTOCALCONFIG;                 /*!< (@ 0x0000000C) LFRC autocalibration configuration.                   */
} NRF_BICR_LFOSC_Type;                               /*!< Size = 16 (0x010)                                                    */

/* BICR_LFOSC_CONFIG: LF oscillator configuration. */
  #define BICR_LFOSC_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                     */

/* SRC @Bits 0..3 : LF oscillator source. */
  #define BICR_LFOSC_CONFIG_SRC_Pos (0UL)            /*!< Position of SRC field.                                               */
  #define BICR_LFOSC_CONFIG_SRC_Msk (0xFUL << BICR_LFOSC_CONFIG_SRC_Pos) /*!< Bit mask of SRC field.                           */
  #define BICR_LFOSC_CONFIG_SRC_Min (0x0UL)          /*!< Min enumerator value of SRC field.                                   */
  #define BICR_LFOSC_CONFIG_SRC_Max (0xFUL)          /*!< Max enumerator value of SRC field.                                   */
  #define BICR_LFOSC_CONFIG_SRC_Unconfigured (0xFUL) /*!< LF oscillator source is unconfigured. Default will be used.          */
  #define BICR_LFOSC_CONFIG_SRC_LFXO (0x0UL)         /*!< Use LFXO as source for the LF oscillator.                            */
  #define BICR_LFOSC_CONFIG_SRC_LFRC (0x1UL)         /*!< Use LFRC as source for the LF oscillator.                            */
  #define BICR_LFOSC_CONFIG_SRC_Synth (0x3UL)        /*!< Use LF Synth as source for the LF oscillator.                        */


