tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* BICR_LFOSC_LFXOCONFIG: LFXO configuration. */
  #define BICR_LFOSC_LFXOCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFXOCONFIG register.                             */

/* ACCURACY @Bits 0..3 : LFXO crystal or external signal accuracy. */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos (0UL)   /*!< Position of ACCURACY field.                                          */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Msk (0xFUL << BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.    */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Min (0x0UL) /*!< Min enumerator value of ACCURACY field.                              */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Max (0xFUL) /*!< Max enumerator value of ACCURACY field.                              */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Unconfigured (0xFUL) /*!< The accuracy is unconfigured.                               */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_500ppm (0x0UL) /*!< LFXO crystal or external signal has an accuracy of 500 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_250ppm (0x1UL) /*!< LFXO crystal or external signal has an accuracy of 250 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_150ppm (0x2UL) /*!< LFXO crystal or external signal has an accuracy of 150 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_100ppm (0x3UL) /*!< LFXO crystal or external signal has an accuracy of 100 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_75ppm (0x4UL) /*!< LFXO crystal or external signal has an accuracy of 75 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_50ppm (0x5UL) /*!< LFXO crystal or external signal has an accuracy of 50 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_30ppm (0x6UL) /*!< LFXO crystal or external signal has an accuracy of 30 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_20ppm (0x7UL) /*!< LFXO crystal or external signal has an accuracy of 20 ppm.         */

/* MODE @Bits 4..6 : LFXO mode. LFXO will not start unless MODE is configured. */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Pos (4UL)       /*!< Position of MODE field.                                              */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Msk (0x7UL << BICR_LFOSC_LFXOCONFIG_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Max (0x7UL)     /*!< Max enumerator value of MODE field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                       */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Pierce (0x0UL)  /*!< LFXO Pierce mode.                                                    */
  #define BICR_LFOSC_LFXOCONFIG_MODE_PIXO (0x1UL)    /*!< LFXO PIXO mode.                                                      */
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSine (0x2UL) /*!< LFXO in external sine wave mode.                                     */
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSquare (0x3UL) /*!< LFXO in external square wave mode.                                 */

/* LOADCAP @Bits 8..15 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos (8UL)    /*!< Position of LOADCAP field.                                           */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Msk (0xFFUL << BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos) /*!< Bit mask of LOADCAP field.      */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Min (0x0UL)  /*!< Min enumerator value of LOADCAP field.                               */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Max (0xFFUL) /*!< Max enumerator value of LOADCAP field.                               */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. LFXO will not
                                                                   start unless LOADCAP is configured.*/
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors
                                                               will be used.*/

/* TIME @Bits 16..27 : LFXO startup time in ms. */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Pos (16UL)      /*!< Position of TIME field.                                              */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Msk (0xFFFUL << BICR_LFOSC_LFXOCONFIG_TIME_Pos) /*!< Bit mask of TIME field.              */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Min (0xFFFUL)   /*!< Min enumerator value of TIME field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Max (0xFFFUL)   /*!< Max enumerator value of TIME field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Unconfigured (0xFFFUL) /*!< Startup time has not been configured.                         */


/* BICR_LFOSC_LFXOCAL: LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit,
                        load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFXOCAL register.                                   */

/* LFXOCAL @Bits 0..31 : LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                         circuit, load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Pos (0UL)       /*!< Position of LFXOCAL field.                                           */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Msk (0xFFFFFFFFUL << BICR_LFOSC_LFXOCAL_LFXOCAL_Pos) /*!< Bit mask of LFXOCAL field.      */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of LFXOCAL field.                            */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of LFXOCAL field.                            */
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Calibrate (0xFFFFFFFFUL) /*!< Calibrate the LFXO at startup.                              */


/* BICR_LFOSC_LFRCAUTOCALCONFIG: LFRC autocalibration configuration. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFRCAUTOCALCONFIG register.               */

/* TEMPINTERVAL @Bits 0..6 : Temperature measurement interval in 0.25 s steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos (0UL) /*!< Position of TEMPINTERVAL field.                             */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Msk (0x7FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos) /*!< Bit mask
                                                                            of TEMPINTERVAL field.*/

/* TEMPDELTA @Bits 8..13 : Temperature delta that should trigger a calibration in 0.25 degrees steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos (8UL) /*!< Position of TEMPDELTA field.                                   */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Msk (0x3FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos) /*!< Bit mask of
                                                                            TEMPDELTA field.*/

/* INTERVALMAXNO @Bits 16..20 : Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature
                                changes. */

  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos (16UL) /*!< Position of INTERVALMAXNO field.                          */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Msk (0x1FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos) /*!< Bit
                                                                            mask of INTERVALMAXNO field.*/

