tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ENABLE @Bit 31 : LFRC.AUTOCALCONFIG register enable. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos (31UL) /*!< Position of ENABLE field.                                        */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Msk (0x1UL << BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                           */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                           */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Enabled (0x0UL) /*!< LFRC.AUTOCALCONFIG register has been configured and can be
                                                                   used.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Disabled (0x1UL) /*!< LFRC.AUTOCALCONFIG register has not been configured and
                                                                    cannot be used.*/



/* ==================================================== Struct BICR_HFXO ===================================================== */
/**
  * @brief HFXO [BICR_HFXO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) HFXO configuration.                                   */
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000004) HFXO startup time in us.                              */
} NRF_BICR_HFXO_Type;                                /*!< Size = 8 (0x008)                                                     */

/* BICR_HFXO_CONFIG: HFXO configuration. */
  #define BICR_HFXO_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                      */

/* MODE @Bits 8..10 : HFXO mode. */
  #define BICR_HFXO_CONFIG_MODE_Pos (8UL)            /*!< Position of MODE field.                                              */
  #define BICR_HFXO_CONFIG_MODE_Msk (0x7UL << BICR_HFXO_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define BICR_HFXO_CONFIG_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define BICR_HFXO_CONFIG_MODE_Max (0x7UL)          /*!< Max enumerator value of MODE field.                                  */
  #define BICR_HFXO_CONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                            */
  #define BICR_HFXO_CONFIG_MODE_Pierce (0x0UL)       /*!< HFXO Pierce mode.                                                    */
  #define BICR_HFXO_CONFIG_MODE_PIXO (0x1UL)         /*!< HFXO PIXO mode.                                                      */
  #define BICR_HFXO_CONFIG_MODE_ExtSquare (0x3UL)    /*!< HFXO in external square wave mode.                                   */
  #define BICR_HFXO_CONFIG_MODE_Auto (0x6UL)         /*!< Either Pierce or PIXO automatically handled by the system based on
                                                          system requests.*/

/* LOADCAP @Bits 12..19 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define BICR_HFXO_CONFIG_LOADCAP_Pos (12UL)        /*!< Position of LOADCAP field.                                           */
  #define BICR_HFXO_CONFIG_LOADCAP_Msk (0xFFUL << BICR_HFXO_CONFIG_LOADCAP_Pos) /*!< Bit mask of LOADCAP field.                */
  #define BICR_HFXO_CONFIG_LOADCAP_Min (0x0UL)       /*!< Min enumerator value of LOADCAP field.                               */
  #define BICR_HFXO_CONFIG_LOADCAP_Max (0xFFUL)      /*!< Max enumerator value of LOADCAP field.                               */
  #define BICR_HFXO_CONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. HFXO will not start
                                                              unless LOADCAP is configured.*/
  #define BICR_HFXO_CONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors will
                                                          be used.*/


/* BICR_HFXO_STARTUPTIME: HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STARTUPTIME register.                            */

/* TIME @Bits 0..31 : HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_TIME_Pos (0UL)       /*!< Position of TIME field.                                              */
  #define BICR_HFXO_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_HFXO_STARTUPTIME_TIME_Pos) /*!< Bit mask of TIME field.         */
  #define BICR_HFXO_STARTUPTIME_TIME_Min (0xFFFFFFFFUL) /*!< Min enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Max (0xFFFFFFFFUL) /*!< Max enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL) /*!< Startup time has not been configured.                    */



/* ==================================================== Struct BICR_TAMPC ==================================================== */
/**
  * @brief TAMPC [BICR_TAMPC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TAMPERSWITCH;                      /*!< (@ 0x00000000) Configuration for external tamper switch detector.    */
  __IOM uint32_t  ACTIVESHIELD;                      /*!< (@ 0x00000004) Configuration for active shield channels.             */
} NRF_BICR_TAMPC_Type;                               /*!< Size = 8 (0x008)                                                     */

/* BICR_TAMPC_TAMPERSWITCH: Configuration for external tamper switch detector. */
  #define BICR_TAMPC_TAMPERSWITCH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAMPERSWITCH register.                         */

/* TAMPERSWITCH @Bits 0..3 : Tamper switch enable. */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos (0UL) /*!< Position of TAMPERSWITCH field.                                  */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Msk (0xFUL << BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos) /*!< Bit mask of
                                                                            TAMPERSWITCH field.*/
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Min (0x0UL) /*!< Min enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Max (0xFUL) /*!< Max enumerator value of TAMPERSWITCH field.                    */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Disabled (0xFUL) /*!< Tamper switch is disabled.                                */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Enabled (0x0UL) /*!< Tamper switch is enabled.                                  */


/* BICR_TAMPC_ACTIVESHIELD: Configuration for active shield channels. */
  #define BICR_TAMPC_ACTIVESHIELD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ACTIVESHIELD register.                         */

/* CHEN0 @Bits 0..3 : Active shield enable for channel 0. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos (0UL)    /*!< Position of CHEN0 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos) /*!< Bit mask of CHEN0 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Min (0x0UL)  /*!< Min enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Max (0xFUL)  /*!< Max enumerator value of CHEN0 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Disabled (0xFUL) /*!< Active shield channel 0 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Enabled (0x0UL) /*!< Active shield channel 0 is enabled.                               */

/* CHEN1 @Bits 4..7 : Active shield enable for channel 1. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos (4UL)    /*!< Position of CHEN1 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos) /*!< Bit mask of CHEN1 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Min (0x0UL)  /*!< Min enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Max (0xFUL)  /*!< Max enumerator value of CHEN1 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Disabled (0xFUL) /*!< Active shield channel 1 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Enabled (0x0UL) /*!< Active shield channel 1 is enabled.                               */

/* CHEN2 @Bits 8..11 : Active shield enable for channel 2. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos (8UL)    /*!< Position of CHEN2 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos) /*!< Bit mask of CHEN2 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Min (0x0UL)  /*!< Min enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Max (0xFUL)  /*!< Max enumerator value of CHEN2 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Disabled (0xFUL) /*!< Active shield channel 2 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Enabled (0x0UL) /*!< Active shield channel 2 is enabled.                               */

/* CHEN3 @Bits 12..15 : Active shield enable for channel 3. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos (12UL)   /*!< Position of CHEN3 field.                                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos) /*!< Bit mask of CHEN3 field.         */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Min (0x0UL)  /*!< Min enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Max (0xFUL)  /*!< Max enumerator value of CHEN3 field.                                 */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Disabled (0xFUL) /*!< Active shield channel 3 is disabled.                             */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Enabled (0x0UL) /*!< Active shield channel 3 is enabled.                               */


