tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TASKS_ERASE @Bit 0 : Erase the cache. */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Pos (0UL)    /*!< Position of TASKS_ERASE field.                                       */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Msk (0x1UL << CACHE_TASKS_ERASE_TASKS_ERASE_Pos) /*!< Bit mask of TASKS_ERASE field.   */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Min (0x1UL)  /*!< Min enumerator value of TASKS_ERASE field.                           */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Max (0x1UL)  /*!< Max enumerator value of TASKS_ERASE field.                           */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Trigger (0x1UL) /*!< Trigger task                                                      */


/* CACHE_EVENTS_DONE: Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DONE register.                                */

/* EVENTS_DONE @Bit 0 : Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Pos (0UL)    /*!< Position of EVENTS_DONE field.                                       */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Msk (0x1UL << CACHE_EVENTS_DONE_EVENTS_DONE_Pos) /*!< Bit mask of EVENTS_DONE field.   */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_DONE field.                           */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_DONE field.                           */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Generated (0x1UL) /*!< Event generated                                                 */


/* CACHE_INTEN: Enable or disable interrupt */
  #define CACHE_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* DONE @Bit 0 : Enable or disable interrupt for event DONE */
  #define CACHE_INTEN_DONE_Pos (0UL)                 /*!< Position of DONE field.                                              */
  #define CACHE_INTEN_DONE_Msk (0x1UL << CACHE_INTEN_DONE_Pos) /*!< Bit mask of DONE field.                                    */
  #define CACHE_INTEN_DONE_Min (0x0UL)               /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTEN_DONE_Max (0x1UL)               /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTEN_DONE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CACHE_INTEN_DONE_Enabled (0x1UL)           /*!< Enable                                                               */


/* CACHE_INTENSET: Enable interrupt */
  #define CACHE_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* DONE @Bit 0 : Write '1' to enable interrupt for event DONE */
  #define CACHE_INTENSET_DONE_Pos (0UL)              /*!< Position of DONE field.                                              */
  #define CACHE_INTENSET_DONE_Msk (0x1UL << CACHE_INTENSET_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CACHE_INTENSET_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTENSET_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTENSET_DONE_Set (0x1UL)            /*!< Enable                                                               */
  #define CACHE_INTENSET_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CACHE_INTENSET_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CACHE_INTENCLR: Disable interrupt */
  #define CACHE_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* DONE @Bit 0 : Write '1' to disable interrupt for event DONE */
  #define CACHE_INTENCLR_DONE_Pos (0UL)              /*!< Position of DONE field.                                              */
  #define CACHE_INTENCLR_DONE_Msk (0x1UL << CACHE_INTENCLR_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CACHE_INTENCLR_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTENCLR_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTENCLR_DONE_Clear (0x1UL)          /*!< Disable                                                              */
  #define CACHE_INTENCLR_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CACHE_INTENCLR_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* CACHE_INTPEND: Pending interrupts */
  #define CACHE_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* DONE @Bit 0 : Read pending status of interrupt for event DONE */
  #define CACHE_INTPEND_DONE_Pos (0UL)               /*!< Position of DONE field.                                              */
  #define CACHE_INTPEND_DONE_Msk (0x1UL << CACHE_INTPEND_DONE_Pos) /*!< Bit mask of DONE field.                                */
  #define CACHE_INTPEND_DONE_Min (0x0UL)             /*!< Min enumerator value of DONE field.                                  */
  #define CACHE_INTPEND_DONE_Max (0x1UL)             /*!< Max enumerator value of DONE field.                                  */
  #define CACHE_INTPEND_DONE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CACHE_INTPEND_DONE_Pending (0x1UL)         /*!< Read: Pending                                                        */


/* CACHE_STATUS: Status of the cache activities. */
  #define CACHE_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

