tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* READY @Bit 0 : Ready status. */
  #define CACHE_STATUS_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define CACHE_STATUS_READY_Msk (0x1UL << CACHE_STATUS_READY_Pos) /*!< Bit mask of READY field.                               */
  #define CACHE_STATUS_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define CACHE_STATUS_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define CACHE_STATUS_READY_Ready (0x0UL)           /*!< Activity is done and ready for the next activity.                    */
  #define CACHE_STATUS_READY_Busy (0x1UL)            /*!< Activity is in progress.                                             */


/* CACHE_ENABLE: Enable cache. */
  #define CACHE_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable cache */
  #define CACHE_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define CACHE_ENABLE_ENABLE_Msk (0x1UL << CACHE_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define CACHE_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Max (0x1UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define CACHE_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable cache                                                        */
  #define CACHE_ENABLE_ENABLE_Enabled (0x1UL)        /*!< Enable cache                                                         */


/* CACHE_MODE: Cache mode. */
  #define CACHE_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bit 0 : Cache mode */
  #define CACHE_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define CACHE_MODE_MODE_Msk (0x1UL << CACHE_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define CACHE_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Max (0x1UL)                /*!< Max enumerator value of MODE field.                                  */
  #define CACHE_MODE_MODE_Cache (0x0UL)              /*!< Cache mode                                                           */
  #define CACHE_MODE_MODE_Ram (0x1UL)                /*!< RAM mode                                                             */

/* RAMSIZE @Bits 4..5 : RAM size */
  #define CACHE_MODE_RAMSIZE_Pos (4UL)               /*!< Position of RAMSIZE field.                                           */
  #define CACHE_MODE_RAMSIZE_Msk (0x3UL << CACHE_MODE_RAMSIZE_Pos) /*!< Bit mask of RAMSIZE field.                             */
  #define CACHE_MODE_RAMSIZE_Min (0x0UL)             /*!< Min enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_Max (0x3UL)             /*!< Max enumerator value of RAMSIZE field.                               */
  #define CACHE_MODE_RAMSIZE_All (0x0UL)             /*!< All RAM is used for cache memory                                     */
  #define CACHE_MODE_RAMSIZE_Half (0x1UL)            /*!< Half of the RAM is used for cache memory                             */
  #define CACHE_MODE_RAMSIZE_Quarter (0x2UL)         /*!< Quarter of the RAM is used for cache memory                          */
  #define CACHE_MODE_RAMSIZE_None (0x3UL)            /*!< None of the RAM is used for cache memory                             */


/* CACHE_LINEADDR: Memory address covered by the line to be maintained. */
  #define CACHE_LINEADDR_ResetValue (0x00000000UL)   /*!< Reset value of LINEADDR register.                                    */

/* ADDR @Bits 0..31 : Address. */
  #define CACHE_LINEADDR_ADDR_Pos (0UL)              /*!< Position of ADDR field.                                              */
  #define CACHE_LINEADDR_ADDR_Msk (0xFFFFFFFFUL << CACHE_LINEADDR_ADDR_Pos) /*!< Bit mask of ADDR field.                       */


/* CACHE_DEBUGLOCK: Lock debug mode. */
  #define CACHE_DEBUGLOCK_ResetValue (0x00000000UL)  /*!< Reset value of DEBUGLOCK register.                                   */

/* DEBUGLOCK @Bit 0 : Lock debug mode */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Pos (0UL)        /*!< Position of DEBUGLOCK field.                                         */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Msk (0x1UL << CACHE_DEBUGLOCK_DEBUGLOCK_Pos) /*!< Bit mask of DEBUGLOCK field.             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Min (0x0UL)      /*!< Min enumerator value of DEBUGLOCK field.                             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Max (0x1UL)      /*!< Max enumerator value of DEBUGLOCK field.                             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Unlocked (0x0UL) /*!< Debug mode unlocked                                                  */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Locked (0x1UL)   /*!< Debug mode locked. Ignores any other value written.                  */


/* CACHE_WRITELOCK: Lock cache updates. */
  #define CACHE_WRITELOCK_ResetValue (0x00000000UL)  /*!< Reset value of WRITELOCK register.                                   */

/* WRITELOCK @Bit 0 : Lock cache updates */
  #define CACHE_WRITELOCK_WRITELOCK_Pos (0UL)        /*!< Position of WRITELOCK field.                                         */
  #define CACHE_WRITELOCK_WRITELOCK_Msk (0x1UL << CACHE_WRITELOCK_WRITELOCK_Pos) /*!< Bit mask of WRITELOCK field.             */
  #define CACHE_WRITELOCK_WRITELOCK_Min (0x0UL)      /*!< Min enumerator value of WRITELOCK field.                             */
  #define CACHE_WRITELOCK_WRITELOCK_Max (0x1UL)      /*!< Max enumerator value of WRITELOCK field.                             */
  #define CACHE_WRITELOCK_WRITELOCK_Unlocked (0x0UL) /*!< Cache updates unlocked                                               */
  #define CACHE_WRITELOCK_WRITELOCK_Locked (0x1UL)   /*!< Cache updates locked                                                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         CACHEDATA                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct CACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [CACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[2];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/
} NRF_CACHEDATA_SET_WAY_DU_Type;                     /*!< Size = 8 (0x008)                                                     */
  #define CACHEDATA_SET_WAY_DU_MaxCount (4UL)        /*!< Size of DU[4] array.                                                 */
  #define CACHEDATA_SET_WAY_DU_MaxIndex (3UL)        /*!< Max index of DU[4] array.                                            */
  #define CACHEDATA_SET_WAY_DU_MinIndex (0UL)        /*!< Min index of DU[4] array.                                            */

/* CACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define CACHEDATA_SET_WAY_DU_DATA_MaxCount (2UL)   /*!< Max size of DATA[2] array.                                           */
  #define CACHEDATA_SET_WAY_DU_DATA_MaxIndex (1UL)   /*!< Max index of DATA[2] array.                                          */
  #define CACHEDATA_SET_WAY_DU_DATA_MinIndex (0UL)   /*!< Min index of DATA[2] array.                                          */
  #define CACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[2] register.                            */

/* Data @Bits 0..31 : Data */
  #define CACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)   /*!< Position of Data field.                                              */
  #define CACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << CACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data field. */



/* ================================================ Struct CACHEDATA_SET_WAY ================================================= */
/**
  * @brief WAY [CACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_CACHEDATA_SET_WAY_DU_Type DU[4];         /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_CACHEDATA_SET_WAY_Type;                        /*!< Size = 32 (0x020)                                                    */
