tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define CACHEDATA_SET_WAY_MaxCount (2UL)           /*!< Size of WAY[2] array.                                                */
  #define CACHEDATA_SET_WAY_MaxIndex (1UL)           /*!< Max index of WAY[2] array.                                           */
  #define CACHEDATA_SET_WAY_MinIndex (0UL)           /*!< Min index of WAY[2] array.                                           */


/* ================================================== Struct CACHEDATA_SET =================================================== */
/**
  * @brief SET [CACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_CACHEDATA_SET_WAY_Type WAY[2];           /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_CACHEDATA_SET_Type;                            /*!< Size = 64 (0x040)                                                    */
  #define CACHEDATA_SET_MaxCount (256UL)             /*!< Size of SET[256] array.                                              */
  #define CACHEDATA_SET_MaxIndex (255UL)             /*!< Max index of SET[256] array.                                         */
  #define CACHEDATA_SET_MinIndex (0UL)               /*!< Min index of SET[256] array.                                         */

/* ==================================================== Struct CACHEDATA ===================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {                                   /*!< CACHEDATA Structure                                                  */
    __IOM NRF_CACHEDATA_SET_Type SET[256];           /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_CACHEDATA_Type;                              /*!< Size = 16384 (0x4000)                                                */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         CACHEINFO                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct CACHEINFO_SET =================================================== */
/**
  * @brief SET [CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM uint32_t  WAY[2];                            /*!< (@ 0x00000000) Cache information for SET[n], WAY[o].                 */
} NRF_CACHEINFO_SET_Type;                            /*!< Size = 8 (0x008)                                                     */
  #define CACHEINFO_SET_MaxCount (256UL)             /*!< Size of SET[256] array.                                              */
  #define CACHEINFO_SET_MaxIndex (255UL)             /*!< Max index of SET[256] array.                                         */
  #define CACHEINFO_SET_MinIndex (0UL)               /*!< Min index of SET[256] array.                                         */

/* CACHEINFO_SET_WAY: Cache information for SET[n], WAY[o]. */
  #define CACHEINFO_SET_WAY_MaxCount (2UL)           /*!< Max size of WAY[2] array.                                            */
  #define CACHEINFO_SET_WAY_MaxIndex (1UL)           /*!< Max index of WAY[2] array.                                           */
  #define CACHEINFO_SET_WAY_MinIndex (0UL)           /*!< Min index of WAY[2] array.                                           */
  #define CACHEINFO_SET_WAY_ResetValue (0x00000000UL) /*!< Reset value of WAY[2] register.                                     */

/* TAG @Bits 0..23 : Cache tag. */
  #define CACHEINFO_SET_WAY_TAG_Pos (0UL)            /*!< Position of TAG field.                                               */
  #define CACHEINFO_SET_WAY_TAG_Msk (0xFFFFFFUL << CACHEINFO_SET_WAY_TAG_Pos) /*!< Bit mask of TAG field.                      */

/* DUV0 @Bit 24 : Data unit valid info. */
  #define CACHEINFO_SET_WAY_DUV0_Pos (24UL)          /*!< Position of DUV0 field.                                              */
  #define CACHEINFO_SET_WAY_DUV0_Msk (0x1UL << CACHEINFO_SET_WAY_DUV0_Pos) /*!< Bit mask of DUV0 field.                        */
  #define CACHEINFO_SET_WAY_DUV0_Min (0x0UL)         /*!< Min enumerator value of DUV0 field.                                  */
  #define CACHEINFO_SET_WAY_DUV0_Max (0x1UL)         /*!< Max enumerator value of DUV0 field.                                  */
  #define CACHEINFO_SET_WAY_DUV0_Invalid (0x0UL)     /*!< Invalid data unit                                                    */
  #define CACHEINFO_SET_WAY_DUV0_Valid (0x1UL)       /*!< Valid data unit                                                      */

/* DUV1 @Bit 25 : Data unit valid info. */
  #define CACHEINFO_SET_WAY_DUV1_Pos (25UL)          /*!< Position of DUV1 field.                                              */
  #define CACHEINFO_SET_WAY_DUV1_Msk (0x1UL << CACHEINFO_SET_WAY_DUV1_Pos) /*!< Bit mask of DUV1 field.                        */
  #define CACHEINFO_SET_WAY_DUV1_Min (0x0UL)         /*!< Min enumerator value of DUV1 field.                                  */
  #define CACHEINFO_SET_WAY_DUV1_Max (0x1UL)         /*!< Max enumerator value of DUV1 field.                                  */
  #define CACHEINFO_SET_WAY_DUV1_Invalid (0x0UL)     /*!< Invalid data unit                                                    */
  #define CACHEINFO_SET_WAY_DUV1_Valid (0x1UL)       /*!< Valid data unit                                                      */

/* DUV2 @Bit 26 : Data unit valid info. */
  #define CACHEINFO_SET_WAY_DUV2_Pos (26UL)          /*!< Position of DUV2 field.                                              */
  #define CACHEINFO_SET_WAY_DUV2_Msk (0x1UL << CACHEINFO_SET_WAY_DUV2_Pos) /*!< Bit mask of DUV2 field.                        */
  #define CACHEINFO_SET_WAY_DUV2_Min (0x0UL)         /*!< Min enumerator value of DUV2 field.                                  */
  #define CACHEINFO_SET_WAY_DUV2_Max (0x1UL)         /*!< Max enumerator value of DUV2 field.                                  */
  #define CACHEINFO_SET_WAY_DUV2_Invalid (0x0UL)     /*!< Invalid data unit                                                    */
  #define CACHEINFO_SET_WAY_DUV2_Valid (0x1UL)       /*!< Valid data unit                                                      */

