tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* DUV3 @Bit 27 : Data unit valid info. */
  #define CACHEINFO_SET_WAY_DUV3_Pos (27UL)          /*!< Position of DUV3 field.                                              */
  #define CACHEINFO_SET_WAY_DUV3_Msk (0x1UL << CACHEINFO_SET_WAY_DUV3_Pos) /*!< Bit mask of DUV3 field.                        */
  #define CACHEINFO_SET_WAY_DUV3_Min (0x0UL)         /*!< Min enumerator value of DUV3 field.                                  */
  #define CACHEINFO_SET_WAY_DUV3_Max (0x1UL)         /*!< Max enumerator value of DUV3 field.                                  */
  #define CACHEINFO_SET_WAY_DUV3_Invalid (0x0UL)     /*!< Invalid data unit                                                    */
  #define CACHEINFO_SET_WAY_DUV3_Valid (0x1UL)       /*!< Valid data unit                                                      */

/* D0 @Bit 28 : Dirty data unit 0. */
  #define CACHEINFO_SET_WAY_D0_Pos (28UL)            /*!< Position of D0 field.                                                */
  #define CACHEINFO_SET_WAY_D0_Msk (0x1UL << CACHEINFO_SET_WAY_D0_Pos) /*!< Bit mask of D0 field.                              */
  #define CACHEINFO_SET_WAY_D0_Min (0x0UL)           /*!< Min enumerator value of D0 field.                                    */
  #define CACHEINFO_SET_WAY_D0_Max (0x1UL)           /*!< Max enumerator value of D0 field.                                    */
  #define CACHEINFO_SET_WAY_D0_Clean (0x0UL)         /*!< Clean data unit                                                      */
  #define CACHEINFO_SET_WAY_D0_Dirty (0x1UL)         /*!< Dirty data unit                                                      */

/* D1 @Bit 29 : Dirty data unit 1. */
  #define CACHEINFO_SET_WAY_D1_Pos (29UL)            /*!< Position of D1 field.                                                */
  #define CACHEINFO_SET_WAY_D1_Msk (0x1UL << CACHEINFO_SET_WAY_D1_Pos) /*!< Bit mask of D1 field.                              */
  #define CACHEINFO_SET_WAY_D1_Min (0x0UL)           /*!< Min enumerator value of D1 field.                                    */
  #define CACHEINFO_SET_WAY_D1_Max (0x1UL)           /*!< Max enumerator value of D1 field.                                    */
  #define CACHEINFO_SET_WAY_D1_Clean (0x0UL)         /*!< Clean data unit                                                      */
  #define CACHEINFO_SET_WAY_D1_Dirty (0x1UL)         /*!< Dirty data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define CACHEINFO_SET_WAY_V_Pos (30UL)             /*!< Position of V field.                                                 */
  #define CACHEINFO_SET_WAY_V_Msk (0x1UL << CACHEINFO_SET_WAY_V_Pos) /*!< Bit mask of V field.                                 */
  #define CACHEINFO_SET_WAY_V_Min (0x0UL)            /*!< Min enumerator value of V field.                                     */
  #define CACHEINFO_SET_WAY_V_Max (0x1UL)            /*!< Max enumerator value of V field.                                     */
  #define CACHEINFO_SET_WAY_V_Invalid (0x0UL)        /*!< Invalid cache line                                                   */
  #define CACHEINFO_SET_WAY_V_Valid (0x1UL)          /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define CACHEINFO_SET_WAY_MRU_Pos (31UL)           /*!< Position of MRU field.                                               */
  #define CACHEINFO_SET_WAY_MRU_Msk (0x1UL << CACHEINFO_SET_WAY_MRU_Pos) /*!< Bit mask of MRU field.                           */
  #define CACHEINFO_SET_WAY_MRU_Min (0x0UL)          /*!< Min enumerator value of MRU field.                                   */
  #define CACHEINFO_SET_WAY_MRU_Max (0x1UL)          /*!< Max enumerator value of MRU field.                                   */
  #define CACHEINFO_SET_WAY_MRU_Way0 (0x0UL)         /*!< Way0 was most recently used                                          */
  #define CACHEINFO_SET_WAY_MRU_Way1 (0x1UL)         /*!< Way1 was most recently used                                          */


/* ==================================================== Struct CACHEINFO ===================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< CACHEINFO Structure                                                  */
    __IOM NRF_CACHEINFO_SET_Type SET[256];           /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_CACHEINFO_Type;                              /*!< Size = 2048 (0x800)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CAN                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CAN ======================================================== */
/**
  * @brief Controller Area Network
  */
  typedef struct {                                   /*!< CAN Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the CAN peripheral.                             */
    __OM uint32_t TASKS_STOPREQ;                     /*!< (@ 0x00000004) Request to stop the CAN peripheral                    */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000008) Stop the CAN peripheral                               */
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_CORE[2];                   /*!< (@ 0x00000100) Event indicating that interrupt n triggered at CAN
                                                                         core*/
    __IOM uint32_t EVENTS_DMU;                       /*!< (@ 0x00000108) Event indicating that interrupt triggered at CAN DMU  */
    __IOM uint32_t EVENTS_DMA;                       /*!< (@ 0x0000010C) Event indicating that interrupt triggered at CAN DMA  */
    __IOM uint32_t EVENTS_READYFORSTOP;              /*!< (@ 0x00000110) Event indicating that the CAN is ready to be stopped  */
    __IM uint32_t RESERVED1[59];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
  } NRF_CAN_Type;                                    /*!< Size = 784 (0x310)                                                   */

/* CAN_TASKS_START: Start the CAN peripheral. */
  #define CAN_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start the CAN peripheral. */
  #define CAN_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define CAN_TASKS_START_TASKS_START_Msk (0x1UL << CAN_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define CAN_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define CAN_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define CAN_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


