tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CAN_TASKS_STOPREQ: Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPREQ register.                              */

/* TASKS_STOPREQ @Bit 0 : Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos (0UL)  /*!< Position of TASKS_STOPREQ field.                                     */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Msk (0x1UL << CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos) /*!< Bit mask of TASKS_STOPREQ
                                                                            field.*/
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPREQ field.                        */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPREQ field.                        */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Trigger (0x1UL) /*!< Trigger task                                                    */


/* CAN_TASKS_STOP: Stop the CAN peripheral */
  #define CAN_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the CAN peripheral */
  #define CAN_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define CAN_TASKS_STOP_TASKS_STOP_Msk (0x1UL << CAN_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define CAN_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define CAN_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define CAN_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* CAN_EVENTS_CORE: Event indicating that interrupt n triggered at CAN core */
  #define CAN_EVENTS_CORE_MaxCount (2UL)             /*!< Max size of EVENTS_CORE[2] array.                                    */
  #define CAN_EVENTS_CORE_MaxIndex (1UL)             /*!< Max index of EVENTS_CORE[2] array.                                   */
  #define CAN_EVENTS_CORE_MinIndex (0UL)             /*!< Min index of EVENTS_CORE[2] array.                                   */
  #define CAN_EVENTS_CORE_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_CORE[2] register.                              */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt n triggered at CAN core */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Pos (0UL)      /*!< Position of EVENTS_CORE field.                                       */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << CAN_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.       */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)    /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)    /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define CAN_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                   */


/* CAN_EVENTS_DMU: Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_DMU register.                                  */

/* EVENTS_DMU @Bit 0 : Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Pos (0UL)        /*!< Position of EVENTS_DMU field.                                        */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Msk (0x1UL << CAN_EVENTS_DMU_EVENTS_DMU_Pos) /*!< Bit mask of EVENTS_DMU field.            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Min (0x0UL)      /*!< Min enumerator value of EVENTS_DMU field.                            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Max (0x1UL)      /*!< Max enumerator value of EVENTS_DMU field.                            */
  #define CAN_EVENTS_DMU_EVENTS_DMU_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Generated (0x1UL) /*!< Event generated                                                     */


/* CAN_EVENTS_DMA: Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_DMA register.                                  */

/* EVENTS_DMA @Bit 0 : Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Pos (0UL)        /*!< Position of EVENTS_DMA field.                                        */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Msk (0x1UL << CAN_EVENTS_DMA_EVENTS_DMA_Pos) /*!< Bit mask of EVENTS_DMA field.            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Min (0x0UL)      /*!< Min enumerator value of EVENTS_DMA field.                            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Max (0x1UL)      /*!< Max enumerator value of EVENTS_DMA field.                            */
  #define CAN_EVENTS_DMA_EVENTS_DMA_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Generated (0x1UL) /*!< Event generated                                                     */


/* CAN_EVENTS_READYFORSTOP: Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYFORSTOP register.                  */

/* EVENTS_READYFORSTOP @Bit 0 : Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos (0UL) /*!< Position of EVENTS_READYFORSTOP field.                    */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Msk (0x1UL << CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos) /*!< Bit
                                                                            mask of EVENTS_READYFORSTOP field.*/
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYFORSTOP field.      */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYFORSTOP field.      */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Generated (0x1UL) /*!< Event generated                                   */


