tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CM33SS_LOCK_LOCKMPUS_Pos (2UL)             /*!< Position of LOCKMPUS field.                                          */
  #define CM33SS_LOCK_LOCKMPUS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUS_Pos) /*!< Bit mask of LOCKMPUS field.                        */
  #define CM33SS_LOCK_LOCKMPUS_Min (0x0UL)           /*!< Min enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_Max (0x1UL)           /*!< Max enumerator value of LOCKMPUS field.                              */
  #define CM33SS_LOCK_LOCKMPUS_NotLocked (0x0UL)     /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUS_Locked (0x1UL)        /*!< Prevents changes to MPU registers.                                   */

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CM33SS_LOCK_LOCKMPUNS_Pos (3UL)            /*!< Position of LOCKMPUNS field.                                         */
  #define CM33SS_LOCK_LOCKMPUNS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUNS_Pos) /*!< Bit mask of LOCKMPUNS field.                     */
  #define CM33SS_LOCK_LOCKMPUNS_Min (0x0UL)          /*!< Min enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_Max (0x1UL)          /*!< Max enumerator value of LOCKMPUNS field.                             */
  #define CM33SS_LOCK_LOCKMPUNS_NotLocked (0x0UL)    /*!< MPU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKMPUNS_Locked (0x1UL)       /*!< Prevents changes to MPU registers.                                   */

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CM33SS_LOCK_LOCKSAU_Pos (4UL)              /*!< Position of LOCKSAU field.                                           */
  #define CM33SS_LOCK_LOCKSAU_Msk (0x1UL << CM33SS_LOCK_LOCKSAU_Pos) /*!< Bit mask of LOCKSAU field.                           */
  #define CM33SS_LOCK_LOCKSAU_Min (0x0UL)            /*!< Min enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_Max (0x1UL)            /*!< Max enumerator value of LOCKSAU field.                               */
  #define CM33SS_LOCK_LOCKSAU_NotLocked (0x0UL)      /*!< SAU registers can be changed.                                        */
  #define CM33SS_LOCK_LOCKSAU_Locked (0x1UL)         /*!< Prevents changes to SAU registers.                                   */


/* CM33SS_CPUID: The identifier for the CPU in this subsystem. */
  #define CM33SS_CPUID_ResetValue (0x00000000UL)     /*!< Reset value of CPUID register.                                       */

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CM33SS_CPUID_CPUID_Pos (0UL)               /*!< Position of CPUID field.                                             */
  #define CM33SS_CPUID_CPUID_Msk (0xFFFFFFFFUL << CM33SS_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct COMP ======================================================= */
/**
  * @brief Comparator
  */
  typedef struct {                                   /*!< COMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value                               */
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) COMP is ready and output is valid                     */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[61];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) COMP enable                                           */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Pin select                                            */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference source select for single-ended mode         */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[2];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t CONFIGVOLTLVL;                  /*!< (@ 0x00000518) Configure voltage level for analog input              */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t TH;                               /*!< (@ 0x00000530) Threshold configuration for hysteresis unit           */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000534) Mode configuration                                    */
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
    __IOM uint32_t ISOURCE;                          /*!< (@ 0x0000053C) Current source select on analog input                 */
  } NRF_COMP_Type;                                   /*!< Size = 1344 (0x540)                                                  */

/* COMP_TASKS_START: Start comparator */
  #define COMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

