tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UP @Bit 2 : Write '1' to disable interrupt for event UP */
  #define COMP_INTENCLR_UP_Pos (2UL)                 /*!< Position of UP field.                                                */
  #define COMP_INTENCLR_UP_Msk (0x1UL << COMP_INTENCLR_UP_Pos) /*!< Bit mask of UP field.                                      */
  #define COMP_INTENCLR_UP_Min (0x0UL)               /*!< Min enumerator value of UP field.                                    */
  #define COMP_INTENCLR_UP_Max (0x1UL)               /*!< Max enumerator value of UP field.                                    */
  #define COMP_INTENCLR_UP_Clear (0x1UL)             /*!< Disable                                                              */
  #define COMP_INTENCLR_UP_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define COMP_INTENCLR_UP_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* CROSS @Bit 3 : Write '1' to disable interrupt for event CROSS */
  #define COMP_INTENCLR_CROSS_Pos (3UL)              /*!< Position of CROSS field.                                             */
  #define COMP_INTENCLR_CROSS_Msk (0x1UL << COMP_INTENCLR_CROSS_Pos) /*!< Bit mask of CROSS field.                             */
  #define COMP_INTENCLR_CROSS_Min (0x0UL)            /*!< Min enumerator value of CROSS field.                                 */
  #define COMP_INTENCLR_CROSS_Max (0x1UL)            /*!< Max enumerator value of CROSS field.                                 */
  #define COMP_INTENCLR_CROSS_Clear (0x1UL)          /*!< Disable                                                              */
  #define COMP_INTENCLR_CROSS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define COMP_INTENCLR_CROSS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* COMP_RESULT: Compare result */
  #define COMP_RESULT_ResetValue (0x00000000UL)      /*!< Reset value of RESULT register.                                      */

/* RESULT @Bit 0 : Result of last compare. Decision point SAMPLE task. */
  #define COMP_RESULT_RESULT_Pos (0UL)               /*!< Position of RESULT field.                                            */
  #define COMP_RESULT_RESULT_Msk (0x1UL << COMP_RESULT_RESULT_Pos) /*!< Bit mask of RESULT field.                              */
  #define COMP_RESULT_RESULT_Min (0x0UL)             /*!< Min enumerator value of RESULT field.                                */
  #define COMP_RESULT_RESULT_Max (0x1UL)             /*!< Max enumerator value of RESULT field.                                */
  #define COMP_RESULT_RESULT_Below (0x0UL)           /*!< Input voltage is below the threshold (VIN+ < VIN-)                   */
  #define COMP_RESULT_RESULT_Above (0x1UL)           /*!< Input voltage is above the threshold (VIN+ > VIN-)                   */


/* COMP_ENABLE: COMP enable */
  #define COMP_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable COMP */
  #define COMP_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define COMP_ENABLE_ENABLE_Msk (0x3UL << COMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define COMP_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define COMP_ENABLE_ENABLE_Max (0x2UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define COMP_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable                                                              */
  #define COMP_ENABLE_ENABLE_Enabled (0x2UL)         /*!< Enable                                                               */


/* COMP_PSEL: Pin select */
  #define COMP_PSEL_ResetValue (0x00000000UL)        /*!< Reset value of PSEL register.                                        */

/* PSEL @Bits 0..3 : Analog pin select */
  #define COMP_PSEL_PSEL_Pos (0UL)                   /*!< Position of PSEL field.                                              */
  #define COMP_PSEL_PSEL_Msk (0xFUL << COMP_PSEL_PSEL_Pos) /*!< Bit mask of PSEL field.                                        */
  #define COMP_PSEL_PSEL_Min (0x0UL)                 /*!< Min enumerator value of PSEL field.                                  */
  #define COMP_PSEL_PSEL_Max (0x9UL)                 /*!< Max enumerator value of PSEL field.                                  */
  #define COMP_PSEL_PSEL_AnalogInput0 (0x0UL)        /*!< AIN0 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput1 (0x1UL)        /*!< AIN1 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput2 (0x2UL)        /*!< AIN2 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput3 (0x3UL)        /*!< AIN3 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput4 (0x4UL)        /*!< AIN4 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput5 (0x5UL)        /*!< AIN5 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput6 (0x6UL)        /*!< AIN6 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput7 (0x7UL)        /*!< AIN7 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput8 (0x8UL)        /*!< AIN8 selected as analog input                                        */
  #define COMP_PSEL_PSEL_AnalogInput9 (0x9UL)        /*!< AIN9 selected as analog input                                        */


/* COMP_REFSEL: Reference source select for single-ended mode */
  #define COMP_REFSEL_ResetValue (0x00000004UL)      /*!< Reset value of REFSEL register.                                      */

/* REFSEL @Bits 0..2 : Reference select */
  #define COMP_REFSEL_REFSEL_Pos (0UL)               /*!< Position of REFSEL field.                                            */
  #define COMP_REFSEL_REFSEL_Msk (0x7UL << COMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field.                              */
  #define COMP_REFSEL_REFSEL_Min (0x0UL)             /*!< Min enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Max (0x5UL)             /*!< Max enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Int1V2 (0x0UL)          /*!< VREF = internal 1.2 V reference (AVDD_AO_1V8 >= 1.7 V)               */
  #define COMP_REFSEL_REFSEL_AVDDAO1V8 (0x4UL)       /*!< VREF = AVDD_AO_1V8                                                   */
  #define COMP_REFSEL_REFSEL_ARef (0x5UL)            /*!< VREF = AREF                                                          */


/* COMP_EXTREFSEL: External reference select */
  #define COMP_EXTREFSEL_ResetValue (0x00000000UL)   /*!< Reset value of EXTREFSEL register.                                   */

/* EXTREFSEL @Bits 0..3 : External analog reference select */
  #define COMP_EXTREFSEL_EXTREFSEL_Pos (0UL)         /*!< Position of EXTREFSEL field.                                         */
  #define COMP_EXTREFSEL_EXTREFSEL_Msk (0xFUL << COMP_EXTREFSEL_EXTREFSEL_Pos) /*!< Bit mask of EXTREFSEL field.               */
  #define COMP_EXTREFSEL_EXTREFSEL_Min (0x0UL)       /*!< Min enumerator value of EXTREFSEL field.                             */
  #define COMP_EXTREFSEL_EXTREFSEL_Max (0x9UL)       /*!< Max enumerator value of EXTREFSEL field.                             */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference0 (0x0UL) /*!< Use AIN0 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference1 (0x1UL) /*!< Use AIN1 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference2 (0x2UL) /*!< Use AIN2 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference3 (0x3UL) /*!< Use AIN3 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference4 (0x4UL) /*!< Use AIN4 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference5 (0x5UL) /*!< Use AIN5 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference6 (0x6UL) /*!< Use AIN6 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference7 (0x7UL) /*!< Use AIN7 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference8 (0x8UL) /*!< Use AIN8 as external analog reference                         */
  #define COMP_EXTREFSEL_EXTREFSEL_AnalogReference9 (0x9UL) /*!< Use AIN9 as external analog reference                         */


/* COMP_CONFIGVOLTLVL: Configure voltage level for analog input */
  #define COMP_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                             */

/* EN @Bit 0 : Enable 3.3V on analog input */
  #define COMP_CONFIGVOLTLVL_EN_Pos (0UL)            /*!< Position of EN field.                                                */
  #define COMP_CONFIGVOLTLVL_EN_Msk (0x1UL << COMP_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.                            */
  #define COMP_CONFIGVOLTLVL_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define COMP_CONFIGVOLTLVL_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define COMP_CONFIGVOLTLVL_EN_Disable (0x0UL)      /*!< Disable                                                              */
  #define COMP_CONFIGVOLTLVL_EN_Enable (0x1UL)       /*!< Enable                                                               */


/* COMP_TH: Threshold configuration for hysteresis unit */
  #define COMP_TH_ResetValue (0x00002020UL)          /*!< Reset value of TH register.                                          */

/* THDOWN @Bits 0..5 : VDOWN = (THDOWN+1)/64*VREF */
  #define COMP_TH_THDOWN_Pos (0UL)                   /*!< Position of THDOWN field.                                            */
  #define COMP_TH_THDOWN_Msk (0x3FUL << COMP_TH_THDOWN_Pos) /*!< Bit mask of THDOWN field.                                     */
  #define COMP_TH_THDOWN_Min (0x00UL)                /*!< Min value of THDOWN field.                                           */
  #define COMP_TH_THDOWN_Max (0x3FUL)                /*!< Max size of THDOWN field.                                            */

/* THUP @Bits 8..13 : VUP = (THUP+1)/64*VREF */
  #define COMP_TH_THUP_Pos (8UL)                     /*!< Position of THUP field.                                              */
  #define COMP_TH_THUP_Msk (0x3FUL << COMP_TH_THUP_Pos) /*!< Bit mask of THUP field.                                           */
  #define COMP_TH_THUP_Min (0x00UL)                  /*!< Min value of THUP field.                                             */
  #define COMP_TH_THUP_Max (0x3FUL)                  /*!< Max size of THUP field.                                              */


