tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* COMP_MODE: Mode configuration */
  #define COMP_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* SP @Bit 0 : Speed and power modes */
  #define COMP_MODE_SP_Pos (0UL)                     /*!< Position of SP field.                                                */
  #define COMP_MODE_SP_Msk (0x1UL << COMP_MODE_SP_Pos) /*!< Bit mask of SP field.                                              */
  #define COMP_MODE_SP_Min (0x0UL)                   /*!< Min enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Max (0x1UL)                   /*!< Max enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Low (0x0UL)                   /*!< Low-power mode                                                       */
  #define COMP_MODE_SP_High (0x1UL)                  /*!< High-speed mode                                                      */

/* MAIN @Bit 8 : Main operation modes */
  #define COMP_MODE_MAIN_Pos (8UL)                   /*!< Position of MAIN field.                                              */
  #define COMP_MODE_MAIN_Msk (0x1UL << COMP_MODE_MAIN_Pos) /*!< Bit mask of MAIN field.                                        */
  #define COMP_MODE_MAIN_Min (0x0UL)                 /*!< Min enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_Max (0x1UL)                 /*!< Max enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_SE (0x0UL)                  /*!< Single-ended mode                                                    */
  #define COMP_MODE_MAIN_Diff (0x1UL)                /*!< Differential mode                                                    */


/* COMP_HYST: Comparator hysteresis enable */
  #define COMP_HYST_ResetValue (0x00000000UL)        /*!< Reset value of HYST register.                                        */

/* HYST @Bit 0 : Comparator hysteresis */
  #define COMP_HYST_HYST_Pos (0UL)                   /*!< Position of HYST field.                                              */
  #define COMP_HYST_HYST_Msk (0x1UL << COMP_HYST_HYST_Pos) /*!< Bit mask of HYST field.                                        */
  #define COMP_HYST_HYST_Min (0x0UL)                 /*!< Min enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_Max (0x1UL)                 /*!< Max enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_NoHyst (0x0UL)              /*!< Comparator hysteresis disabled                                       */
  #define COMP_HYST_HYST_Hyst40mV (0x1UL)            /*!< Comparator hysteresis enabled                                        */


/* COMP_ISOURCE: Current source select on analog input */
  #define COMP_ISOURCE_ResetValue (0x00000000UL)     /*!< Reset value of ISOURCE register.                                     */

/* ISOURCE @Bits 0..1 : Current source select on analog input */
  #define COMP_ISOURCE_ISOURCE_Pos (0UL)             /*!< Position of ISOURCE field.                                           */
  #define COMP_ISOURCE_ISOURCE_Msk (0x3UL << COMP_ISOURCE_ISOURCE_Pos) /*!< Bit mask of ISOURCE field.                         */
  #define COMP_ISOURCE_ISOURCE_Min (0x0UL)           /*!< Min enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Max (0x3UL)           /*!< Max enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Off (0x0UL)           /*!< Current source disabled                                              */
  #define COMP_ISOURCE_ISOURCE_Ien2uA5 (0x1UL)       /*!< Current source enabled (+/- 2.5 uA)                                  */
  #define COMP_ISOURCE_ISOURCE_Ien5uA (0x2UL)        /*!< Current source enabled (+/- 5 uA)                                    */
  #define COMP_ISOURCE_ISOURCE_Ien10uA (0x3UL)       /*!< Current source enabled (+/- 10 uA)                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CTI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CTI ======================================================== */
/**
  * @brief Cross-Trigger Interface control
  */
  typedef struct {                                   /*!< CTI Structure                                                        */
    __IOM uint32_t CTICONTROL;                       /*!< (@ 0x00000000) CTI Control register                                  */
    __IM uint32_t RESERVED[3];
    __OM uint32_t CTIINTACK;                         /*!< (@ 0x00000010) CTI Interrupt Acknowledge register                    */
    __IOM uint32_t CTIAPPSET;                        /*!< (@ 0x00000014) CTI Application Trigger Set register                  */
    __OM uint32_t CTIAPPCLEAR;                       /*!< (@ 0x00000018) CTI Application Trigger Clear register                */
    __OM uint32_t CTIAPPPULSE;                       /*!< (@ 0x0000001C) CTI Application Pulse register                        */
    __IOM uint32_t CTIINEN[8];                       /*!< (@ 0x00000020) CTI Trigger to Channel Enable register                */
    __IM uint32_t RESERVED1[24];
    __IOM uint32_t CTIOUTEN[8];                      /*!< (@ 0x000000A0) CTI Channel to Trigger Enable register                */
    __IM uint32_t RESERVED2[28];
    __IM uint32_t CTITRIGINSTATUS;                   /*!< (@ 0x00000130) CTI Trigger In Status register                        */
    __IM uint32_t CTITRIGOUTSTATUS;                  /*!< (@ 0x00000134) CTI Trigger Out Status register                       */
    __IM uint32_t CTICHINSTATUS;                     /*!< (@ 0x00000138) CTI Channel In Status register                        */
    __IM uint32_t RESERVED3;
    __IOM uint32_t CTIGATE;                          /*!< (@ 0x00000140) Enable CTI Channel Gate register                      */
    __IM uint32_t RESERVED4[926];
    __IM uint32_t DEVARCH;                           /*!< (@ 0x00000FBC) Device Architecture register                          */
    __IM uint32_t RESERVED5[2];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier register                       */
    __IM uint32_t PIDR4;                             /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t PIDR5;                             /*!< (@ 0x00000FD4) Peripheral ID5 register                               */
    __IM uint32_t PIDR6;                             /*!< (@ 0x00000FD8) Peripheral ID6 register                               */
    __IM uint32_t PIDR7;                             /*!< (@ 0x00000FDC) Peripheral ID7 register                               */
    __IM uint32_t PIDR0;                             /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PIDR1;                             /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PIDR2;                             /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PIDR3;                             /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t CIDR0;                             /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t CIDR1;                             /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t CIDR2;                             /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t CIDR3;                             /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_CTI_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* CTI_CTICONTROL: CTI Control register */
  #define CTI_CTICONTROL_ResetValue (0x00000000UL)   /*!< Reset value of CTICONTROL register.                                  */

/* GLBEN @Bit 0 : Enables or disables the CTI. */
  #define CTI_CTICONTROL_GLBEN_Pos (0UL)             /*!< Position of GLBEN field.                                             */
  #define CTI_CTICONTROL_GLBEN_Msk (0x1UL << CTI_CTICONTROL_GLBEN_Pos) /*!< Bit mask of GLBEN field.                           */
  #define CTI_CTICONTROL_GLBEN_Min (0x0UL)           /*!< Min enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Max (0x1UL)           /*!< Max enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Disabled (0x0UL)      /*!< All cross-triggering mapping logic functionality is disabled.        */
  #define CTI_CTICONTROL_GLBEN_Enabled (0x1UL)       /*!< Cross-triggering mapping logic functionality is enabled.             */


/* CTI_CTIINTACK: CTI Interrupt Acknowledge register */
  #define CTI_CTIINTACK_ResetValue (0x00000000UL)    /*!< Reset value of CTIINTACK register.                                   */

