tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGOUTSTATUS0 @Bit 0 : Shows the status of ctitrigout0 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Pos (0UL) /*!< Position of TRIGOUTSTATUS0 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS0 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS0 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS0 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Active (0x1UL) /*!< Ctitrigout 0 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Inactive (0x0UL) /*!< Ctitrigout 0 is inactive.                                  */

/* TRIGOUTSTATUS1 @Bit 1 : Shows the status of ctitrigout1 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Pos (1UL) /*!< Position of TRIGOUTSTATUS1 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS1 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS1 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS1 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Active (0x1UL) /*!< Ctitrigout 1 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Inactive (0x0UL) /*!< Ctitrigout 1 is inactive.                                  */

/* TRIGOUTSTATUS2 @Bit 2 : Shows the status of ctitrigout2 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Pos (2UL) /*!< Position of TRIGOUTSTATUS2 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS2 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS2 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS2 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Active (0x1UL) /*!< Ctitrigout 2 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Inactive (0x0UL) /*!< Ctitrigout 2 is inactive.                                  */

/* TRIGOUTSTATUS3 @Bit 3 : Shows the status of ctitrigout3 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Pos (3UL) /*!< Position of TRIGOUTSTATUS3 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS3 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS3 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS3 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Active (0x1UL) /*!< Ctitrigout 3 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Inactive (0x0UL) /*!< Ctitrigout 3 is inactive.                                  */

/* TRIGOUTSTATUS4 @Bit 4 : Shows the status of ctitrigout4 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Pos (4UL) /*!< Position of TRIGOUTSTATUS4 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS4 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS4 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS4 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Active (0x1UL) /*!< Ctitrigout 4 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Inactive (0x0UL) /*!< Ctitrigout 4 is inactive.                                  */

/* TRIGOUTSTATUS5 @Bit 5 : Shows the status of ctitrigout5 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Pos (5UL) /*!< Position of TRIGOUTSTATUS5 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS5 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS5 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS5 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Active (0x1UL) /*!< Ctitrigout 5 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Inactive (0x0UL) /*!< Ctitrigout 5 is inactive.                                  */

/* TRIGOUTSTATUS6 @Bit 6 : Shows the status of ctitrigout6 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Pos (6UL) /*!< Position of TRIGOUTSTATUS6 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS6 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS6 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS6 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Active (0x1UL) /*!< Ctitrigout 6 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Inactive (0x0UL) /*!< Ctitrigout 6 is inactive.                                  */

/* TRIGOUTSTATUS7 @Bit 7 : Shows the status of ctitrigout7 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Pos (7UL) /*!< Position of TRIGOUTSTATUS7 field.                                 */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS7 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Min (0x0UL) /*!< Min enumerator value of TRIGOUTSTATUS7 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Max (0x1UL) /*!< Max enumerator value of TRIGOUTSTATUS7 field.                   */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Active (0x1UL) /*!< Ctitrigout 7 is active.                                      */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Inactive (0x0UL) /*!< Ctitrigout 7 is inactive.                                  */


/* CTI_CTICHINSTATUS: CTI Channel In Status register */
  #define CTI_CTICHINSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CTICHINSTATUS register.                              */

