tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CTRLAPPERI_MAILBOX_RXSTATUS: Status to indicate if data sent from the debugger to the CPU has been read */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of RXSTATUS register.                         */

/* RXSTATUS @Bit 0 : Status of data in register RXDATA */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos (0UL) /*!< Position of RXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos) /*!< Bit mask of RXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Min (0x0UL) /*!< Min enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Max (0x1UL) /*!< Max enumerator value of RXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register RXDATA                   */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_DataPending (0x1UL) /*!< Data pending in register RXDATA                        */


/* CTRLAPPERI_MAILBOX_TXDATA: Data sent from the CPU to the debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_ResetValue (0x00000000UL) /*!< Reset value of TXDATA register.                             */

/* TXDATA @Bits 0..31 : Data sent to debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos (0UL) /*!< Position of TXDATA field.                                            */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA
                                                                            field.*/


/* CTRLAPPERI_MAILBOX_TXSTATUS: Status to indicate if data sent from the CPU to the debugger has been read */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_ResetValue (0x00000000UL) /*!< Reset value of TXSTATUS register.                         */

/* TXSTATUS @Bit 0 : Status of data in register TXDATA */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos (0UL) /*!< Position of TXSTATUS field.                                      */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos) /*!< Bit mask of TXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Min (0x0UL) /*!< Min enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Max (0x1UL) /*!< Max enumerator value of TXSTATUS field.                        */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_NoDataPending (0x0UL) /*!< No data pending in register TXDATA                   */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_DataPending (0x1UL) /*!< Data pending in register TXDATA                        */


/* CTRLAPPERI_MAILBOX_BOOTMODE: Secure domain boot mode. */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_ResetValue (0x00000000UL) /*!< Reset value of BOOTMODE register.                         */

/* MODE @Bit 0 : Mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos (0UL) /*!< Position of MODE field.                                              */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos) /*!< Bit mask of MODE field.    */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Max (0x1UL) /*!< Max enumerator value of MODE field.                                */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Normal (0x0UL) /*!< Normal mode of operation                                        */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_ROMOperation (0x1UL) /*!< ROM operation mode                                        */


/* ==================================================== Struct CTRLAPPERI ==================================================== */
/**
  * @brief Control access port
  */
  typedef struct {                                   /*!< CTRLAPPERI Structure                                                 */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000100) The RXSTATUS is changed to DataPending                */
    __IOM uint32_t EVENTS_TXDONE;                    /*!< (@ 0x00000104) The TXSTATUS is changed to NoDataPending              */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CTRLAPPERI_MAILBOX_Type MAILBOX;       /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_CTRLAPPERI_Type;                             /*!< Size = 1164 (0x48C)                                                  */

/* CTRLAPPERI_EVENTS_RXREADY: The RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXREADY register.                     */

/* EVENTS_RXREADY @Bit 0 : The RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos (0UL) /*!< Position of EVENTS_RXREADY field.                            */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Msk (0x1UL << CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_RXREADY field.*/
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXREADY field.              */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXREADY field.              */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Generated (0x1UL) /*!< Event generated                                      */


/* CTRLAPPERI_EVENTS_TXDONE: The TXSTATUS is changed to NoDataPending */
  #define CTRLAPPERI_EVENTS_TXDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXDONE register.                       */

/* EVENTS_TXDONE @Bit 0 : The TXSTATUS is changed to NoDataPending */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos (0UL) /*!< Position of EVENTS_TXDONE field.                               */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Msk (0x1UL << CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_TXDONE field.*/
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXDONE field.                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXDONE field.                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Generated (0x1UL) /*!< Event generated                                        */


