tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CTRLAPPERI_INTPEND: Pending interrupts */
  #define CTRLAPPERI_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* RXREADY @Bit 0 : Read pending status of interrupt for event RXREADY */
  #define CTRLAPPERI_INTPEND_RXREADY_Pos (0UL)       /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTPEND_RXREADY_Msk (0x1UL << CTRLAPPERI_INTPEND_RXREADY_Pos) /*!< Bit mask of RXREADY field.             */
  #define CTRLAPPERI_INTPEND_RXREADY_Min (0x0UL)     /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_Max (0x1UL)     /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CTRLAPPERI_INTPEND_RXREADY_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXDONE @Bit 1 : Read pending status of interrupt for event TXDONE */
  #define CTRLAPPERI_INTPEND_TXDONE_Pos (1UL)        /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTPEND_TXDONE_Msk (0x1UL << CTRLAPPERI_INTPEND_TXDONE_Pos) /*!< Bit mask of TXDONE field.                */
  #define CTRLAPPERI_INTPEND_TXDONE_Min (0x0UL)      /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_Max (0x1UL)      /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define CTRLAPPERI_INTPEND_TXDONE_Pending (0x1UL)  /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            DMU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct DMU ======================================================== */
/**
  * @brief DMU
  */
  typedef struct {                                   /*!< DMU Structure                                                        */
    __IM uint32_t RESERVED[240];
    __IM uint32_t DMUCR;                             /*!< (@ 0x000003C0) DMU Core Release                                      */
    __IOM uint32_t DMUI;                             /*!< (@ 0x000003C4) DMU Internals                                         */
    __IOM uint32_t DMUQC;                            /*!< (@ 0x000003C8) DMU Queueing Counter                                  */
    __IOM uint32_t DMUIR;                            /*!< (@ 0x000003CC) DMU Interrupt Register                                */
    __IOM uint32_t DMUIE;                            /*!< (@ 0x000003D0) DMU Interrupt Enable                                  */
    __IOM uint32_t DMUC;                             /*!< (@ 0x000003D4) DMU Configuration                                     */
  } NRF_DMU_Type;                                    /*!< Size = 984 (0x3D8)                                                   */

/* DMU_DMUCR: DMU Core Release */
  #define DMU_DMUCR_ResetValue (0x00000000UL)        /*!< Reset value of DMUCR register.                                       */

/* REL @Bit 1 : Core Release */
  #define DMU_DMUCR_REL_Pos (1UL)                    /*!< Position of REL field.                                               */
  #define DMU_DMUCR_REL_Msk (0x1UL << DMU_DMUCR_REL_Pos) /*!< Bit mask of REL field.                                           */

/* STEP @Bit 2 : Step of Core Release */
  #define DMU_DMUCR_STEP_Pos (2UL)                   /*!< Position of STEP field.                                              */
  #define DMU_DMUCR_STEP_Msk (0x1UL << DMU_DMUCR_STEP_Pos) /*!< Bit mask of STEP field.                                        */

/* SUBSTEP @Bit 3 : Sub-step of Core Release */
  #define DMU_DMUCR_SUBSTEP_Pos (3UL)                /*!< Position of SUBSTEP field.                                           */
  #define DMU_DMUCR_SUBSTEP_Msk (0x1UL << DMU_DMUCR_SUBSTEP_Pos) /*!< Bit mask of SUBSTEP field.                               */

/* YEAR @Bit 4 : Time Stamp Year */
  #define DMU_DMUCR_YEAR_Pos (4UL)                   /*!< Position of YEAR field.                                              */
  #define DMU_DMUCR_YEAR_Msk (0x1UL << DMU_DMUCR_YEAR_Pos) /*!< Bit mask of YEAR field.                                        */

/* MON @Bit 6 : Time Stamp Month */
  #define DMU_DMUCR_MON_Pos (6UL)                    /*!< Position of MON field.                                               */
  #define DMU_DMUCR_MON_Msk (0x1UL << DMU_DMUCR_MON_Pos) /*!< Bit mask of MON field.                                           */

/* DAY @Bit 8 : Time Stamp Day */
  #define DMU_DMUCR_DAY_Pos (8UL)                    /*!< Position of DAY field.                                               */
  #define DMU_DMUCR_DAY_Msk (0x1UL << DMU_DMUCR_DAY_Pos) /*!< Bit mask of DAY field.                                           */


/* DMU_DMUI: DMU Internals */
  #define DMU_DMUI_ResetValue (0x00070000UL)         /*!< Reset value of DMUI register.                                        */

/* TXR @Bit 0 : TX Service Request line of DMU */
  #define DMU_DMUI_TXR_Pos (0UL)                     /*!< Position of TXR field.                                               */
  #define DMU_DMUI_TXR_Msk (0x1UL << DMU_DMUI_TXR_Pos) /*!< Bit mask of TXR field.                                             */
  #define DMU_DMUI_TXR_Min (0x0UL)                   /*!< Min enumerator value of TXR field.                                   */
  #define DMU_DMUI_TXR_Max (0x1UL)                   /*!< Max enumerator value of TXR field.                                   */
  #define DMU_DMUI_TXR_NotRequested (0x0UL)          /*!< No TX DMA service requested                                          */
  #define DMU_DMUI_TXR_Requested (0x1UL)             /*!< TX DMA Service requested                                             */

/* RX0R @Bit 1 : RX0 Service Request line of DMU */
  #define DMU_DMUI_RX0R_Pos (1UL)                    /*!< Position of RX0R field.                                              */
  #define DMU_DMUI_RX0R_Msk (0x1UL << DMU_DMUI_RX0R_Pos) /*!< Bit mask of RX0R field.                                          */
  #define DMU_DMUI_RX0R_Min (0x0UL)                  /*!< Min enumerator value of RX0R field.                                  */
  #define DMU_DMUI_RX0R_Max (0x1UL)                  /*!< Max enumerator value of RX0R field.                                  */
  #define DMU_DMUI_RX0R_NotRequested (0x0UL)         /*!< No RX0 DMA service requested                                         */
  #define DMU_DMUI_RX0R_Requested (0x1UL)            /*!< RX0 DMA Service requested                                            */

/* RX1R @Bit 2 : RX1 Service Request line of DMU */
  #define DMU_DMUI_RX1R_Pos (2UL)                    /*!< Position of RX1R field.                                              */
  #define DMU_DMUI_RX1R_Msk (0x1UL << DMU_DMUI_RX1R_Pos) /*!< Bit mask of RX1R field.                                          */
  #define DMU_DMUI_RX1R_Min (0x0UL)                  /*!< Min enumerator value of RX1R field.                                  */
  #define DMU_DMUI_RX1R_Max (0x1UL)                  /*!< Max enumerator value of RX1R field.                                  */
  #define DMU_DMUI_RX1R_NotRequested (0x0UL)         /*!< No RX1 DMA service requested                                         */
  #define DMU_DMUI_RX1R_Requested (0x1UL)            /*!< RX1 DMA Service requested                                            */

/* TXER @Bit 3 : TX Event Service Request line of DMU */
  #define DMU_DMUI_TXER_Pos (3UL)                    /*!< Position of TXER field.                                              */
  #define DMU_DMUI_TXER_Msk (0x1UL << DMU_DMUI_TXER_Pos) /*!< Bit mask of TXER field.                                          */
  #define DMU_DMUI_TXER_Min (0x0UL)                  /*!< Min enumerator value of TXER field.                                  */
  #define DMU_DMUI_TXER_Max (0x1UL)                  /*!< Max enumerator value of TXER field.                                  */
  #define DMU_DMUI_TXER_NotRequested (0x0UL)         /*!< No TX Event DMA service requested                                    */
  #define DMU_DMUI_TXER_Requested (0x1UL)            /*!< TX Event DMA Service requested                                       */

/* TFQPIP @Bits 8..12 : TX FIFO/Queue Put Index Previous */
  #define DMU_DMUI_TFQPIP_Pos (8UL)                  /*!< Position of TFQPIP field.                                            */
  #define DMU_DMUI_TFQPIP_Msk (0x1FUL << DMU_DMUI_TFQPIP_Pos) /*!< Bit mask of TFQPIP field.                                   */

/* ENA @Bit 15 : DMU is enabled */
  #define DMU_DMUI_ENA_Pos (15UL)                    /*!< Position of ENA field.                                               */
  #define DMU_DMUI_ENA_Msk (0x1UL << DMU_DMUI_ENA_Pos) /*!< Bit mask of ENA field.                                             */
  #define DMU_DMUI_ENA_Min (0x0UL)                   /*!< Min enumerator value of ENA field.                                   */
  #define DMU_DMUI_ENA_Max (0x1UL)                   /*!< Max enumerator value of ENA field.                                   */
  #define DMU_DMUI_ENA_Disabled (0x0UL)              /*!< DMU is disabled                                                      */
  #define DMU_DMUI_ENA_Enabled (0x1UL)               /*!< DMU is enabled and can process DMA data                              */

/* DEHS @Bits 16..18 : Detect Element Handler State */
  #define DMU_DMUI_DEHS_Pos (16UL)                   /*!< Position of DEHS field.                                              */
  #define DMU_DMUI_DEHS_Msk (0x7UL << DMU_DMUI_DEHS_Pos) /*!< Bit mask of DEHS field.                                          */

/* DTX @Bit 20 : Detect DMU Element Service */
  #define DMU_DMUI_DTX_Pos (20UL)                    /*!< Position of DTX field.                                               */
  #define DMU_DMUI_DTX_Msk (0x1UL << DMU_DMUI_DTX_Pos) /*!< Bit mask of DTX field.                                             */
  #define DMU_DMUI_DTX_Min (0x0UL)                   /*!< Min enumerator value of DTX field.                                   */
  #define DMU_DMUI_DTX_Max (0x1UL)                   /*!< Max enumerator value of DTX field.                                   */
  #define DMU_DMUI_DTX_Disabled (0x0UL)              /*!< Queueing of DMU Element does not activate interrupt flag             */
  #define DMU_DMUI_DTX_Enabled (0x1UL)               /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* DRX0 @Bit 21 : Detect DMU Element Service */
  #define DMU_DMUI_DRX0_Pos (21UL)                   /*!< Position of DRX0 field.                                              */
  #define DMU_DMUI_DRX0_Msk (0x1UL << DMU_DMUI_DRX0_Pos) /*!< Bit mask of DRX0 field.                                          */
  #define DMU_DMUI_DRX0_Min (0x0UL)                  /*!< Min enumerator value of DRX0 field.                                  */
  #define DMU_DMUI_DRX0_Max (0x1UL)                  /*!< Max enumerator value of DRX0 field.                                  */
  #define DMU_DMUI_DRX0_Disabled (0x0UL)             /*!< Queueing of DMU Element does not activate interrupt flag             */
  #define DMU_DMUI_DRX0_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* DRX1 @Bit 22 : Detect DMU Element Service */
  #define DMU_DMUI_DRX1_Pos (22UL)                   /*!< Position of DRX1 field.                                              */
  #define DMU_DMUI_DRX1_Msk (0x1UL << DMU_DMUI_DRX1_Pos) /*!< Bit mask of DRX1 field.                                          */
  #define DMU_DMUI_DRX1_Min (0x0UL)                  /*!< Min enumerator value of DRX1 field.                                  */
  #define DMU_DMUI_DRX1_Max (0x1UL)                  /*!< Max enumerator value of DRX1 field.                                  */
  #define DMU_DMUI_DRX1_Disabled (0x0UL)             /*!< Queueing of DMU Element does not activate interrupt flag             */
  #define DMU_DMUI_DRX1_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

