tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXEIAS @Bit 2 : TX Element Illegal Access Sequence */
  #define DMU_DMUIR_TXEIAS_Pos (2UL)                 /*!< Position of TXEIAS field.                                            */
  #define DMU_DMUIR_TXEIAS_Msk (0x1UL << DMU_DMUIR_TXEIAS_Pos) /*!< Bit mask of TXEIAS field.                                  */
  #define DMU_DMUIR_TXEIAS_Min (0x0UL)               /*!< Min enumerator value of TXEIAS field.                                */
  #define DMU_DMUIR_TXEIAS_Max (0x1UL)               /*!< Max enumerator value of TXEIAS field.                                */
  #define DMU_DMUIR_TXEIAS_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEIAS_NotGenerated (0x0UL)      /*!< No illegal addressing sequence detected                              */
  #define DMU_DMUIR_TXEIAS_Generated (0x1UL)         /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* TXEIDLC @Bit 3 : TX Element Illegal DLC */
  #define DMU_DMUIR_TXEIDLC_Pos (3UL)                /*!< Position of TXEIDLC field.                                           */
  #define DMU_DMUIR_TXEIDLC_Msk (0x1UL << DMU_DMUIR_TXEIDLC_Pos) /*!< Bit mask of TXEIDLC field.                               */
  #define DMU_DMUIR_TXEIDLC_Min (0x0UL)              /*!< Min enumerator value of TXEIDLC field.                               */
  #define DMU_DMUIR_TXEIDLC_Max (0x1UL)              /*!< Max enumerator value of TXEIDLC field.                               */
  #define DMU_DMUIR_TXEIDLC_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEIDLC_NotGenerated (0x0UL)     /*!< No illegal DLC detected                                              */
  #define DMU_DMUIR_TXEIDLC_Generated (0x1UL)        /*!< DLC exceeds Tx Buffer element size of MCAN, exception recovery
                                                          started.*/

/* TXEWATA @Bit 4 : TX Element Write After Trigger Address */
  #define DMU_DMUIR_TXEWATA_Pos (4UL)                /*!< Position of TXEWATA field.                                           */
  #define DMU_DMUIR_TXEWATA_Msk (0x1UL << DMU_DMUIR_TXEWATA_Pos) /*!< Bit mask of TXEWATA field.                               */
  #define DMU_DMUIR_TXEWATA_Min (0x0UL)              /*!< Min enumerator value of TXEWATA field.                               */
  #define DMU_DMUIR_TXEWATA_Max (0x1UL)              /*!< Max enumerator value of TXEWATA field.                               */
  #define DMU_DMUIR_TXEWATA_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEWATA_NotGenerated (0x0UL)     /*!< No write after Trigger Address                                       */
  #define DMU_DMUIR_TXEWATA_Generated (0x1UL)        /*!< Write after Trigger address detected                                 */

/* TXEIR @Bit 5 : TX Element Illegal Read */
  #define DMU_DMUIR_TXEIR_Pos (5UL)                  /*!< Position of TXEIR field.                                             */
  #define DMU_DMUIR_TXEIR_Msk (0x1UL << DMU_DMUIR_TXEIR_Pos) /*!< Bit mask of TXEIR field.                                     */
  #define DMU_DMUIR_TXEIR_Min (0x0UL)                /*!< Min enumerator value of TXEIR field.                                 */
  #define DMU_DMUIR_TXEIR_Max (0x1UL)                /*!< Max enumerator value of TXEIR field.                                 */
  #define DMU_DMUIR_TXEIR_Clear (0x1UL)              /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEIR_NotGenerated (0x0UL)       /*!< No read access                                                       */
  #define DMU_DMUIR_TXEIR_Generated (0x1UL)          /*!< Illegal read access to DMU TX Element section detected, exception
                                                          recovery started.*/

/* TXEE @Bit 6 : A successful enqueueing of a Tx message with the DMU TX Element section sets this flag. */
  #define DMU_DMUIR_TXEE_Pos (6UL)                   /*!< Position of TXEE field.                                              */
  #define DMU_DMUIR_TXEE_Msk (0x1UL << DMU_DMUIR_TXEE_Pos) /*!< Bit mask of TXEE field.                                        */
  #define DMU_DMUIR_TXEE_Min (0x0UL)                 /*!< Min enumerator value of TXEE field.                                  */
  #define DMU_DMUIR_TXEE_Max (0x1UL)                 /*!< Max enumerator value of TXEE field.                                  */
  #define DMU_DMUIR_TXEE_Clear (0x1UL)               /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEE_NotGenerated (0x0UL)        /*!< No Tx message enqueued                                               */
  #define DMU_DMUIR_TXEE_Generated (0x1UL)           /*!< Tx message successfully enqueued                                     */

/* RX0ENSA @Bit 7 : RX0 Element Not Start Address */
  #define DMU_DMUIR_RX0ENSA_Pos (7UL)                /*!< Position of RX0ENSA field.                                           */
  #define DMU_DMUIR_RX0ENSA_Msk (0x1UL << DMU_DMUIR_RX0ENSA_Pos) /*!< Bit mask of RX0ENSA field.                               */
  #define DMU_DMUIR_RX0ENSA_Min (0x0UL)              /*!< Min enumerator value of RX0ENSA field.                               */
  #define DMU_DMUIR_RX0ENSA_Max (0x1UL)              /*!< Max enumerator value of RX0ENSA field.                               */
  #define DMU_DMUIR_RX0ENSA_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0ENSA_NotGenerated (0x0UL)     /*!< No illegal read access                                               */
  #define DMU_DMUIR_RX0ENSA_Generated (0x1UL)        /*!< Read from RX0 Element begins without using start address, exception
                                                          recovery started.*/

/* RX0EID @Bit 8 : RX0 Element Illegal Dequeueing */
  #define DMU_DMUIR_RX0EID_Pos (8UL)                 /*!< Position of RX0EID field.                                            */
  #define DMU_DMUIR_RX0EID_Msk (0x1UL << DMU_DMUIR_RX0EID_Pos) /*!< Bit mask of RX0EID field.                                  */
  #define DMU_DMUIR_RX0EID_Min (0x0UL)               /*!< Min enumerator value of RX0EID field.                                */
  #define DMU_DMUIR_RX0EID_Max (0x1UL)               /*!< Max enumerator value of RX0EID field.                                */
  #define DMU_DMUIR_RX0EID_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0EID_NotGenerated (0x0UL)      /*!< No illegal dequeueing                                                */
  #define DMU_DMUIR_RX0EID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started,*/

/* RX0EIAS @Bit 9 : RX0 Element Illegal Access Sequence */
  #define DMU_DMUIR_RX0EIAS_Pos (9UL)                /*!< Position of RX0EIAS field.                                           */
  #define DMU_DMUIR_RX0EIAS_Msk (0x1UL << DMU_DMUIR_RX0EIAS_Pos) /*!< Bit mask of RX0EIAS field.                               */
  #define DMU_DMUIR_RX0EIAS_Min (0x0UL)              /*!< Min enumerator value of RX0EIAS field.                               */
  #define DMU_DMUIR_RX0EIAS_Max (0x1UL)              /*!< Max enumerator value of RX0EIAS field.                               */
  #define DMU_DMUIR_RX0EIAS_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0EIAS_NotGenerated (0x0UL)     /*!< No illegal addressing sequence detected                              */
  #define DMU_DMUIR_RX0EIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* RX0EIW @Bit 10 : RX0 Element Illegal Write */
  #define DMU_DMUIR_RX0EIW_Pos (10UL)                /*!< Position of RX0EIW field.                                            */
  #define DMU_DMUIR_RX0EIW_Msk (0x1UL << DMU_DMUIR_RX0EIW_Pos) /*!< Bit mask of RX0EIW field.                                  */
  #define DMU_DMUIR_RX0EIW_Min (0x0UL)               /*!< Min enumerator value of RX0EIW field.                                */
  #define DMU_DMUIR_RX0EIW_Max (0x1UL)               /*!< Max enumerator value of RX0EIW field.                                */
  #define DMU_DMUIR_RX0EIW_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0EIW_NotGenerated (0x0UL)      /*!< No write access detected                                             */
  #define DMU_DMUIR_RX0EIW_Generated (0x1UL)         /*!< Illegal write access to DMU RX0 Element detected, exception recovery
                                                          started.*/

/* RX0ED @Bit 11 : RX0 Element Dequeued */
  #define DMU_DMUIR_RX0ED_Pos (11UL)                 /*!< Position of RX0ED field.                                             */
  #define DMU_DMUIR_RX0ED_Msk (0x1UL << DMU_DMUIR_RX0ED_Pos) /*!< Bit mask of RX0ED field.                                     */
  #define DMU_DMUIR_RX0ED_Min (0x0UL)                /*!< Min enumerator value of RX0ED field.                                 */
  #define DMU_DMUIR_RX0ED_Max (0x1UL)                /*!< Max enumerator value of RX0ED field.                                 */
  #define DMU_DMUIR_RX0ED_Clear (0x1UL)              /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0ED_NotGenerated (0x0UL)       /*!< No Rx message dequeued                                               */
  #define DMU_DMUIR_RX0ED_Generated (0x1UL)          /*!< Rx message successfully dequeued                                     */

/* RX0EIO @Bit 12 : RX0 Element Illegal Overwrite by timestamp */
  #define DMU_DMUIR_RX0EIO_Pos (12UL)                /*!< Position of RX0EIO field.                                            */
  #define DMU_DMUIR_RX0EIO_Msk (0x1UL << DMU_DMUIR_RX0EIO_Pos) /*!< Bit mask of RX0EIO field.                                  */
  #define DMU_DMUIR_RX0EIO_Min (0x0UL)               /*!< Min enumerator value of RX0EIO field.                                */
  #define DMU_DMUIR_RX0EIO_Max (0x1UL)               /*!< Max enumerator value of RX0EIO field.                                */
  #define DMU_DMUIR_RX0EIO_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX0EIO_NotGenerated (0x0UL)      /*!< No illegal overwrite detected                                        */
  #define DMU_DMUIR_RX0EIO_Generated (0x1UL)         /*!< DMU has internally overwritten the last element word of a SYNC
                                                          message*/

/* BEU @Bit 15 : Bus Error Uncorrected */
  #define DMU_DMUIR_BEU_Pos (15UL)                   /*!< Position of BEU field.                                               */
  #define DMU_DMUIR_BEU_Msk (0x1UL << DMU_DMUIR_BEU_Pos) /*!< Bit mask of BEU field.                                           */
  #define DMU_DMUIR_BEU_Min (0x0UL)                  /*!< Min enumerator value of BEU field.                                   */
  #define DMU_DMUIR_BEU_Max (0x1UL)                  /*!< Max enumerator value of BEU field.                                   */
  #define DMU_DMUIR_BEU_Clear (0x1UL)                /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_BEU_NotGenerated (0x0UL)         /*!< No read slave error detected when reading from Message RAM           */
  #define DMU_DMUIR_BEU_Generated (0x1UL)            /*!< Read slave error detected                                            */

/* RX1ENSA @Bit 16 : RX1 Element Not Start Address */
  #define DMU_DMUIR_RX1ENSA_Pos (16UL)               /*!< Position of RX1ENSA field.                                           */
  #define DMU_DMUIR_RX1ENSA_Msk (0x1UL << DMU_DMUIR_RX1ENSA_Pos) /*!< Bit mask of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Min (0x0UL)              /*!< Min enumerator value of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Max (0x1UL)              /*!< Max enumerator value of RX1ENSA field.                               */
  #define DMU_DMUIR_RX1ENSA_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1ENSA_NotGenerated (0x0UL)     /*!< No illegal read access                                               */
  #define DMU_DMUIR_RX1ENSA_Generated (0x1UL)        /*!< Read from RX1 Element begins without using start address, exception
                                                          recovery started.*/

/* RX1EID @Bit 17 : RX1 Element Illegal Dequeueing */
  #define DMU_DMUIR_RX1EID_Pos (17UL)                /*!< Position of RX1EID field.                                            */
  #define DMU_DMUIR_RX1EID_Msk (0x1UL << DMU_DMUIR_RX1EID_Pos) /*!< Bit mask of RX1EID field.                                  */
  #define DMU_DMUIR_RX1EID_Min (0x0UL)               /*!< Min enumerator value of RX1EID field.                                */
  #define DMU_DMUIR_RX1EID_Max (0x1UL)               /*!< Max enumerator value of RX1EID field.                                */
  #define DMU_DMUIR_RX1EID_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EID_NotGenerated (0x0UL)      /*!< No illegal dequeueing                                                */
  #define DMU_DMUIR_RX1EID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started,*/

/* RX1EIAS @Bit 18 : RX0 Element Illegal Access Sequence */
  #define DMU_DMUIR_RX1EIAS_Pos (18UL)               /*!< Position of RX1EIAS field.                                           */
  #define DMU_DMUIR_RX1EIAS_Msk (0x1UL << DMU_DMUIR_RX1EIAS_Pos) /*!< Bit mask of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Min (0x0UL)              /*!< Min enumerator value of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Max (0x1UL)              /*!< Max enumerator value of RX1EIAS field.                               */
  #define DMU_DMUIR_RX1EIAS_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EIAS_NotGenerated (0x0UL)     /*!< No illegal addressing sequence detected                              */
  #define DMU_DMUIR_RX1EIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* RX1EIW @Bit 19 : RX1 Element Illegal Write */
  #define DMU_DMUIR_RX1EIW_Pos (19UL)                /*!< Position of RX1EIW field.                                            */
  #define DMU_DMUIR_RX1EIW_Msk (0x1UL << DMU_DMUIR_RX1EIW_Pos) /*!< Bit mask of RX1EIW field.                                  */
  #define DMU_DMUIR_RX1EIW_Min (0x0UL)               /*!< Min enumerator value of RX1EIW field.                                */
  #define DMU_DMUIR_RX1EIW_Max (0x1UL)               /*!< Max enumerator value of RX1EIW field.                                */
  #define DMU_DMUIR_RX1EIW_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EIW_NotGenerated (0x0UL)      /*!< No write access detected                                             */
  #define DMU_DMUIR_RX1EIW_Generated (0x1UL)         /*!< Illegal write access to DMU RX1 Element detected, exception recovery
                                                          started.*/

