tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXENSAE @Bit 0 : TX Element Not Start Address Enable */
  #define DMU_DMUIE_TXENSAE_Pos (0UL)                /*!< Position of TXENSAE field.                                           */
  #define DMU_DMUIE_TXENSAE_Msk (0x1UL << DMU_DMUIE_TXENSAE_Pos) /*!< Bit mask of TXENSAE field.                               */
  #define DMU_DMUIE_TXENSAE_Min (0x0UL)              /*!< Min enumerator value of TXENSAE field.                               */
  #define DMU_DMUIE_TXENSAE_Max (0x1UL)              /*!< Max enumerator value of TXENSAE field.                               */
  #define DMU_DMUIE_TXENSAE_Disabled (0x0UL)         /*!< Flag does not activate the interrupt line DMU                        */
  #define DMU_DMUIE_TXENSAE_Enabled (0x1UL)          /*!< the interrupt line DMU will be activated                             */


/* DMU_DMUC: DMU Configuration */
  #define DMU_DMUC_ResetValue (0x00000000UL)         /*!< Reset value of DMUC register.                                        */

/* TTS @Bit 0 : Transfer Timestamp */
  #define DMU_DMUC_TTS_Pos (0UL)                     /*!< Position of TTS field.                                               */
  #define DMU_DMUC_TTS_Msk (0x1UL << DMU_DMUC_TTS_Pos) /*!< Bit mask of TTS field.                                             */
  #define DMU_DMUC_TTS_Min (0x0UL)                   /*!< Min enumerator value of TTS field.                                   */
  #define DMU_DMUC_TTS_Max (0x1UL)                   /*!< Max enumerator value of TTS field.                                   */
  #define DMU_DMUC_TTS_Disabled (0x0UL)              /*!< No timestamp will be transferred via DMU Virtual Buffer              */
  #define DMU_DMUC_TTS_Enabled (0x1UL)               /*!< Timestamp of message will be transferred from TSU via DMU Virtual
                                                          Buffer*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           DPPIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct DPPIC_TASKS_CHG ================================================== */
/**
  * @brief TASKS_CHG [DPPIC_TASKS_CHG] Channel group tasks
  */
typedef struct {
  __OM  uint32_t  EN;                                /*!< (@ 0x00000000) Enable channel group n                                */
  __OM  uint32_t  DIS;                               /*!< (@ 0x00000004) Disable channel group n                               */
} NRF_DPPIC_TASKS_CHG_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define DPPIC_TASKS_CHG_MaxCount (2UL)             /*!< Size of TASKS_CHG[2] array.                                          */
  #define DPPIC_TASKS_CHG_MaxIndex (1UL)             /*!< Max index of TASKS_CHG[2] array.                                     */
  #define DPPIC_TASKS_CHG_MinIndex (0UL)             /*!< Min index of TASKS_CHG[2] array.                                     */

/* DPPIC_TASKS_CHG_EN: Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_ResetValue (0x00000000UL) /*!< Reset value of EN register.                                        */

/* EN @Bit 0 : Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_EN_Pos (0UL)            /*!< Position of EN field.                                                */
  #define DPPIC_TASKS_CHG_EN_EN_Msk (0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos) /*!< Bit mask of EN field.                            */
  #define DPPIC_TASKS_CHG_EN_EN_Min (0x1UL)          /*!< Min enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Trigger (0x1UL)      /*!< Trigger task                                                         */


/* DPPIC_TASKS_CHG_DIS: Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_ResetValue (0x00000000UL) /*!< Reset value of DIS register.                                      */

/* DIS @Bit 0 : Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_DIS_Pos (0UL)          /*!< Position of DIS field.                                               */
  #define DPPIC_TASKS_CHG_DIS_DIS_Msk (0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos) /*!< Bit mask of DIS field.                       */
  #define DPPIC_TASKS_CHG_DIS_DIS_Min (0x1UL)        /*!< Min enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Max (0x1UL)        /*!< Max enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Trigger (0x1UL)    /*!< Trigger task                                                         */



/* =============================================== Struct DPPIC_SUBSCRIBE_CHG ================================================ */
/**
  * @brief SUBSCRIBE_CHG [DPPIC_SUBSCRIBE_CHG] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  EN;                                /*!< (@ 0x00000000) Subscribe configuration for task CHG[n].EN            */
  __IOM uint32_t  DIS;                               /*!< (@ 0x00000004) Subscribe configuration for task CHG[n].DIS           */
} NRF_DPPIC_SUBSCRIBE_CHG_Type;                      /*!< Size = 8 (0x008)                                                     */
  #define DPPIC_SUBSCRIBE_CHG_MaxCount (2UL)         /*!< Size of SUBSCRIBE_CHG[2] array.                                      */
  #define DPPIC_SUBSCRIBE_CHG_MaxIndex (1UL)         /*!< Max index of SUBSCRIBE_CHG[2] array.                                 */
  #define DPPIC_SUBSCRIBE_CHG_MinIndex (0UL)         /*!< Min index of SUBSCRIBE_CHG[2] array.                                 */

