tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH3 @Bit 3 : Enable or disable channel 3 */
  #define DPPIC_CHEN_CH3_Pos (3UL)                   /*!< Position of CH3 field.                                               */
  #define DPPIC_CHEN_CH3_Msk (0x1UL << DPPIC_CHEN_CH3_Pos) /*!< Bit mask of CH3 field.                                         */
  #define DPPIC_CHEN_CH3_Min (0x0UL)                 /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHEN_CH3_Max (0x1UL)                 /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHEN_CH3_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH3_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH4 @Bit 4 : Enable or disable channel 4 */
  #define DPPIC_CHEN_CH4_Pos (4UL)                   /*!< Position of CH4 field.                                               */
  #define DPPIC_CHEN_CH4_Msk (0x1UL << DPPIC_CHEN_CH4_Pos) /*!< Bit mask of CH4 field.                                         */
  #define DPPIC_CHEN_CH4_Min (0x0UL)                 /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHEN_CH4_Max (0x1UL)                 /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHEN_CH4_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH4_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH5 @Bit 5 : Enable or disable channel 5 */
  #define DPPIC_CHEN_CH5_Pos (5UL)                   /*!< Position of CH5 field.                                               */
  #define DPPIC_CHEN_CH5_Msk (0x1UL << DPPIC_CHEN_CH5_Pos) /*!< Bit mask of CH5 field.                                         */
  #define DPPIC_CHEN_CH5_Min (0x0UL)                 /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHEN_CH5_Max (0x1UL)                 /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHEN_CH5_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH5_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH6 @Bit 6 : Enable or disable channel 6 */
  #define DPPIC_CHEN_CH6_Pos (6UL)                   /*!< Position of CH6 field.                                               */
  #define DPPIC_CHEN_CH6_Msk (0x1UL << DPPIC_CHEN_CH6_Pos) /*!< Bit mask of CH6 field.                                         */
  #define DPPIC_CHEN_CH6_Min (0x0UL)                 /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHEN_CH6_Max (0x1UL)                 /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHEN_CH6_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH6_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH7 @Bit 7 : Enable or disable channel 7 */
  #define DPPIC_CHEN_CH7_Pos (7UL)                   /*!< Position of CH7 field.                                               */
  #define DPPIC_CHEN_CH7_Msk (0x1UL << DPPIC_CHEN_CH7_Pos) /*!< Bit mask of CH7 field.                                         */
  #define DPPIC_CHEN_CH7_Min (0x0UL)                 /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHEN_CH7_Max (0x1UL)                 /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHEN_CH7_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH7_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH8 @Bit 8 : Enable or disable channel 8 */
  #define DPPIC_CHEN_CH8_Pos (8UL)                   /*!< Position of CH8 field.                                               */
  #define DPPIC_CHEN_CH8_Msk (0x1UL << DPPIC_CHEN_CH8_Pos) /*!< Bit mask of CH8 field.                                         */
  #define DPPIC_CHEN_CH8_Min (0x0UL)                 /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHEN_CH8_Max (0x1UL)                 /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHEN_CH8_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH8_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH9 @Bit 9 : Enable or disable channel 9 */
  #define DPPIC_CHEN_CH9_Pos (9UL)                   /*!< Position of CH9 field.                                               */
  #define DPPIC_CHEN_CH9_Msk (0x1UL << DPPIC_CHEN_CH9_Pos) /*!< Bit mask of CH9 field.                                         */
  #define DPPIC_CHEN_CH9_Min (0x0UL)                 /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHEN_CH9_Max (0x1UL)                 /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHEN_CH9_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH9_Enabled (0x1UL)             /*!< Enable channel                                                       */

/* CH10 @Bit 10 : Enable or disable channel 10 */
  #define DPPIC_CHEN_CH10_Pos (10UL)                 /*!< Position of CH10 field.                                              */
  #define DPPIC_CHEN_CH10_Msk (0x1UL << DPPIC_CHEN_CH10_Pos) /*!< Bit mask of CH10 field.                                      */
  #define DPPIC_CHEN_CH10_Min (0x0UL)                /*!< Min enumerator value of CH10 field.                                  */
  #define DPPIC_CHEN_CH10_Max (0x1UL)                /*!< Max enumerator value of CH10 field.                                  */
  #define DPPIC_CHEN_CH10_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH10_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH11 @Bit 11 : Enable or disable channel 11 */
  #define DPPIC_CHEN_CH11_Pos (11UL)                 /*!< Position of CH11 field.                                              */
  #define DPPIC_CHEN_CH11_Msk (0x1UL << DPPIC_CHEN_CH11_Pos) /*!< Bit mask of CH11 field.                                      */
  #define DPPIC_CHEN_CH11_Min (0x0UL)                /*!< Min enumerator value of CH11 field.                                  */
  #define DPPIC_CHEN_CH11_Max (0x1UL)                /*!< Max enumerator value of CH11 field.                                  */
  #define DPPIC_CHEN_CH11_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH11_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH12 @Bit 12 : Enable or disable channel 12 */
  #define DPPIC_CHEN_CH12_Pos (12UL)                 /*!< Position of CH12 field.                                              */
  #define DPPIC_CHEN_CH12_Msk (0x1UL << DPPIC_CHEN_CH12_Pos) /*!< Bit mask of CH12 field.                                      */
  #define DPPIC_CHEN_CH12_Min (0x0UL)                /*!< Min enumerator value of CH12 field.                                  */
  #define DPPIC_CHEN_CH12_Max (0x1UL)                /*!< Max enumerator value of CH12 field.                                  */
  #define DPPIC_CHEN_CH12_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH12_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH13 @Bit 13 : Enable or disable channel 13 */
  #define DPPIC_CHEN_CH13_Pos (13UL)                 /*!< Position of CH13 field.                                              */
  #define DPPIC_CHEN_CH13_Msk (0x1UL << DPPIC_CHEN_CH13_Pos) /*!< Bit mask of CH13 field.                                      */
  #define DPPIC_CHEN_CH13_Min (0x0UL)                /*!< Min enumerator value of CH13 field.                                  */
  #define DPPIC_CHEN_CH13_Max (0x1UL)                /*!< Max enumerator value of CH13 field.                                  */
  #define DPPIC_CHEN_CH13_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH13_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH14 @Bit 14 : Enable or disable channel 14 */
  #define DPPIC_CHEN_CH14_Pos (14UL)                 /*!< Position of CH14 field.                                              */
  #define DPPIC_CHEN_CH14_Msk (0x1UL << DPPIC_CHEN_CH14_Pos) /*!< Bit mask of CH14 field.                                      */
  #define DPPIC_CHEN_CH14_Min (0x0UL)                /*!< Min enumerator value of CH14 field.                                  */
  #define DPPIC_CHEN_CH14_Max (0x1UL)                /*!< Max enumerator value of CH14 field.                                  */
  #define DPPIC_CHEN_CH14_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH14_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH15 @Bit 15 : Enable or disable channel 15 */
  #define DPPIC_CHEN_CH15_Pos (15UL)                 /*!< Position of CH15 field.                                              */
  #define DPPIC_CHEN_CH15_Msk (0x1UL << DPPIC_CHEN_CH15_Pos) /*!< Bit mask of CH15 field.                                      */
  #define DPPIC_CHEN_CH15_Min (0x0UL)                /*!< Min enumerator value of CH15 field.                                  */
  #define DPPIC_CHEN_CH15_Max (0x1UL)                /*!< Max enumerator value of CH15 field.                                  */
  #define DPPIC_CHEN_CH15_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH15_Enabled (0x1UL)            /*!< Enable channel                                                       */


/* DPPIC_CHENSET: Channel enable set register */
  #define DPPIC_CHENSET_ResetValue (0x00000000UL)    /*!< Reset value of CHENSET register.                                     */

/* CH0 @Bit 0 : Channel 0 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH0_Pos (0UL)                /*!< Position of CH0 field.                                               */
  #define DPPIC_CHENSET_CH0_Msk (0x1UL << DPPIC_CHENSET_CH0_Pos) /*!< Bit mask of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Min (0x0UL)              /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Max (0x1UL)              /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH0_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH0_Set (0x1UL)              /*!< Write: Enable channel                                                */

