tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH1 @Bit 1 : Channel 1 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH1_Pos (1UL)                /*!< Position of CH1 field.                                               */
  #define DPPIC_CHENSET_CH1_Msk (0x1UL << DPPIC_CHENSET_CH1_Pos) /*!< Bit mask of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Min (0x0UL)              /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Max (0x1UL)              /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH1_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH1_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH2 @Bit 2 : Channel 2 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH2_Pos (2UL)                /*!< Position of CH2 field.                                               */
  #define DPPIC_CHENSET_CH2_Msk (0x1UL << DPPIC_CHENSET_CH2_Pos) /*!< Bit mask of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Min (0x0UL)              /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Max (0x1UL)              /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH2_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH2_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH3 @Bit 3 : Channel 3 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH3_Pos (3UL)                /*!< Position of CH3 field.                                               */
  #define DPPIC_CHENSET_CH3_Msk (0x1UL << DPPIC_CHENSET_CH3_Pos) /*!< Bit mask of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Min (0x0UL)              /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Max (0x1UL)              /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH3_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH3_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH4 @Bit 4 : Channel 4 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH4_Pos (4UL)                /*!< Position of CH4 field.                                               */
  #define DPPIC_CHENSET_CH4_Msk (0x1UL << DPPIC_CHENSET_CH4_Pos) /*!< Bit mask of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Min (0x0UL)              /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Max (0x1UL)              /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH4_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH4_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH5 @Bit 5 : Channel 5 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH5_Pos (5UL)                /*!< Position of CH5 field.                                               */
  #define DPPIC_CHENSET_CH5_Msk (0x1UL << DPPIC_CHENSET_CH5_Pos) /*!< Bit mask of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Min (0x0UL)              /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Max (0x1UL)              /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH5_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH5_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH6 @Bit 6 : Channel 6 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH6_Pos (6UL)                /*!< Position of CH6 field.                                               */
  #define DPPIC_CHENSET_CH6_Msk (0x1UL << DPPIC_CHENSET_CH6_Pos) /*!< Bit mask of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Min (0x0UL)              /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Max (0x1UL)              /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHENSET_CH6_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH6_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH6_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH7 @Bit 7 : Channel 7 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH7_Pos (7UL)                /*!< Position of CH7 field.                                               */
  #define DPPIC_CHENSET_CH7_Msk (0x1UL << DPPIC_CHENSET_CH7_Pos) /*!< Bit mask of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Min (0x0UL)              /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Max (0x1UL)              /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHENSET_CH7_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH7_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH7_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH8 @Bit 8 : Channel 8 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH8_Pos (8UL)                /*!< Position of CH8 field.                                               */
  #define DPPIC_CHENSET_CH8_Msk (0x1UL << DPPIC_CHENSET_CH8_Pos) /*!< Bit mask of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Min (0x0UL)              /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Max (0x1UL)              /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHENSET_CH8_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH8_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH8_Set (0x1UL)              /*!< Write: Enable channel                                                */

