tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH9 @Bit 9 : Channel 9 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH9_Pos (9UL)                /*!< Position of CH9 field.                                               */
  #define DPPIC_CHENSET_CH9_Msk (0x1UL << DPPIC_CHENSET_CH9_Pos) /*!< Bit mask of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Min (0x0UL)              /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Max (0x1UL)              /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHENSET_CH9_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH9_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH9_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH10 @Bit 10 : Channel 10 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH10_Pos (10UL)              /*!< Position of CH10 field.                                              */
  #define DPPIC_CHENSET_CH10_Msk (0x1UL << DPPIC_CHENSET_CH10_Pos) /*!< Bit mask of CH10 field.                                */
  #define DPPIC_CHENSET_CH10_Min (0x0UL)             /*!< Min enumerator value of CH10 field.                                  */
  #define DPPIC_CHENSET_CH10_Max (0x1UL)             /*!< Max enumerator value of CH10 field.                                  */
  #define DPPIC_CHENSET_CH10_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH10_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH10_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH11 @Bit 11 : Channel 11 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH11_Pos (11UL)              /*!< Position of CH11 field.                                              */
  #define DPPIC_CHENSET_CH11_Msk (0x1UL << DPPIC_CHENSET_CH11_Pos) /*!< Bit mask of CH11 field.                                */
  #define DPPIC_CHENSET_CH11_Min (0x0UL)             /*!< Min enumerator value of CH11 field.                                  */
  #define DPPIC_CHENSET_CH11_Max (0x1UL)             /*!< Max enumerator value of CH11 field.                                  */
  #define DPPIC_CHENSET_CH11_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH11_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH11_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH12 @Bit 12 : Channel 12 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH12_Pos (12UL)              /*!< Position of CH12 field.                                              */
  #define DPPIC_CHENSET_CH12_Msk (0x1UL << DPPIC_CHENSET_CH12_Pos) /*!< Bit mask of CH12 field.                                */
  #define DPPIC_CHENSET_CH12_Min (0x0UL)             /*!< Min enumerator value of CH12 field.                                  */
  #define DPPIC_CHENSET_CH12_Max (0x1UL)             /*!< Max enumerator value of CH12 field.                                  */
  #define DPPIC_CHENSET_CH12_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH12_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH12_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH13 @Bit 13 : Channel 13 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH13_Pos (13UL)              /*!< Position of CH13 field.                                              */
  #define DPPIC_CHENSET_CH13_Msk (0x1UL << DPPIC_CHENSET_CH13_Pos) /*!< Bit mask of CH13 field.                                */
  #define DPPIC_CHENSET_CH13_Min (0x0UL)             /*!< Min enumerator value of CH13 field.                                  */
  #define DPPIC_CHENSET_CH13_Max (0x1UL)             /*!< Max enumerator value of CH13 field.                                  */
  #define DPPIC_CHENSET_CH13_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH13_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH13_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH14 @Bit 14 : Channel 14 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH14_Pos (14UL)              /*!< Position of CH14 field.                                              */
  #define DPPIC_CHENSET_CH14_Msk (0x1UL << DPPIC_CHENSET_CH14_Pos) /*!< Bit mask of CH14 field.                                */
  #define DPPIC_CHENSET_CH14_Min (0x0UL)             /*!< Min enumerator value of CH14 field.                                  */
  #define DPPIC_CHENSET_CH14_Max (0x1UL)             /*!< Max enumerator value of CH14 field.                                  */
  #define DPPIC_CHENSET_CH14_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH14_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH14_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH15 @Bit 15 : Channel 15 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH15_Pos (15UL)              /*!< Position of CH15 field.                                              */
  #define DPPIC_CHENSET_CH15_Msk (0x1UL << DPPIC_CHENSET_CH15_Pos) /*!< Bit mask of CH15 field.                                */
  #define DPPIC_CHENSET_CH15_Min (0x0UL)             /*!< Min enumerator value of CH15 field.                                  */
  #define DPPIC_CHENSET_CH15_Max (0x1UL)             /*!< Max enumerator value of CH15 field.                                  */
  #define DPPIC_CHENSET_CH15_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH15_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH15_Set (0x1UL)             /*!< Write: Enable channel                                                */


/* DPPIC_CHENCLR: Channel enable clear register */
  #define DPPIC_CHENCLR_ResetValue (0x00000000UL)    /*!< Reset value of CHENCLR register.                                     */

/* CH0 @Bit 0 : Channel 0 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH0_Pos (0UL)                /*!< Position of CH0 field.                                               */
  #define DPPIC_CHENCLR_CH0_Msk (0x1UL << DPPIC_CHENCLR_CH0_Pos) /*!< Bit mask of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Min (0x0UL)              /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Max (0x1UL)              /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH0_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH0_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH1 @Bit 1 : Channel 1 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH1_Pos (1UL)                /*!< Position of CH1 field.                                               */
  #define DPPIC_CHENCLR_CH1_Msk (0x1UL << DPPIC_CHENCLR_CH1_Pos) /*!< Bit mask of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Min (0x0UL)              /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Max (0x1UL)              /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH1_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH1_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH2 @Bit 2 : Channel 2 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH2_Pos (2UL)                /*!< Position of CH2 field.                                               */
  #define DPPIC_CHENCLR_CH2_Msk (0x1UL << DPPIC_CHENCLR_CH2_Pos) /*!< Bit mask of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Min (0x0UL)              /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Max (0x1UL)              /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH2_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH2_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH3 @Bit 3 : Channel 3 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH3_Pos (3UL)                /*!< Position of CH3 field.                                               */
  #define DPPIC_CHENCLR_CH3_Msk (0x1UL << DPPIC_CHENCLR_CH3_Pos) /*!< Bit mask of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Min (0x0UL)              /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Max (0x1UL)              /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH3_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH3_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH4 @Bit 4 : Channel 4 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH4_Pos (4UL)                /*!< Position of CH4 field.                                               */
  #define DPPIC_CHENCLR_CH4_Msk (0x1UL << DPPIC_CHENCLR_CH4_Pos) /*!< Bit mask of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Min (0x0UL)              /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Max (0x1UL)              /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH4_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH4_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH5 @Bit 5 : Channel 5 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH5_Pos (5UL)                /*!< Position of CH5 field.                                               */
  #define DPPIC_CHENCLR_CH5_Msk (0x1UL << DPPIC_CHENCLR_CH5_Pos) /*!< Bit mask of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Min (0x0UL)              /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Max (0x1UL)              /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH5_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH5_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH6 @Bit 6 : Channel 6 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH6_Pos (6UL)                /*!< Position of CH6 field.                                               */
  #define DPPIC_CHENCLR_CH6_Msk (0x1UL << DPPIC_CHENCLR_CH6_Pos) /*!< Bit mask of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Min (0x0UL)              /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Max (0x1UL)              /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH6_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH6_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH7 @Bit 7 : Channel 7 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH7_Pos (7UL)                /*!< Position of CH7 field.                                               */
  #define DPPIC_CHENCLR_CH7_Msk (0x1UL << DPPIC_CHENCLR_CH7_Pos) /*!< Bit mask of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Min (0x0UL)              /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Max (0x1UL)              /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH7_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH7_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH8 @Bit 8 : Channel 8 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH8_Pos (8UL)                /*!< Position of CH8 field.                                               */
  #define DPPIC_CHENCLR_CH8_Msk (0x1UL << DPPIC_CHENCLR_CH8_Pos) /*!< Bit mask of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Min (0x0UL)              /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Max (0x1UL)              /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH8_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH8_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH9 @Bit 9 : Channel 9 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH9_Pos (9UL)                /*!< Position of CH9 field.                                               */
  #define DPPIC_CHENCLR_CH9_Msk (0x1UL << DPPIC_CHENCLR_CH9_Pos) /*!< Bit mask of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Min (0x0UL)              /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Max (0x1UL)              /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH9_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH9_Clear (0x1UL)            /*!< Write: Disable channel                                               */

