tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define DPPIC_CHG_MaxCount (2UL)                   /*!< Max size of CHG[2] array.                                            */
  #define DPPIC_CHG_MaxIndex (1UL)                   /*!< Max index of CHG[2] array.                                           */
  #define DPPIC_CHG_MinIndex (0UL)                   /*!< Min index of CHG[2] array.                                           */
  #define DPPIC_CHG_ResetValue (0x00000000UL)        /*!< Reset value of CHG[2] register.                                      */

/* CH0 @Bit 0 : Include or exclude channel 0 */
  #define DPPIC_CHG_CH0_Pos (0UL)                    /*!< Position of CH0 field.                                               */
  #define DPPIC_CHG_CH0_Msk (0x1UL << DPPIC_CHG_CH0_Pos) /*!< Bit mask of CH0 field.                                           */
  #define DPPIC_CHG_CH0_Min (0x0UL)                  /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Max (0x1UL)                  /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH0_Included (0x1UL)             /*!< Include                                                              */

/* CH1 @Bit 1 : Include or exclude channel 1 */
  #define DPPIC_CHG_CH1_Pos (1UL)                    /*!< Position of CH1 field.                                               */
  #define DPPIC_CHG_CH1_Msk (0x1UL << DPPIC_CHG_CH1_Pos) /*!< Bit mask of CH1 field.                                           */
  #define DPPIC_CHG_CH1_Min (0x0UL)                  /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Max (0x1UL)                  /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH1_Included (0x1UL)             /*!< Include                                                              */

/* CH2 @Bit 2 : Include or exclude channel 2 */
  #define DPPIC_CHG_CH2_Pos (2UL)                    /*!< Position of CH2 field.                                               */
  #define DPPIC_CHG_CH2_Msk (0x1UL << DPPIC_CHG_CH2_Pos) /*!< Bit mask of CH2 field.                                           */
  #define DPPIC_CHG_CH2_Min (0x0UL)                  /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Max (0x1UL)                  /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH2_Included (0x1UL)             /*!< Include                                                              */

/* CH3 @Bit 3 : Include or exclude channel 3 */
  #define DPPIC_CHG_CH3_Pos (3UL)                    /*!< Position of CH3 field.                                               */
  #define DPPIC_CHG_CH3_Msk (0x1UL << DPPIC_CHG_CH3_Pos) /*!< Bit mask of CH3 field.                                           */
  #define DPPIC_CHG_CH3_Min (0x0UL)                  /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Max (0x1UL)                  /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH3_Included (0x1UL)             /*!< Include                                                              */

/* CH4 @Bit 4 : Include or exclude channel 4 */
  #define DPPIC_CHG_CH4_Pos (4UL)                    /*!< Position of CH4 field.                                               */
  #define DPPIC_CHG_CH4_Msk (0x1UL << DPPIC_CHG_CH4_Pos) /*!< Bit mask of CH4 field.                                           */
  #define DPPIC_CHG_CH4_Min (0x0UL)                  /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHG_CH4_Max (0x1UL)                  /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHG_CH4_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH4_Included (0x1UL)             /*!< Include                                                              */

/* CH5 @Bit 5 : Include or exclude channel 5 */
  #define DPPIC_CHG_CH5_Pos (5UL)                    /*!< Position of CH5 field.                                               */
  #define DPPIC_CHG_CH5_Msk (0x1UL << DPPIC_CHG_CH5_Pos) /*!< Bit mask of CH5 field.                                           */
  #define DPPIC_CHG_CH5_Min (0x0UL)                  /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHG_CH5_Max (0x1UL)                  /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHG_CH5_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH5_Included (0x1UL)             /*!< Include                                                              */

/* CH6 @Bit 6 : Include or exclude channel 6 */
  #define DPPIC_CHG_CH6_Pos (6UL)                    /*!< Position of CH6 field.                                               */
  #define DPPIC_CHG_CH6_Msk (0x1UL << DPPIC_CHG_CH6_Pos) /*!< Bit mask of CH6 field.                                           */
  #define DPPIC_CHG_CH6_Min (0x0UL)                  /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHG_CH6_Max (0x1UL)                  /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHG_CH6_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH6_Included (0x1UL)             /*!< Include                                                              */

