tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ETB_ITATBDATA0: Integration Test ATB Data Register 0 */
  #define ETB_ITATBDATA0_ResetValue (0x00000000UL)   /*!< Reset value of ITATBDATA0 register.                                  */

/* ATDATA_0 @Bit 0 : Read the value of atdatas[0]. */
  #define ETB_ITATBDATA0_ATDATA_0_Pos (0UL)          /*!< Position of ATDATA_0 field.                                          */
  #define ETB_ITATBDATA0_ATDATA_0_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_0_Pos) /*!< Bit mask of ATDATA_0 field.                  */

/* ATDATA_7 @Bit 1 : Read the value of atdatas[7]. */
  #define ETB_ITATBDATA0_ATDATA_7_Pos (1UL)          /*!< Position of ATDATA_7 field.                                          */
  #define ETB_ITATBDATA0_ATDATA_7_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_7_Pos) /*!< Bit mask of ATDATA_7 field.                  */

/* ATDATA_15 @Bit 2 : Read the value of atdatas[15]. */
  #define ETB_ITATBDATA0_ATDATA_15_Pos (2UL)         /*!< Position of ATDATA_15 field.                                         */
  #define ETB_ITATBDATA0_ATDATA_15_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_15_Pos) /*!< Bit mask of ATDATA_15 field.               */

/* ATDATA_23 @Bit 3 : Read the value of atdatas[23]. */
  #define ETB_ITATBDATA0_ATDATA_23_Pos (3UL)         /*!< Position of ATDATA_23 field.                                         */
  #define ETB_ITATBDATA0_ATDATA_23_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_23_Pos) /*!< Bit mask of ATDATA_23 field.               */

/* ATDATA_31 @Bit 4 : Read the value of atdatas[31]. */
  #define ETB_ITATBDATA0_ATDATA_31_Pos (4UL)         /*!< Position of ATDATA_31 field.                                         */
  #define ETB_ITATBDATA0_ATDATA_31_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_31_Pos) /*!< Bit mask of ATDATA_31 field.               */


/* ETB_ITATBCTR2: Integration Test ATB Control Register 2 */
  #define ETB_ITATBCTR2_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR2 register.                                   */

/* ATREADYS @Bit 0 : Set the value of atreadys. */
  #define ETB_ITATBCTR2_ATREADYS_Pos (0UL)           /*!< Position of ATREADYS field.                                          */
  #define ETB_ITATBCTR2_ATREADYS_Msk (0x1UL << ETB_ITATBCTR2_ATREADYS_Pos) /*!< Bit mask of ATREADYS field.                    */

/* AFVALIDS @Bit 1 : Set the value of afvalids. */
  #define ETB_ITATBCTR2_AFVALIDS_Pos (1UL)           /*!< Position of AFVALIDS field.                                          */
  #define ETB_ITATBCTR2_AFVALIDS_Msk (0x1UL << ETB_ITATBCTR2_AFVALIDS_Pos) /*!< Bit mask of AFVALIDS field.                    */


/* ETB_ITATBCTR1: Integration Test ATB Control Register 1 */
  #define ETB_ITATBCTR1_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR1 register.                                   */

/* ATID @Bits 0..6 : Read the value of atids. */
  #define ETB_ITATBCTR1_ATID_Pos (0UL)               /*!< Position of ATID field.                                              */
  #define ETB_ITATBCTR1_ATID_Msk (0x7FUL << ETB_ITATBCTR1_ATID_Pos) /*!< Bit mask of ATID field.                               */


/* ETB_ITATBCTR0: Integration Test ATB Control Register 0 */
  #define ETB_ITATBCTR0_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR0 register.                                   */

/* ATVALID @Bit 0 : Read the value of atvalids. */
  #define ETB_ITATBCTR0_ATVALID_Pos (0UL)            /*!< Position of ATVALID field.                                           */
  #define ETB_ITATBCTR0_ATVALID_Msk (0x1UL << ETB_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field.                       */

/* AFREADY @Bit 1 : Read the value of afreadys. */
  #define ETB_ITATBCTR0_AFREADY_Pos (1UL)            /*!< Position of AFREADY field.                                           */
  #define ETB_ITATBCTR0_AFREADY_Msk (0x1UL << ETB_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field.                       */

/* ATBYTES @Bits 8..9 : Read the value of atbytess. */
  #define ETB_ITATBCTR0_ATBYTES_Pos (8UL)            /*!< Position of ATBYTES field.                                           */
  #define ETB_ITATBCTR0_ATBYTES_Msk (0x3UL << ETB_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field.                       */


/* ETB_ITCTRL: Integration Mode Control Register */
  #define ETB_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATION_MODE @Bit 0 : Allows the component to switch from functional mode to integration mode or back. */
  #define ETB_ITCTRL_INTEGRATION_MODE_Pos (0UL)      /*!< Position of INTEGRATION_MODE field.                                  */
  #define ETB_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << ETB_ITCTRL_INTEGRATION_MODE_Pos) /*!< Bit mask of INTEGRATION_MODE field.  */


/* ETB_CLAIMSET: Claim Tag Set Register */
  #define ETB_CLAIMSET_ResetValue (0x0000000FUL)     /*!< Reset value of CLAIMSET register.                                    */

/* CLAIMSET @Bits 0..3 : This claim tag bit is implemented */
  #define ETB_CLAIMSET_CLAIMSET_Pos (0UL)            /*!< Position of CLAIMSET field.                                          */
  #define ETB_CLAIMSET_CLAIMSET_Msk (0xFUL << ETB_CLAIMSET_CLAIMSET_Pos) /*!< Bit mask of CLAIMSET field.                      */


/* ETB_CLAIMCLR: Claim Tag Clear Register */
  #define ETB_CLAIMCLR_ResetValue (0x00000000UL)     /*!< Reset value of CLAIMCLR register.                                    */

/* CLAIMCLR @Bits 0..3 : The value present reflects the current setting of the Claim Tag. */
  #define ETB_CLAIMCLR_CLAIMCLR_Pos (0UL)            /*!< Position of CLAIMCLR field.                                          */
  #define ETB_CLAIMCLR_CLAIMCLR_Msk (0xFUL << ETB_CLAIMCLR_CLAIMCLR_Pos) /*!< Bit mask of CLAIMCLR field.                      */


/* ETB_LAR: Lock Access Register */
  #define ETB_LAR_ResetValue (0x00000000UL)          /*!< Reset value of LAR register.                                         */

/* ACCESS_W @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than
                          0xC5ACCE55 will have the affect of removing write access. */

  #define ETB_LAR_ACCESS_W_Pos (0UL)                 /*!< Position of ACCESS_W field.                                          */
  #define ETB_LAR_ACCESS_W_Msk (0xFFFFFFFFUL << ETB_LAR_ACCESS_W_Pos) /*!< Bit mask of ACCESS_W field.                         */


/* ETB_LSR: Lock Status Register */
  #define ETB_LSR_ResetValue (0x00000003UL)          /*!< Reset value of LSR register.                                         */

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism exists for this device. This bit reads as 0 when read from an
                      external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */

  #define ETB_LSR_LOCKEXIST_Pos (0UL)                /*!< Position of LOCKEXIST field.                                         */
  #define ETB_LSR_LOCKEXIST_Msk (0x1UL << ETB_LSR_LOCKEXIST_Pos) /*!< Bit mask of LOCKEXIST field.                             */

