tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define ETM_TRCVIIECTLR_INCLUDE1_Pos (1UL)         /*!< Position of INCLUDE1 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE1_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE1_Pos) /*!< Bit mask of INCLUDE1 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE1_Min (0x0UL)       /*!< Min enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE1_Max (0x1UL)       /*!< Max enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE1_Disabled (0x0UL)  /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE1_Enabled (0x1UL)   /*!< The address range that address range comparator pair 1 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE2 @Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE2_Pos (2UL)         /*!< Position of INCLUDE2 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE2_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE2_Pos) /*!< Bit mask of INCLUDE2 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE2_Min (0x0UL)       /*!< Min enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE2_Max (0x1UL)       /*!< Max enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE2_Disabled (0x0UL)  /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE2_Enabled (0x1UL)   /*!< The address range that address range comparator pair 2 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE3 @Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE3_Pos (3UL)         /*!< Position of INCLUDE3 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE3_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE3_Pos) /*!< Bit mask of INCLUDE3 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE3_Min (0x0UL)       /*!< Min enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE3_Max (0x1UL)       /*!< Max enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE3_Disabled (0x0UL)  /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE3_Enabled (0x1UL)   /*!< The address range that address range comparator pair 3 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE4 @Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE4_Pos (4UL)         /*!< Position of INCLUDE4 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE4_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE4_Pos) /*!< Bit mask of INCLUDE4 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE4_Min (0x0UL)       /*!< Min enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE4_Max (0x1UL)       /*!< Max enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE4_Disabled (0x0UL)  /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE4_Enabled (0x1UL)   /*!< The address range that address range comparator pair 4 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE5 @Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE5_Pos (5UL)         /*!< Position of INCLUDE5 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE5_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE5_Pos) /*!< Bit mask of INCLUDE5 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE5_Min (0x0UL)       /*!< Min enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE5_Max (0x1UL)       /*!< Max enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE5_Disabled (0x0UL)  /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE5_Enabled (0x1UL)   /*!< The address range that address range comparator pair 5 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE6 @Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE6_Pos (6UL)         /*!< Position of INCLUDE6 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE6_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE6_Pos) /*!< Bit mask of INCLUDE6 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE6_Min (0x0UL)       /*!< Min enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE6_Max (0x1UL)       /*!< Max enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE6_Disabled (0x0UL)  /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE6_Enabled (0x1UL)   /*!< The address range that address range comparator pair 6 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE7 @Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE7_Pos (7UL)         /*!< Position of INCLUDE7 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE7_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE7_Pos) /*!< Bit mask of INCLUDE7 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE7_Min (0x0UL)       /*!< Min enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE7_Max (0x1UL)       /*!< Max enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE7_Disabled (0x0UL)  /*!< The address range that address range comparator pair 7 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE7_Enabled (0x1UL)   /*!< The address range that address range comparator pair 7 defines, is
                                                          selected for ViewInst include control.*/

