tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* OFFSET @Bits 0..31 : External memory Offset. */
  #define EXMIF_EXTCONF2_OFFSET_OFFSET_Pos (0UL)     /*!< Position of OFFSET field.                                            */
  #define EXMIF_EXTCONF2_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << EXMIF_EXTCONF2_OFFSET_OFFSET_Pos) /*!< Bit mask of OFFSET field.   */
  #define EXMIF_EXTCONF2_OFFSET_OFFSET_Min (0x00000000UL) /*!< Min value of OFFSET field.                                      */
  #define EXMIF_EXTCONF2_OFFSET_OFFSET_Max (0xFFFFFFFFUL) /*!< Max size of OFFSET field.                                       */


/* EXMIF_EXTCONF2_SIZE: Upper address range for external memory device 2. */
  #define EXMIF_EXTCONF2_SIZE_ResetValue (0x0FFFFFFFUL) /*!< Reset value of SIZE register.                                     */

/* SIZE @Bits 0..31 : Upper limit address. */
  #define EXMIF_EXTCONF2_SIZE_SIZE_Pos (0UL)         /*!< Position of SIZE field.                                              */
  #define EXMIF_EXTCONF2_SIZE_SIZE_Msk (0xFFFFFFFFUL << EXMIF_EXTCONF2_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.             */
  #define EXMIF_EXTCONF2_SIZE_SIZE_Min (0x00000000UL) /*!< Min value of SIZE field.                                            */
  #define EXMIF_EXTCONF2_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max size of SIZE field.                                             */


/* EXMIF_EXTCONF2_ENABLE: Enable or disable external memory access. */
  #define EXMIF_EXTCONF2_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                 */

/* ENABLE @Bit 0 : Enable or disable external memory access from AXI interface. */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Msk (0x1UL << EXMIF_EXTCONF2_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Max (0x1UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable external memory.                                          */
  #define EXMIF_EXTCONF2_ENABLE_ENABLE_Enabled (0x1UL) /*!< Enable external memory.                                            */



/* ============================================== Struct EXMIF_CORE_SSICADDRESS ============================================== */
/**
  * @brief SSICADDRESS [EXMIF_CORE_SSICADDRESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLR0;                            /*!< (@ 0x00000000) This register controls the serial data transfer.      */
  __IOM uint32_t  CTRLR1;                            /*!< (@ 0x00000004) This register exists only when the DWC_ssi is
                                                                         configured as a master device.*/
  __IOM uint32_t  SSIENR;                            /*!< (@ 0x00000008) This register enables and disables the DWC_ssi.       */
  __IOM uint32_t  MWCR;                              /*!< (@ 0x0000000C) This register controls the direction of the data word
                                                                         for the half-duplex Microwire serial protocol.*/
  __IOM uint32_t  SER;                               /*!< (@ 0x00000010) This register is valid only when the DWC_ssi is
                                                                         configured as a master device.*/
  __IOM uint32_t  BAUDR;                             /*!< (@ 0x00000014) This register is valid only when the DWC_ssi is
                                                                         configured as a master device.*/
  __IOM uint32_t  TXFTLR;                            /*!< (@ 0x00000018) This register controls the threshold value for the
                                                                         transmit FIFO memory..*/
  __IOM uint32_t  RXFTLR;                            /*!< (@ 0x0000001C) This register controls the threshold value for the
                                                                         receive FIFO memory..*/
  __IOM uint32_t  TXFLR;                             /*!< (@ 0x00000020) This register contains the number of valid data entries
                                                                         in the transmit FIFO memory.*/
  __IOM uint32_t  RXFLR;                             /*!< (@ 0x00000024) This register contains the number of valid data entries
                                                                         in the receive FIFO memory.*/
  __IOM uint32_t  SR;                                /*!< (@ 0x00000028) This is a read-only register used to indicate the
                                                                         current transfer status, FIFO status, and any
                                                                         transmission/reception errors that may have occurred.*/
  __IOM uint32_t  IMR;                               /*!< (@ 0x0000002C) This read/write register masks or enables all
                                                                         interrupts generated by the DWC_ssi.*/
  __IOM uint32_t  ISR;                               /*!< (@ 0x00000030) This register reports the status of the DWC_ssi
                                                                         interrupts after they have been masked.*/
  __IOM uint32_t  RISR;                              /*!< (@ 0x00000034) Raw Interrupt Status Register                         */
  __IOM uint32_t  TXEICR;                            /*!< (@ 0x00000038) Transmit FIFO Error Interrupt Clear Register          */
  __IOM uint32_t  RXOICR;                            /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register        */
  __IOM uint32_t  RXUICR;                            /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register       */
  __IOM uint32_t  MSTICR;                            /*!< (@ 0x00000044) Multi-Master Interrupt Clear Register                 */
  __IOM uint32_t  ICR;                               /*!< (@ 0x00000048) Interrupt Clear Register                              */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  IDR;                               /*!< (@ 0x00000058) This register contains the peripherals identification
                                                                         code, which is written into the register at
                                                                         configuration time using coreConsultant.*/
  __IOM uint32_t  SSICVERSIONID;                     /*!< (@ 0x0000005C) This read-only register stores the specific DWC_ssi
                                                                         component version.*/
  __IOM uint32_t  DR[36];                            /*!< (@ 0x00000060) The DWC_ssi data register is a 32-bit read/write buffer
                                                                         for the transmit/receive FIFOs.*/
  __IOM uint32_t  RXSAMPLEDELAY;                     /*!< (@ 0x000000F0) This register is only valid when the DWC_ssi is
                                                                         configured with rxd sample delay logic
                                                                         (SSIC_HAS_RX_SAMPLE_DELAY==1).*/
  __IOM uint32_t  SPICTRLR0;                         /*!< (@ 0x000000F4) This register is used to control the serial data
                                                                         transfer in enhanced SPI mode of operation.*/
  __IOM uint32_t  DDRDRIVEEDGE;                      /*!< (@ 0x000000F8) This Register is valid only when SSIC_HAS_DDR is equal
                                                                         to 1.*/
  __IOM uint32_t  XIPMODEBITS;                       /*!< (@ 0x000000FC) This register carries the mode bits which are sent in
                                                                         the XIP mode of operation after address phase.*/
} NRF_EXMIF_CORE_SSICADDRESS_Type;                   /*!< Size = 256 (0x100)                                                   */

