tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EXMIF_CORE_SSICADDRESS_MWCR: This register controls the direction of the data word for the half-duplex Microwire serial
                                 protocol. */

  #define EXMIF_CORE_SSICADDRESS_MWCR_ResetValue (0x00000000UL) /*!< Reset value of MWCR register.                             */

/* MWMOD @Bit 0 : Microwire Transfer Mode. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos (0UL) /*!< Position of MWMOD field.                                            */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos) /*!< Bit mask of MWMOD field. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Min (0x0UL) /*!< Min enumerator value of MWMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Max (0x1UL) /*!< Max enumerator value of MWMOD field.                              */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_NON_SEQUENTIAL (0x0UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_SEQUENTIAL (0x1UL) /*!< (unspecified)                                              */

/* MDD @Bit 1 : Microwire Control. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos (1UL)  /*!< Position of MDD field.                                               */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos) /*!< Bit mask of MDD field.       */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Min (0x0UL) /*!< Min enumerator value of MDD field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Max (0x1UL) /*!< Max enumerator value of MDD field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_RECEIVE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_TRANSMIT (0x1UL) /*!< (unspecified)                                                  */

/* MHS @Bit 2 : Microwire Handshaking. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos (2UL)  /*!< Position of MHS field.                                               */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos) /*!< Bit mask of MHS field.       */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Min (0x0UL) /*!< Min enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Max (0x1UL) /*!< Max enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_DISABLE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_ENABLED (0x1UL) /*!< (unspecified)                                                   */

/* RSVDMWCR @Bits 3..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_MWCR_RSVDMWCR_Pos (3UL) /*!< Position of RSVDMWCR field.                                      */
  #define EXMIF_CORE_SSICADDRESS_MWCR_RSVDMWCR_Msk (0x1FFFFFFFUL << EXMIF_CORE_SSICADDRESS_MWCR_RSVDMWCR_Pos) /*!< Bit mask of
                                                                            RSVDMWCR field.*/


/* EXMIF_CORE_SSICADDRESS_SER: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_SER_ResetValue (0x00000000UL) /*!< Reset value of SER register.                               */

/* SER @Bits 0..1 : Slave Select Enable Flag. */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Pos (0UL)   /*!< Position of SER field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SER_SER_Pos) /*!< Bit mask of SER field.         */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Min (0x0UL) /*!< Min enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Max (0x1UL) /*!< Max enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_NOTSELECTED (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_SELECTED (0x1UL) /*!< (unspecified)                                                   */

/* RSVDSER @Bits 2..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SER_RSVDSER_Pos (2UL) /*!< Position of RSVDSER field.                                         */
  #define EXMIF_CORE_SSICADDRESS_SER_RSVDSER_Msk (0x3FFFFFFFUL << EXMIF_CORE_SSICADDRESS_SER_RSVDSER_Pos) /*!< Bit mask of
                                                                            RSVDSER field.*/


/* EXMIF_CORE_SSICADDRESS_BAUDR: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_ResetValue (0x00000000UL) /*!< Reset value of BAUDR register.                           */

/* RSVDBAUDR0 @Bit 0 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR0_Pos (0UL) /*!< Position of RSVDBAUDR0 field.                                 */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR0_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR0_Pos) /*!< Bit mask of
                                                                            RSVDBAUDR0 field.*/

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos (1UL) /*!< Position of SCKDV field.                                           */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Msk (0x7FFFUL << EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV
                                                                            field.*/

/* RSVDBAUDR1631 @Bits 16..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR1631_Pos (16UL) /*!< Position of RSVDBAUDR1631 field.                          */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR1631_Msk (0xFFFFUL << EXMIF_CORE_SSICADDRESS_BAUDR_RSVDBAUDR1631_Pos) /*!< Bit
                                                                            mask of RSVDBAUDR1631 field.*/


/* EXMIF_CORE_SSICADDRESS_TXFTLR: This register controls the threshold value for the transmit FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_ResetValue (0x00000000UL) /*!< Reset value of TXFTLR register.                         */

/* TFT @Bits 0..4 : Transmit FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos (0UL) /*!< Position of TFT field.                                              */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos) /*!< Bit mask of TFT field.  */

/* RSVDTXFTLR @Bits 5..15 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_RSVDTXFTLR_Pos (5UL) /*!< Position of RSVDTXFTLR field.                                */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_RSVDTXFTLR_Msk (0x7FFUL << EXMIF_CORE_SSICADDRESS_TXFTLR_RSVDTXFTLR_Pos) /*!< Bit mask
                                                                            of RSVDTXFTLR field.*/

/* TXFTHR @Bits 16..20 : Transfer start FIFO level. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                       */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR
                                                                            field.*/

