tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EXMIF_CORE_SSICADDRESS_RISR: Raw Interrupt Status Register */
  #define EXMIF_CORE_SSICADDRESS_RISR_ResetValue (0x00000000UL) /*!< Reset value of RISR register.                             */

/* TXEIR @Bit 0 : Transmit FIFO Empty Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos (0UL) /*!< Position of TXEIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos) /*!< Bit mask of TXEIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Min (0x0UL) /*!< Min enumerator value of TXEIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Max (0x1UL) /*!< Max enumerator value of TXEIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* TXOIR @Bit 1 : Transmit FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos (1UL) /*!< Position of TXOIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos) /*!< Bit mask of TXOIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Min (0x0UL) /*!< Min enumerator value of TXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Max (0x1UL) /*!< Max enumerator value of TXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXUIR @Bit 2 : Receive FIFO Underflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos (2UL) /*!< Position of RXUIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos) /*!< Bit mask of RXUIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Min (0x0UL) /*!< Min enumerator value of RXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Max (0x1UL) /*!< Max enumerator value of RXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXOIR @Bit 3 : Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos (3UL) /*!< Position of RXOIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos) /*!< Bit mask of RXOIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Min (0x0UL) /*!< Min enumerator value of RXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Max (0x1UL) /*!< Max enumerator value of RXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXFIR @Bit 4 : Receive FIFO Full Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos (4UL) /*!< Position of RXFIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos) /*!< Bit mask of RXFIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Min (0x0UL) /*!< Min enumerator value of RXFIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Max (0x1UL) /*!< Max enumerator value of RXFIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* MSTIR @Bit 5 : Multi-Master Contention Raw Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos (5UL) /*!< Position of MSTIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos) /*!< Bit mask of MSTIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Min (0x0UL) /*!< Min enumerator value of MSTIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Max (0x1UL) /*!< Max enumerator value of MSTIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* XRXOIR @Bit 6 : XIP Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos (6UL) /*!< Position of XRXOIR field.                                          */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos) /*!< Bit mask of XRXOIR
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Min (0x0UL) /*!< Min enumerator value of XRXOIR field.                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Max (0x1UL) /*!< Max enumerator value of XRXOIR field.                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                               */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                 */

/* TXUIR @Bit 7 : Transmit FIFO Underflow Interrupt Raw Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos (7UL) /*!< Position of TXUIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos) /*!< Bit mask of TXUIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Min (0x0UL) /*!< Min enumerator value of TXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Max (0x1UL) /*!< Max enumerator value of TXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

