tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RSVDMSTICR @Bits 1..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_RSVDMSTICR_Pos (1UL) /*!< Position of RSVDMSTICR field.                                */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_RSVDMSTICR_Msk (0x7FFFFFFFUL << EXMIF_CORE_SSICADDRESS_MSTICR_RSVDMSTICR_Pos) /*!< Bit
                                                                            mask of RSVDMSTICR field.*/


/* EXMIF_CORE_SSICADDRESS_ICR: Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_ICR_ResetValue (0x00000000UL) /*!< Reset value of ICR register.                               */

/* ICR @Bit 0 : Clear Interrupts. */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos (0UL)   /*!< Position of ICR field.                                               */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos) /*!< Bit mask of ICR field.         */

/* RSVDICR @Bits 1..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_ICR_RSVDICR_Pos (1UL) /*!< Position of RSVDICR field.                                         */
  #define EXMIF_CORE_SSICADDRESS_ICR_RSVDICR_Msk (0x7FFFFFFFUL << EXMIF_CORE_SSICADDRESS_ICR_RSVDICR_Pos) /*!< Bit mask of
                                                                            RSVDICR field.*/


/* EXMIF_CORE_SSICADDRESS_IDR: This register contains the peripherals identification code, which is written into the register at
                                configuration time using coreConsultant. */

  #define EXMIF_CORE_SSICADDRESS_IDR_ResetValue (0x00010003UL) /*!< Reset value of IDR register.                               */

/* IDCODE @Bits 0..31 : Identification code. */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos (0UL) /*!< Position of IDCODE field.                                           */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos) /*!< Bit mask of IDCODE
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SSICVERSIONID: This read-only register stores the specific DWC_ssi component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_ResetValue (0x3130332AUL) /*!< Reset value of SSICVERSIONID register.           */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.               */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/


/* EXMIF_CORE_SSICADDRESS_DR: The DWC_ssi data register is a 32-bit read/write buffer for the transmit/receive FIFOs. */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxCount (36UL)  /*!< Max size of DR[36] array.                                            */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxIndex (35UL)  /*!< Max index of DR[36] array.                                           */
  #define EXMIF_CORE_SSICADDRESS_DR_MinIndex (0UL)   /*!< Min index of DR[36] array.                                           */
  #define EXMIF_CORE_SSICADDRESS_DR_ResetValue (0x00000000UL) /*!< Reset value of DR[36] register.                             */

/* DR @Bits 0..31 : Data Register. */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Pos (0UL)     /*!< Position of DR field.                                                */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_DR_DR_Pos) /*!< Bit mask of DR field.       */


/* EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY: This register is only valid when the DWC_ssi is configured with rxd sample delay logic
                                          (SSIC_HAS_RX_SAMPLE_DELAY==1). */

  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.           */

/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos (0UL) /*!< Position of RSD field.                                       */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos) /*!< Bit mask of
                                                                            RSD field.*/

/* RSVD0RXSAMPLEDLY @Bits 8..15 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Pos (8UL) /*!< Position of RSVD0RXSAMPLEDLY field.             */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD0RXSAMPLEDLY_Pos)
                                                                            /*!< Bit mask of RSVD0RXSAMPLEDLY field.*/

/* SE @Bit 16 : Receive Data (rxd) Sampling Edge. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos (16UL) /*!< Position of SE field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos) /*!< Bit mask of SE
                                                                            field.*/

/* RSVD1RXSAMPLEDLY @Bits 17..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Pos (17UL) /*!< Position of RSVD1RXSAMPLEDLY field.            */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Msk (0x7FFFUL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSVD1RXSAMPLEDLY_Pos)
                                                                            /*!< Bit mask of RSVD1RXSAMPLEDLY field.*/


/* EXMIF_CORE_SSICADDRESS_SPICTRLR0: This register is used to control the serial data transfer in enhanced SPI mode of
                                      operation. */

  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ResetValue (0x00000A00UL) /*!< Reset value of SPICTRLR0 register.                   */

