tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRANSTYPE @Bits 0..1 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos (0UL) /*!< Position of TRANSTYPE field.                               */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos) /*!< Bit mask
                                                                            of TRANSTYPE field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.                 */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.                 */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT1 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT2 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT3 (0x3UL) /*!< (unspecified)                                            */

/* ADDRL @Bits 2..5 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos (2UL) /*!< Position of ADDRL field.                                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Msk (0xFUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L4 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L8 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L36 (0x9UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L40 (0xAUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L44 (0xBUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L48 (0xCUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L52 (0xDUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L56 (0xEUL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L60 (0xFUL) /*!< (unspecified)                                           */

/* RSVDSPICTRLR06 @Bit 6 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR06_Pos (6UL) /*!< Position of RSVDSPICTRLR06 field.                     */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR06_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR06_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR06 field.*/

/* XIPMDBITEN @Bit 7 : Mode bits enable in XIP mode. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos (7UL) /*!< Position of XIPMDBITEN field.                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos) /*!< Bit
                                                                            mask of XIPMDBITEN field.*/

/* INSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos (8UL) /*!< Position of INSTL field.                                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L4 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L8 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L16 (0x3UL) /*!< (unspecified)                                           */

/* RSVDSPICTRLR010 @Bit 10 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR010_Pos (10UL) /*!< Position of RSVDSPICTRLR010 field.                  */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR010_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR010_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR010 field.*/

/* WAITCYCLES @Bits 11..15 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos (11UL) /*!< Position of WAITCYCLES field.                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos) /*!< Bit
                                                                            mask of WAITCYCLES field.*/

/* SPIDDREN @Bit 16 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos (16UL) /*!< Position of SPIDDREN field.                                */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos) /*!< Bit mask
                                                                            of SPIDDREN field.*/

/* INSTDDREN @Bit 17 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos (17UL) /*!< Position of INSTDDREN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos) /*!< Bit mask
                                                                            of INSTDDREN field.*/

/* SPIRXDSEN @Bit 18 : Read data strobe enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos (18UL) /*!< Position of SPIRXDSEN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos) /*!< Bit mask
                                                                            of SPIRXDSEN field.*/

/* XIPDFSHC @Bit 19 : Fix DFS for XIP transfers. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos (19UL) /*!< Position of XIPDFSHC field.                                */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos) /*!< Bit mask
                                                                            of XIPDFSHC field.*/

