tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* XIPINSTEN @Bit 20 : XIP instruction enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Pos (20UL) /*!< Position of XIPINSTEN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Pos) /*!< Bit mask
                                                                            of XIPINSTEN field.*/

/* SSICXIPCONTXFEREN @Bit 21 : Enable continuous transfer in XIP mode. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Pos (21UL) /*!< Position of SSICXIPCONTXFEREN field.              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Pos)
                                                                            /*!< Bit mask of SSICXIPCONTXFEREN field.*/

/* RSVDSPICTRLR02223 @Bits 22..23 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR02223_Pos (22UL) /*!< Position of RSVDSPICTRLR02223 field.              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR02223_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR02223_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR02223 field.*/

/* SPIDMEN @Bit 24 : SPI data mask enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Pos (24UL) /*!< Position of SPIDMEN field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Pos) /*!< Bit mask of
                                                                            SPIDMEN field.*/

/* SPIRXDSSIGEN @Bit 25 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Pos (25UL) /*!< Position of SPIRXDSSIGEN field.                        */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Pos) /*!<
                                                                            Bit mask of SPIRXDSSIGEN field.*/

/* XIPMBL @Bits 26..27 : XIP Mode bits length. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Pos (26UL) /*!< Position of XIPMBL field.                                    */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Pos) /*!< Bit mask of
                                                                            XIPMBL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Min (0x0UL) /*!< Min enumerator value of XIPMBL field.                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Max (0x3UL) /*!< Max enumerator value of XIPMBL field.                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_2 (0x0UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_4 (0x1UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_8 (0x2UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_16 (0x3UL) /*!< (unspecified)                                            */

/* RSVDSPICTRLR028 @Bit 28 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR028_Pos (28UL) /*!< Position of RSVDSPICTRLR028 field.                  */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR028_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR028_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR028 field.*/

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Pos (29UL) /*!< Position of XIPPREFETCHEN field.                      */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Pos) /*!<
                                                                            Bit mask of XIPPREFETCHEN field.*/

/* CLKSTRETCHEN @Bit 30 : Enables clock stretching capability in SPI transfers. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Pos (30UL) /*!< Position of CLKSTRETCHEN field.                        */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Pos) /*!<
                                                                            Bit mask of CLKSTRETCHEN field.*/

/* RSVDSPICTRLR0 @Bit 31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR0_Pos (31UL) /*!< Position of RSVDSPICTRLR0 field.                      */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR0_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_RSVDSPICTRLR0_Pos) /*!<
                                                                            Bit mask of RSVDSPICTRLR0 field.*/


/* EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE: This Register is valid only when SSIC_HAS_DDR is equal to 1. */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_ResetValue (0x00000000UL) /*!< Reset value of DDRDRIVEEDGE register.             */

/* TDE @Bits 0..7 : TXD Drive edge register which decided the driving edge of transmit data. */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Pos (0UL) /*!< Position of TDE field.                                        */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Pos) /*!< Bit mask of
                                                                            TDE field.*/

/* RSVDDDRDRIVEEDGE @Bits 8..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_RSVDDDRDRIVEEDGE_Pos (8UL) /*!< Position of RSVDDDRDRIVEEDGE field.              */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_RSVDDDRDRIVEEDGE_Msk (0xFFFFFFUL << EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_RSVDDDRDRIVEEDGE_Pos)
                                                                            /*!< Bit mask of RSVDDDRDRIVEEDGE field.*/


/* EXMIF_CORE_SSICADDRESS_XIPMODEBITS: This register carries the mode bits which are sent in the XIP mode of operation after
                                        address phase. */

  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_ResetValue (0x00000000UL) /*!< Reset value of XIPMODEBITS register.               */

/* XIPMDBITS @Bits 0..15 : XIP mode bits to be sent after address phase of XIP transfer. */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Pos (0UL) /*!< Position of XIPMDBITS field.                             */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Msk (0xFFFFUL << EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Pos) /*!<
                                                                            Bit mask of XIPMDBITS field.*/

/* RSVDXIPMDBITS @Bits 16..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_RSVDXIPMDBITS_Pos (16UL) /*!< Position of RSVDXIPMDBITS field.                    */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_RSVDXIPMDBITS_Msk (0xFFFFUL << EXMIF_CORE_SSICADDRESS_XIPMODEBITS_RSVDXIPMDBITS_Pos)
                                                                            /*!< Bit mask of RSVDXIPMDBITS field.*/



/* ============================================ Struct EXMIF_CORE_SSICXIPADDRESS ============================================= */
/**
  * @brief SSICXIPADDRESS [EXMIF_CORE_SSICXIPADDRESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  XIPINCRINST;                       /*!< (@ 0x00000000) This Register is valid only when SSIC_XIP_EN is equal
                                                                         to 1.*/
  __IOM uint32_t  XIPWRAPINST;                       /*!< (@ 0x00000004) This Register is valid only when SSIC_XIP_EN is equal
                                                                         to 1.*/
  __IOM uint32_t  XIPCTRL;                           /*!< (@ 0x00000008) This Register is valid only when SSIC_CONCURRENT_XIP_EN
                                                                         is equal to 1.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  XRXOICR;                           /*!< (@ 0x00000010) XIP Receive FIFO Overflow Interrupt Clear Register    */
  __IM  uint32_t  RESERVED1[11];
  __IOM uint32_t  XIPWRITEINCRINST;                  /*!< (@ 0x00000040) This Register is valid only when both
                                                                         SSIC_XIP_WRITE_REG_EN is set to 1.*/
  __IOM uint32_t  XIPWRITEWRAPINST;                  /*!< (@ 0x00000044) This Register is valid only when both
                                                                         SSIC_XIP_WRITE_REG_EN is set to 1.*/
  __IOM uint32_t  XIPWRITECTRL;                      /*!< (@ 0x00000048) This Register is valid only when SSIC_XIP_WRITE_REG_EN
                                                                         is equal to 1.*/
} NRF_EXMIF_CORE_SSICXIPADDRESS_Type;                /*!< Size = 76 (0x04C)                                                    */

/* EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST: This Register is valid only when SSIC_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_ResetValue (0x00000000UL) /*!< Reset value of XIPINCRINST register.            */

/* INCRINST @Bits 0..15 : XIP INCR transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Pos (0UL) /*!< Position of INCRINST field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Pos)
                                                                            /*!< Bit mask of INCRINST field.*/

