tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RSVDINCRINST @Bits 16..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_RSVDINCRINST_Pos (16UL) /*!< Position of RSVDINCRINST field.                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_RSVDINCRINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_RSVDINCRINST_Pos)
                                                                            /*!< Bit mask of RSVDINCRINST field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST: This Register is valid only when SSIC_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_ResetValue (0x00000000UL) /*!< Reset value of XIPWRAPINST register.            */

/* WRAPINST @Bits 0..15 : XIP WRAP transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Pos (0UL) /*!< Position of WRAPINST field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Pos)
                                                                            /*!< Bit mask of WRAPINST field.*/

/* RSVDWRAPINST @Bits 16..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_RSVDWRAPINST_Pos (16UL) /*!< Position of RSVDWRAPINST field.                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_RSVDWRAPINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_RSVDWRAPINST_Pos)
                                                                            /*!< Bit mask of RSVDWRAPINST field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPCTRL: This Register is valid only when SSIC_CONCURRENT_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ResetValue (0x08000401UL) /*!< Reset value of XIPCTRL register.                    */

/* FRF @Bits 0..1 : SPI Frame Format */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Pos (0UL) /*!< Position of FRF field.                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Pos) /*!< Bit mask of FRF
                                                                            field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Min (0x0UL) /*!< Min enumerator value of FRF field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Max (0x3UL) /*!< Max enumerator value of FRF field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_RSVD (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_DUAL (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_QUAD (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_OCTAL (0x3UL) /*!< (unspecified)                                           */

/* TRANSTYPE @Bits 2..3 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Pos (2UL) /*!< Position of TRANSTYPE field.                              */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Pos) /*!< Bit
                                                                            mask of TRANSTYPE field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT1 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT2 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT3 (0x3UL) /*!< (unspecified)                                           */

/* ADDRL @Bits 4..7 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Pos (4UL) /*!< Position of ADDRL field.                                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Msk (0xFUL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L4 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L8 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L36 (0x9UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L40 (0xAUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L44 (0xBUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L48 (0xCUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L52 (0xDUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L56 (0xEUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L60 (0xFUL) /*!< (unspecified)                                          */

/* RSVDXIPCTRL8 @Bit 8 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL8_Pos (8UL) /*!< Position of RSVDXIPCTRL8 field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL8_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL8_Pos) /*!<
                                                                            Bit mask of RSVDXIPCTRL8 field.*/

/* INSTL @Bits 9..10 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Pos (9UL) /*!< Position of INSTL field.                                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L4 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L8 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L16 (0x3UL) /*!< (unspecified)                                          */

/* RSVDSPICTRLR011 @Bit 11 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDSPICTRLR011_Pos (11UL) /*!< Position of RSVDSPICTRLR011 field.                 */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDSPICTRLR011_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDSPICTRLR011_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR011 field.*/

