tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MDBITSEN @Bit 12 : Mode bits enable in XIP mode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Pos (12UL) /*!< Position of MDBITSEN field.                               */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Pos) /*!< Bit mask
                                                                            of MDBITSEN field.*/

/* WAITCYCLES @Bits 13..17 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Pos (13UL) /*!< Position of WAITCYCLES field.                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Pos) /*!< Bit
                                                                            mask of WAITCYCLES field.*/

/* DFSHC @Bit 18 : Fix DFS for XIP transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Pos (18UL) /*!< Position of DFSHC field.                                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Pos) /*!< Bit mask of
                                                                            DFSHC field.*/

/* DDREN @Bit 19 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Pos (19UL) /*!< Position of DDREN field.                                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Pos) /*!< Bit mask of
                                                                            DDREN field.*/

/* INSTDDREN @Bit 20 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Pos (20UL) /*!< Position of INSTDDREN field.                             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Pos) /*!< Bit
                                                                            mask of INSTDDREN field.*/

/* RXDSEN @Bit 21 : Read data strobe enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Pos (21UL) /*!< Position of RXDSEN field.                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Pos) /*!< Bit mask of
                                                                            RXDSEN field.*/

/* INSTEN @Bit 22 : XIP instruction enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Pos (22UL) /*!< Position of INSTEN field.                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Pos) /*!< Bit mask of
                                                                            INSTEN field.*/

/* CONTXFEREN @Bit 23 : Enable continuous transfer in XIP mode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Pos (23UL) /*!< Position of CONTXFEREN field.                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Pos) /*!< Bit
                                                                            mask of CONTXFEREN field.*/

/* XIPHYPERBUSEN @Bit 24 : SPI Hyperbus Frame format enable for XIP transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Pos (24UL) /*!< Position of XIPHYPERBUSEN field.                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Pos)
                                                                            /*!< Bit mask of XIPHYPERBUSEN field.*/

/* RXDSSIGEN @Bit 25 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Pos (25UL) /*!< Position of RXDSSIGEN field.                             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Pos) /*!< Bit
                                                                            mask of RXDSSIGEN field.*/

/* XIPMBL @Bits 26..27 : XIP Mode bits length. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Pos (26UL) /*!< Position of XIPMBL field.                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Pos) /*!< Bit mask of
                                                                            XIPMBL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Min (0x0UL) /*!< Min enumerator value of XIPMBL field.                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Max (0x3UL) /*!< Max enumerator value of XIPMBL field.                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_2 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_4 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_8 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_16 (0x3UL) /*!< (unspecified)                                           */

/* RSVDXIPCTRL28 @Bit 28 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL28_Pos (28UL) /*!< Position of RSVDXIPCTRL28 field.                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL28_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL28_Pos)
                                                                            /*!< Bit mask of RSVDXIPCTRL28 field.*/

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in DWC_ssi. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Pos (29UL) /*!< Position of XIPPREFETCHEN field.                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Pos)
                                                                            /*!< Bit mask of XIPPREFETCHEN field.*/

/* RSVDXIPCTRL @Bits 30..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL_Pos (30UL) /*!< Position of RSVDXIPCTRL field.                         */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RSVDXIPCTRL_Pos) /*!<
                                                                            Bit mask of RSVDXIPCTRL field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XRXOICR: XIP Receive FIFO Overflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_ResetValue (0x00000000UL) /*!< Reset value of XRXOICR register.                    */

/* XRXOICR @Bit 0 : Clear XIP Receive FIFO Overflow Interrupt. */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Pos (0UL) /*!< Position of XRXOICR field.                                  */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Pos) /*!< Bit mask
                                                                            of XRXOICR field.*/

/* RSVDXRXOICR @Bits 1..31 : Reserved bits - read as zero */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_RSVDXRXOICR_Pos (1UL) /*!< Position of RSVDXRXOICR field.                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_RSVDXRXOICR_Msk (0x7FFFFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XRXOICR_RSVDXRXOICR_Pos)
                                                                            /*!< Bit mask of RSVDXRXOICR field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST: This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_ResetValue (0x00000000UL) /*!< Reset value of XIPWRITEINCRINST register.  */

/* INCRWRITEINST @Bits 0..15 : XIP Write INCR transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Pos (0UL) /*!< Position of INCRWRITEINST field.             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Pos)
                                                                            /*!< Bit mask of INCRWRITEINST field.*/

/* RSVDINCRINST16TO31 @Bits 16..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Pos (16UL) /*!< Position of RSVDINCRINST16TO31 field.  */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Pos)
                                                                            /*!< Bit mask of RSVDINCRINST16TO31 field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST: This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_ResetValue (0x00000000UL) /*!< Reset value of XIPWRITEWRAPINST register.  */

/* WRAPWRITEINST @Bits 0..15 : XIP Write WRAP transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Pos (0UL) /*!< Position of WRAPWRITEINST field.             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Pos)
                                                                            /*!< Bit mask of WRAPWRITEINST field.*/

