tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* FICR_TRIM_GLOBAL_SAADC_CALOFFSET: Trim value for GLOBAL.SAADC.CALOFFSET */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALOFFSET register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF: Trim value for GLOBAL.SAADC.LINCALCOEFF */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxCount (6UL) /*!< Max size of LINCALCOEFF[6] array.                             */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxIndex (5UL) /*!< Max index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MinIndex (0UL) /*!< Min index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LINCALCOEFF[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALIREF: Trim value for GLOBAL.SAADC.CALIREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIREF register.                       */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALVREFTC: Trim value for GLOBAL.SAADC.CALVREFTC */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALVREFTC register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/



/* ============================================== Struct FICR_TRIM_GLOBAL_NFCT =============================================== */
/**
  * @brief NFCT [FICR_TRIM_GLOBAL_NFCT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BIASCFG;                           /*!< (@ 0x00000000) Trim value for NFCT.BIASCFG                           */
} NRF_FICR_TRIM_GLOBAL_NFCT_Type;                    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_NFCT_BIASCFG: Trim value for NFCT.BIASCFG */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASCFG register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* =========================================== Struct FICR_TRIM_GLOBAL_CANPLL_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for GLOBAL.CANPLL.CTUNE                    */
} NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type;             /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE: Trim value for GLOBAL.CANPLL.CTUNE */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_GLOBAL_CANPLL ============================================== */
/**
  * @brief CANPLL [FICR_TRIM_GLOBAL_CANPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_CANPLL_Type;                  /*!< Size = 4 (0x004)                                                     */


/* ============================================== Struct FICR_TRIM_GLOBAL_COMP =============================================== */
/**
  * @brief COMP [FICR_TRIM_GLOBAL_COMP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  REFTRIM;                           /*!< (@ 0x00000000) Trim value for GLOBAL.COMP.REFTRIM                    */
  __IM  uint32_t  RCALTRIM;                          /*!< (@ 0x00000004) Trim value used during production test                */
} NRF_FICR_TRIM_GLOBAL_COMP_Type;                    /*!< Size = 8 (0x008)                                                     */

/* FICR_TRIM_GLOBAL_COMP_REFTRIM: Trim value for GLOBAL.COMP.REFTRIM */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REFTRIM register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


