tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* FICR_TRIM_GLOBAL_COMP_RCALTRIM: Trim value used during production test */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RCALTRIM register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_COMP_RCALTRIM_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ================================================= Struct FICR_TRIM_GLOBAL ================================================= */
/**
  * @brief GLOBAL [FICR_TRIM_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_SAADC_Type SAADC;       /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED;
  __IOM NRF_FICR_TRIM_GLOBAL_NFCT_Type NFCT;         /*!< (@ 0x00000038) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_Type CANPLL;     /*!< (@ 0x0000003C) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[3];
  __IOM NRF_FICR_TRIM_GLOBAL_COMP_Type COMP;         /*!< (@ 0x0000004C) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_Type;                         /*!< Size = 84 (0x054)                                                    */


/* ========================================= Struct FICR_TRIM_APPLICATION_HSFLL_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_APPLICATION_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;                              /*!< (@ 0x00000000) Trim value for APPLICATION.HSFLL.VSUP                 */
  __IM  uint32_t  COARSE[6];                         /*!< (@ 0x00000004) Trim value for APPLICATION.HSFLL.COARSE               */
  __IM  uint32_t  FINE[6];                           /*!< (@ 0x0000001C) Trim value for APPLICATION.HSFLL.FINE                 */
} NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type;         /*!< Size = 52 (0x034)                                                    */

/* FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP: Trim value for APPLICATION.HSFLL.VSUP */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VSUP register.                   */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE: Trim value for APPLICATION.HSFLL.COARSE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxCount (6UL) /*!< Max size of COARSE[6] array.                             */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxIndex (5UL) /*!< Max index of COARSE[6] array.                            */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MinIndex (0UL) /*!< Min index of COARSE[6] array.                            */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of COARSE[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE: Trim value for APPLICATION.HSFLL.FINE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxCount (6UL) /*!< Max size of FINE[6] array.                                 */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxIndex (5UL) /*!< Max index of FINE[6] array.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MinIndex (0UL) /*!< Min index of FINE[6] array.                                */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FINE[6] register.                */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                  */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_APPLICATION_HSFLL ============================================ */
/**
  * @brief HSFLL [FICR_TRIM_APPLICATION_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type TRIM; /*!< (@ 0x00000000) (unspecified)                                      */
} NRF_FICR_TRIM_APPLICATION_HSFLL_Type;              /*!< Size = 52 (0x034)                                                    */


/* ===================================== Struct FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for APPLICATION.MEMCONF.TRIM               */
} NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type;  /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxCount (3UL) /*!< Size of BLOCKTYPE[3] array.                              */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxIndex (2UL) /*!< Max index of BLOCKTYPE[3] array.                         */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[3] array.                         */

