tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* =========================================== Struct FICR_TRIM_RADIOCORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_RADIOCORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[3]; /*!< (@ 0x00000000) (unspecified)                         */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type;              /*!< Size = 12 (0x00C)                                                    */


/* ======================================= Struct FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA ======================================== */
/**
  * @brief SPHYNXANA [FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA] (unspecified)
  */
typedef struct {
  __IM  uint32_t  FSCTRL0;                           /*!< (@ 0x00000000) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0      */
  __IM  uint32_t  FSCTRL1;                           /*!< (@ 0x00000004) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1      */
  __IM  uint32_t  FSCTRL2;                           /*!< (@ 0x00000008) Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2      */
  __IM  uint32_t  RXCTRL;                            /*!< (@ 0x0000000C) Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL       */
  __IM  uint32_t  OVRRXTRIMCODE;                     /*!< (@ 0x00000010) Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE*/
} NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type;      /*!< Size = 20 (0x014)                                                    */

/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL0 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL0_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL1 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL1_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2: Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2 */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of FSCTRL2 register.          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_FSCTRL2_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL: Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RXCTRL register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_RXCTRL_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE: Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OVRRXTRIMCODE
                                                                            register.*/

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos (0UL) /*!< Position of VALUE field.                      */
  #define FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_OVRRXTRIMCODE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================= Struct FICR_TRIM_RADIOCORE_RADIO_RXAGC ========================================== */
/**
  * @brief RXAGC [FICR_TRIM_RADIOCORE_RADIO_RXAGC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CALIBRATION;                       /*!< (@ 0x00000000) Trim value for RSSICAL and ED154CAL in
                                                                         RADIOCORE.RADIO.RXAGC.CALIBRATION*/
} NRF_FICR_TRIM_RADIOCORE_RADIO_RXAGC_Type;          /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION: Trim value for RSSICAL and ED154CAL in RADIOCORE.RADIO.RXAGC.CALIBRATION */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALIBRATION register.      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Pos (0UL) /*!< Position of VALUE field.                            */
  #define FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_RXAGC_CALIBRATION_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_RADIOCORE_RADIO ============================================= */
/**
  * @brief RADIO [FICR_TRIM_RADIOCORE_RADIO] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA_Type SPHYNXANA; /*!< (@ 0x00000000) (unspecified)                              */
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_RXAGC_Type RXAGC; /*!< (@ 0x00000014) (unspecified)                                      */
  __IM  uint32_t  PVTTOT;                            /*!< (@ 0x00000018) Trim value for RADIOCORE.RADIO.EXPECTEDPVTTOTRATIO    */
  __IM  uint32_t  KDTC;                              /*!< (@ 0x0000001C) Trim value for RADIOCORE.RADIO.ESTKDTCVAL             */
  __IM  uint32_t  TXHFGAIN;                          /*!< (@ 0x00000020) Trim value for RADIOCORE.RADIO.TXINTERFACEHFGAIN      */
  __IM  uint32_t  PVTTOFIX;                          /*!< (@ 0x00000024) Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND6   */
  __IM  uint32_t  LOOPGAIN;                          /*!< (@ 0x00000028) Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND5   */
} NRF_FICR_TRIM_RADIOCORE_RADIO_Type;                /*!< Size = 44 (0x02C)                                                    */

