tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* FICR_TRIM_RADIOCORE_RADIO_PVTTOT: Trim value for RADIOCORE.RADIO.EXPECTEDPVTTOTRATIO */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PVTTOT register.                      */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Pos (0UL) /*!< Position of VALUE field.                                       */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_PVTTOT_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_KDTC: Trim value for RADIOCORE.RADIO.ESTKDTCVAL */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_ResetValue (0xFFFFFFFFUL) /*!< Reset value of KDTC register.                          */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_KDTC_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN: Trim value for RADIOCORE.RADIO.TXINTERFACEHFGAIN */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TXHFGAIN register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_TXHFGAIN_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX: Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND6 */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PVTTOFIX register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_PVTTOFIX_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN: Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND5 */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOOPGAIN register.                  */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_RADIO_LOOPGAIN_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* =============================================== Struct FICR_TRIM_RADIOCORE ================================================ */
/**
  * @brief RADIOCORE [FICR_TRIM_RADIOCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_Type HSFLL;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type MEMCONF; /*!< (@ 0x00000034) (unspecified)                                        */
  __IOM NRF_FICR_TRIM_RADIOCORE_RADIO_Type RADIO;    /*!< (@ 0x00000040) (unspecified)                                         */
} NRF_FICR_TRIM_RADIOCORE_Type;                      /*!< Size = 108 (0x06C)                                                   */


/* ==================================================== Struct FICR_TRIM ===================================================== */
/**
  * @brief TRIM [FICR_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[161];
  __IOM NRF_FICR_TRIM_GLOBAL_Type GLOBAL;            /*!< (@ 0x00000284) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_APPLICATION_Type APPLICATION;  /*!< (@ 0x000002D8) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_Type RADIOCORE;      /*!< (@ 0x00000318) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[61];
} NRF_FICR_TRIM_Type;                                /*!< Size = 1144 (0x478)                                                  */

/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IM uint32_t RESERVED[3];
    __IOM NRF_FICR_BLE_Type BLE;                     /*!< (@ 0x0000000C) (unspecified)                                         */
    __IM uint32_t RESERVED1[2];
    __IOM NRF_FICR_NFC_Type NFC;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000050) Device info                                           */
    __IM uint32_t RESERVED2[35];
    __IOM NRF_FICR_TRIM_Type TRIM;                   /*!< (@ 0x00000100) (unspecified)                                         */
  } NRF_FICR_Type;                                   /*!< Size = 1400 (0x578)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct GPIO_PORTCNF =================================================== */
/**
  * @brief PORTCNF [GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    struct {
      __IOM uint32_t DRIVECTRL;                      /*!< (@ 0x00000000) Drive control for impedance matching of the pins in
                                                                         this port*/
    };
    struct {
    };
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
} NRF_GPIO_PORTCNF_Type;                             /*!< Size = 4 (0x004)                                                     */

/* GPIO_PORTCNF_DRIVECTRL: Drive control for impedance matching of the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_ResetValue (0x00000000UL) /*!< Reset value of DRIVECTRL register.                             */

