tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* IMPEDANCE50 @Bit 0 : Enable 50 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos (0UL) /*!< Position of IMPEDANCE50 field.                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos) /*!< Bit mask of IMPEDANCE50
                                                                            field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Disable (0x0UL) /*!< Disabled                                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Enable (0x1UL) /*!< Enable                                                        */

/* IMPEDANCE100 @Bit 1 : Enable 100 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos (1UL) /*!< Position of IMPEDANCE100 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos) /*!< Bit mask of
                                                                            IMPEDANCE100 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE200 @Bit 2 : Enable 200 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos (2UL) /*!< Position of IMPEDANCE200 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos) /*!< Bit mask of
                                                                            IMPEDANCE200 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE400 @Bit 3 : Enable 400 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos (3UL) /*!< Position of IMPEDANCE400 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos) /*!< Bit mask of
                                                                            IMPEDANCE400 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE800 @Bit 4 : Enable 800 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos (4UL) /*!< Position of IMPEDANCE800 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos) /*!< Bit mask of
                                                                            IMPEDANCE800 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE800 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE800 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE1600 @Bit 5 : Enable 1600 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos (5UL) /*!< Position of IMPEDANCE1600 field.                                 */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos) /*!< Bit mask of
                                                                            IMPEDANCE1600 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE1600 field.                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE1600 field.                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Disable (0x0UL) /*!< Disabled                                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Enable (0x1UL) /*!< Enable                                                      */


/* ======================================================= Struct GPIO ======================================================= */
/**
  * @brief GPIO Port
  */
  typedef struct {                                   /*!< GPIO Structure                                                       */
    __IOM uint32_t OUT;                              /*!< (@ 0x00000000) Write GPIO port                                       */
    __IOM uint32_t OUTSET;                           /*!< (@ 0x00000004) Set individual bits in GPIO port                      */
    __IOM uint32_t OUTCLR;                           /*!< (@ 0x00000008) Clear individual bits in GPIO port                    */
    __IM uint32_t IN;                                /*!< (@ 0x0000000C) Read GPIO port                                        */
    __IOM uint32_t DIR;                              /*!< (@ 0x00000010) Direction of GPIO pins                                */
    __IOM uint32_t DIRSET;                           /*!< (@ 0x00000014) DIR set register                                      */
    __IOM uint32_t DIRCLR;                           /*!< (@ 0x00000018) DIR clear register                                    */
    __IM uint32_t RESERVED;
    __IOM uint32_t LATCH;                            /*!< (@ 0x00000020) Latch register indicating what GPIO pins that have met
                                                                         the criteria set in the PIN_CNF[n].SENSE registers*/
    __IOM uint32_t DETECTMODE;                       /*!< (@ 0x00000024) Select between default DETECT signal behavior and
                                                                         LDETECT mode*/
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000028) Enable retention for those GPIO registers marked as
                                                                         retained*/
    __IM uint32_t RESERVED1;
    __IOM NRF_GPIO_PORTCNF_Type PORTCNF;             /*!< (@ 0x00000030) (unspecified)                                         */
    __IM uint32_t RESERVED2[19];
    __IOM uint32_t PIN_CNF[32];                      /*!< (@ 0x00000080) Pin n configuration of GPIO pin                       */
  } NRF_GPIO_Type;                                   /*!< Size = 256 (0x100)                                                   */

/* GPIO_OUT: Write GPIO port */
  #define GPIO_OUT_ResetValue (0x00000000UL)         /*!< Reset value of OUT register.                                         */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUT_PIN0_Pos (0UL)                    /*!< Position of PIN0 field.                                              */
  #define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos) /*!< Bit mask of PIN0 field.                                          */
  #define GPIO_OUT_PIN0_Min (0x0UL)                  /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Max (0x1UL)                  /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN0_High (0x1UL)                 /*!< Pin driver is high                                                   */

