tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PIN31 @Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN31_Pos (31UL)                /*!< Position of PIN31 field.                                             */
  #define GPIO_LATCH_PIN31_Msk (0x1UL << GPIO_LATCH_PIN31_Pos) /*!< Bit mask of PIN31 field.                                   */
  #define GPIO_LATCH_PIN31_Min (0x0UL)               /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_Max (0x1UL)               /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN31_Latched (0x1UL)           /*!< Criteria has been met                                                */


/* GPIO_DETECTMODE: Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_ResetValue (0x00000000UL)  /*!< Reset value of DETECTMODE register.                                  */

/* DETECTMODE @Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_DETECTMODE_Pos (0UL)       /*!< Position of DETECTMODE field.                                        */
  #define GPIO_DETECTMODE_DETECTMODE_Msk (0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos) /*!< Bit mask of DETECTMODE field.          */
  #define GPIO_DETECTMODE_DETECTMODE_Min (0x0UL)     /*!< Min enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Max (0x1UL)     /*!< Max enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Default (0x0UL) /*!< DETECT directly connected to PIN DETECT signals                      */
  #define GPIO_DETECTMODE_DETECTMODE_LDETECT (0x1UL) /*!< Use the latched LDETECT behavior                                     */


/* GPIO_RETAIN: Enable retention for those GPIO registers marked as retained */
  #define GPIO_RETAIN_ResetValue (0x0000000CUL)      /*!< Reset value of RETAIN register.                                      */

/* APPLICAION @Bit 2 : Enable retention for GPIO registers for Application domain */
  #define GPIO_RETAIN_APPLICAION_Pos (2UL)           /*!< Position of APPLICAION field.                                        */
  #define GPIO_RETAIN_APPLICAION_Msk (0x1UL << GPIO_RETAIN_APPLICAION_Pos) /*!< Bit mask of APPLICAION field.                  */
  #define GPIO_RETAIN_APPLICAION_Min (0x0UL)         /*!< Min enumerator value of APPLICAION field.                            */
  #define GPIO_RETAIN_APPLICAION_Max (0x1UL)         /*!< Max enumerator value of APPLICAION field.                            */
  #define GPIO_RETAIN_APPLICAION_Disabled (0x0UL)    /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_APPLICAION_Enabled (0x1UL)     /*!< Retention enabled                                                    */

/* RADIOCORE @Bit 3 : Enable retention for GPIO registers for Radio core */
  #define GPIO_RETAIN_RADIOCORE_Pos (3UL)            /*!< Position of RADIOCORE field.                                         */
  #define GPIO_RETAIN_RADIOCORE_Msk (0x1UL << GPIO_RETAIN_RADIOCORE_Pos) /*!< Bit mask of RADIOCORE field.                     */
  #define GPIO_RETAIN_RADIOCORE_Min (0x0UL)          /*!< Min enumerator value of RADIOCORE field.                             */
  #define GPIO_RETAIN_RADIOCORE_Max (0x1UL)          /*!< Max enumerator value of RADIOCORE field.                             */
  #define GPIO_RETAIN_RADIOCORE_Disabled (0x0UL)     /*!< Retention disabled                                                   */
  #define GPIO_RETAIN_RADIOCORE_Enabled (0x1UL)      /*!< Retention enabled                                                    */


/* GPIO_PIN_CNF: Pin n configuration of GPIO pin */
  #define GPIO_PIN_CNF_MaxCount (32UL)               /*!< Max size of PIN_CNF[32] array.                                       */
  #define GPIO_PIN_CNF_MaxIndex (31UL)               /*!< Max index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_MinIndex (0UL)                /*!< Min index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_ResetValue (0x00000002UL)     /*!< Reset value of PIN_CNF[32] register.                                 */

/* DIR @Bit 0 : Pin direction. Same physical register as DIR register */
  #define GPIO_PIN_CNF_DIR_Pos (0UL)                 /*!< Position of DIR field.                                               */
  #define GPIO_PIN_CNF_DIR_Msk (0x1UL << GPIO_PIN_CNF_DIR_Pos) /*!< Bit mask of DIR field.                                     */
  #define GPIO_PIN_CNF_DIR_Min (0x0UL)               /*!< Min enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Max (0x1UL)               /*!< Max enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Input (0x0UL)             /*!< Configure pin as an input pin                                        */
  #define GPIO_PIN_CNF_DIR_Output (0x1UL)            /*!< Configure pin as an output pin                                       */

/* INPUT @Bit 1 : Connect or disconnect input buffer */
  #define GPIO_PIN_CNF_INPUT_Pos (1UL)               /*!< Position of INPUT field.                                             */
  #define GPIO_PIN_CNF_INPUT_Msk (0x1UL << GPIO_PIN_CNF_INPUT_Pos) /*!< Bit mask of INPUT field.                               */
  #define GPIO_PIN_CNF_INPUT_Min (0x0UL)             /*!< Min enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Max (0x1UL)             /*!< Max enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Connect (0x0UL)         /*!< Connect input buffer                                                 */
  #define GPIO_PIN_CNF_INPUT_Disconnect (0x1UL)      /*!< Disconnect input buffer                                              */

