tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PORT2NONSECURE @Bit 20 : Write '1' to disable interrupt for event PORT2NONSECURE */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Pos (20UL) /*!< Position of PORT2NONSECURE field.                                    */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT2NONSECURE_Pos) /*!< Bit mask of PORT2NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT2NONSECURE field.                       */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT2NONSECURE field.                       */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT2SECURE @Bit 21 : Write '1' to disable interrupt for event PORT2SECURE */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Pos (21UL)    /*!< Position of PORT2SECURE field.                                       */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT2SECURE_Pos) /*!< Bit mask of PORT2SECURE field.     */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT2SECURE field.                           */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT2SECURE field.                           */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* PORT3NONSECURE @Bit 22 : Write '1' to disable interrupt for event PORT3NONSECURE */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Pos (22UL) /*!< Position of PORT3NONSECURE field.                                    */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT3NONSECURE_Pos) /*!< Bit mask of PORT3NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT3NONSECURE field.                       */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT3NONSECURE field.                       */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Clear (0x1UL) /*!< Disable                                                           */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT3SECURE @Bit 23 : Write '1' to disable interrupt for event PORT3SECURE */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Pos (23UL)    /*!< Position of PORT3SECURE field.                                       */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT3SECURE_Pos) /*!< Bit mask of PORT3SECURE field.     */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT3SECURE field.                           */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT3SECURE field.                           */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Clear (0x1UL) /*!< Disable                                                              */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GPIOTE_LATENCY: Latency selection for Event mode (MODE=Event) with rising or falling edge detection on the pin. */
  #define GPIOTE_LATENCY_ResetValue (0x00000001UL)   /*!< Reset value of LATENCY register.                                     */

/* LATENCY @Bit 0 : Latency setting */
  #define GPIOTE_LATENCY_LATENCY_Pos (0UL)           /*!< Position of LATENCY field.                                           */
  #define GPIOTE_LATENCY_LATENCY_Msk (0x1UL << GPIOTE_LATENCY_LATENCY_Pos) /*!< Bit mask of LATENCY field.                     */
  #define GPIOTE_LATENCY_LATENCY_Min (0x0UL)         /*!< Min enumerator value of LATENCY field.                               */
  #define GPIOTE_LATENCY_LATENCY_Max (0x1UL)         /*!< Max enumerator value of LATENCY field.                               */
  #define GPIOTE_LATENCY_LATENCY_LowPower (0x0UL)    /*!< Low power setting, for signals with minimum hold time tGPIOTE,HOLD,LP;
                                                          refer to Electrical specification section*/
  #define GPIOTE_LATENCY_LATENCY_LowLatency (0x1UL)  /*!< Low latency setting, for signals with minimum hold time
                                                          tGPIOTE,HOLD,LL; refer to Electrical specification section*/


/* GPIOTE_CONFIG: Configuration for OUT[n], SET[n], and CLR[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_MaxCount (8UL)               /*!< Max size of CONFIG[8] array.                                         */
  #define GPIOTE_CONFIG_MaxIndex (7UL)               /*!< Max index of CONFIG[8] array.                                        */
  #define GPIOTE_CONFIG_MinIndex (0UL)               /*!< Min index of CONFIG[8] array.                                        */
  #define GPIOTE_CONFIG_ResetValue (0x00000000UL)    /*!< Reset value of CONFIG[8] register.                                   */

/* MODE @Bits 0..1 : Mode */
  #define GPIOTE_CONFIG_MODE_Pos (0UL)               /*!< Position of MODE field.                                              */
  #define GPIOTE_CONFIG_MODE_Msk (0x3UL << GPIOTE_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                                */
  #define GPIOTE_CONFIG_MODE_Min (0x0UL)             /*!< Min enumerator value of MODE field.                                  */
  #define GPIOTE_CONFIG_MODE_Max (0x3UL)             /*!< Max enumerator value of MODE field.                                  */
  #define GPIOTE_CONFIG_MODE_Disabled (0x0UL)        /*!< Disabled. Pin specified by PSEL will not be acquired by the GPIOTE
                                                          module.*/
  #define GPIOTE_CONFIG_MODE_Event (0x1UL)           /*!< Event mode                                                           */
  #define GPIOTE_CONFIG_MODE_Task (0x3UL)            /*!< Task mode                                                            */

