tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* COMPARE13 @Bit 13 : Enable or disable interrupt for event COMPARE[13] */
  #define GRTC_INTEN1_COMPARE13_Pos (13UL)           /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTEN1_COMPARE13_Msk (0x1UL << GRTC_INTEN1_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.                     */
  #define GRTC_INTEN1_COMPARE13_Min (0x0UL)          /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTEN1_COMPARE13_Max (0x1UL)          /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTEN1_COMPARE13_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE13_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE14 @Bit 14 : Enable or disable interrupt for event COMPARE[14] */
  #define GRTC_INTEN1_COMPARE14_Pos (14UL)           /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTEN1_COMPARE14_Msk (0x1UL << GRTC_INTEN1_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.                     */
  #define GRTC_INTEN1_COMPARE14_Min (0x0UL)          /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTEN1_COMPARE14_Max (0x1UL)          /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTEN1_COMPARE14_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE14_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE15 @Bit 15 : Enable or disable interrupt for event COMPARE[15] */
  #define GRTC_INTEN1_COMPARE15_Pos (15UL)           /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTEN1_COMPARE15_Msk (0x1UL << GRTC_INTEN1_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.                     */
  #define GRTC_INTEN1_COMPARE15_Min (0x0UL)          /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTEN1_COMPARE15_Max (0x1UL)          /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTEN1_COMPARE15_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE15_Enabled (0x1UL)      /*!< Enable                                                               */

/* RTCOMPARESYNC @Bit 25 : Enable or disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTEN1_RTCOMPARESYNC_Pos (25UL)       /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTEN1_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTEN1_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Min (0x0UL)      /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Max (0x1UL)      /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Disabled (0x0UL) /*!< Disable                                                              */
  #define GRTC_INTEN1_RTCOMPARESYNC_Enabled (0x1UL)  /*!< Enable                                                               */

/* SYSCOUNTERVALID @Bit 26 : Enable or disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Pos (26UL)     /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTEN1_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID field.   */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Min (0x0UL)    /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Max (0x1UL)    /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Disabled (0x0UL) /*!< Disable                                                            */
  #define GRTC_INTEN1_SYSCOUNTERVALID_Enabled (0x1UL) /*!< Enable                                                              */


/* GRTC_INTENSET1: Enable interrupt */
  #define GRTC_INTENSET1_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET1 register.                                   */

/* COMPARE0 @Bit 0 : Write '1' to enable interrupt for event COMPARE[0] */
  #define GRTC_INTENSET1_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTENSET1_COMPARE0_Msk (0x1UL << GRTC_INTENSET1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTENSET1_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET1_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET1_COMPARE0_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET1_COMPARE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET1_COMPARE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 1 : Write '1' to enable interrupt for event COMPARE[1] */
  #define GRTC_INTENSET1_COMPARE1_Pos (1UL)          /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTENSET1_COMPARE1_Msk (0x1UL << GRTC_INTENSET1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                  */
  #define GRTC_INTENSET1_COMPARE1_Min (0x0UL)        /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET1_COMPARE1_Max (0x1UL)        /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET1_COMPARE1_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET1_COMPARE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET1_COMPARE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 2 : Write '1' to enable interrupt for event COMPARE[2] */
  #define GRTC_INTENSET1_COMPARE2_Pos (2UL)          /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTENSET1_COMPARE2_Msk (0x1UL << GRTC_INTENSET1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                  */
  #define GRTC_INTENSET1_COMPARE2_Min (0x0UL)        /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET1_COMPARE2_Max (0x1UL)        /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET1_COMPARE2_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET1_COMPARE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET1_COMPARE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

