tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* COMPARE1 @Bit 1 : Read pending status of interrupt for event COMPARE[1] */
  #define GRTC_INTPEND5_COMPARE1_Pos (1UL)           /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTPEND5_COMPARE1_Msk (0x1UL << GRTC_INTPEND5_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                    */
  #define GRTC_INTPEND5_COMPARE1_Min (0x0UL)         /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTPEND5_COMPARE1_Max (0x1UL)         /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTPEND5_COMPARE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE2 @Bit 2 : Read pending status of interrupt for event COMPARE[2] */
  #define GRTC_INTPEND5_COMPARE2_Pos (2UL)           /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTPEND5_COMPARE2_Msk (0x1UL << GRTC_INTPEND5_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                    */
  #define GRTC_INTPEND5_COMPARE2_Min (0x0UL)         /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTPEND5_COMPARE2_Max (0x1UL)         /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTPEND5_COMPARE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE3 @Bit 3 : Read pending status of interrupt for event COMPARE[3] */
  #define GRTC_INTPEND5_COMPARE3_Pos (3UL)           /*!< Position of COMPARE3 field.                                          */
  #define GRTC_INTPEND5_COMPARE3_Msk (0x1UL << GRTC_INTPEND5_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                    */
  #define GRTC_INTPEND5_COMPARE3_Min (0x0UL)         /*!< Min enumerator value of COMPARE3 field.                              */
  #define GRTC_INTPEND5_COMPARE3_Max (0x1UL)         /*!< Max enumerator value of COMPARE3 field.                              */
  #define GRTC_INTPEND5_COMPARE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE4 @Bit 4 : Read pending status of interrupt for event COMPARE[4] */
  #define GRTC_INTPEND5_COMPARE4_Pos (4UL)           /*!< Position of COMPARE4 field.                                          */
  #define GRTC_INTPEND5_COMPARE4_Msk (0x1UL << GRTC_INTPEND5_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                    */
  #define GRTC_INTPEND5_COMPARE4_Min (0x0UL)         /*!< Min enumerator value of COMPARE4 field.                              */
  #define GRTC_INTPEND5_COMPARE4_Max (0x1UL)         /*!< Max enumerator value of COMPARE4 field.                              */
  #define GRTC_INTPEND5_COMPARE4_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE4_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE5 @Bit 5 : Read pending status of interrupt for event COMPARE[5] */
  #define GRTC_INTPEND5_COMPARE5_Pos (5UL)           /*!< Position of COMPARE5 field.                                          */
  #define GRTC_INTPEND5_COMPARE5_Msk (0x1UL << GRTC_INTPEND5_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                    */
  #define GRTC_INTPEND5_COMPARE5_Min (0x0UL)         /*!< Min enumerator value of COMPARE5 field.                              */
  #define GRTC_INTPEND5_COMPARE5_Max (0x1UL)         /*!< Max enumerator value of COMPARE5 field.                              */
  #define GRTC_INTPEND5_COMPARE5_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE5_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE6 @Bit 6 : Read pending status of interrupt for event COMPARE[6] */
  #define GRTC_INTPEND5_COMPARE6_Pos (6UL)           /*!< Position of COMPARE6 field.                                          */
  #define GRTC_INTPEND5_COMPARE6_Msk (0x1UL << GRTC_INTPEND5_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                    */
  #define GRTC_INTPEND5_COMPARE6_Min (0x0UL)         /*!< Min enumerator value of COMPARE6 field.                              */
  #define GRTC_INTPEND5_COMPARE6_Max (0x1UL)         /*!< Max enumerator value of COMPARE6 field.                              */
  #define GRTC_INTPEND5_COMPARE6_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE6_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE7 @Bit 7 : Read pending status of interrupt for event COMPARE[7] */
  #define GRTC_INTPEND5_COMPARE7_Pos (7UL)           /*!< Position of COMPARE7 field.                                          */
  #define GRTC_INTPEND5_COMPARE7_Msk (0x1UL << GRTC_INTPEND5_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                    */
  #define GRTC_INTPEND5_COMPARE7_Min (0x0UL)         /*!< Min enumerator value of COMPARE7 field.                              */
  #define GRTC_INTPEND5_COMPARE7_Max (0x1UL)         /*!< Max enumerator value of COMPARE7 field.                              */
  #define GRTC_INTPEND5_COMPARE7_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE7_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE8 @Bit 8 : Read pending status of interrupt for event COMPARE[8] */
  #define GRTC_INTPEND5_COMPARE8_Pos (8UL)           /*!< Position of COMPARE8 field.                                          */
  #define GRTC_INTPEND5_COMPARE8_Msk (0x1UL << GRTC_INTPEND5_COMPARE8_Pos) /*!< Bit mask of COMPARE8 field.                    */
  #define GRTC_INTPEND5_COMPARE8_Min (0x0UL)         /*!< Min enumerator value of COMPARE8 field.                              */
  #define GRTC_INTPEND5_COMPARE8_Max (0x1UL)         /*!< Max enumerator value of COMPARE8 field.                              */
  #define GRTC_INTPEND5_COMPARE8_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE8_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE9 @Bit 9 : Read pending status of interrupt for event COMPARE[9] */
  #define GRTC_INTPEND5_COMPARE9_Pos (9UL)           /*!< Position of COMPARE9 field.                                          */
  #define GRTC_INTPEND5_COMPARE9_Msk (0x1UL << GRTC_INTPEND5_COMPARE9_Pos) /*!< Bit mask of COMPARE9 field.                    */
  #define GRTC_INTPEND5_COMPARE9_Min (0x0UL)         /*!< Min enumerator value of COMPARE9 field.                              */
  #define GRTC_INTPEND5_COMPARE9_Max (0x1UL)         /*!< Max enumerator value of COMPARE9 field.                              */
  #define GRTC_INTPEND5_COMPARE9_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE9_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE10 @Bit 10 : Read pending status of interrupt for event COMPARE[10] */
  #define GRTC_INTPEND5_COMPARE10_Pos (10UL)         /*!< Position of COMPARE10 field.                                         */
  #define GRTC_INTPEND5_COMPARE10_Msk (0x1UL << GRTC_INTPEND5_COMPARE10_Pos) /*!< Bit mask of COMPARE10 field.                 */
  #define GRTC_INTPEND5_COMPARE10_Min (0x0UL)        /*!< Min enumerator value of COMPARE10 field.                             */
  #define GRTC_INTPEND5_COMPARE10_Max (0x1UL)        /*!< Max enumerator value of COMPARE10 field.                             */
  #define GRTC_INTPEND5_COMPARE10_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE10_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE11 @Bit 11 : Read pending status of interrupt for event COMPARE[11] */
  #define GRTC_INTPEND5_COMPARE11_Pos (11UL)         /*!< Position of COMPARE11 field.                                         */
  #define GRTC_INTPEND5_COMPARE11_Msk (0x1UL << GRTC_INTPEND5_COMPARE11_Pos) /*!< Bit mask of COMPARE11 field.                 */
  #define GRTC_INTPEND5_COMPARE11_Min (0x0UL)        /*!< Min enumerator value of COMPARE11 field.                             */
  #define GRTC_INTPEND5_COMPARE11_Max (0x1UL)        /*!< Max enumerator value of COMPARE11 field.                             */
  #define GRTC_INTPEND5_COMPARE11_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE11_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE12 @Bit 12 : Read pending status of interrupt for event COMPARE[12] */
  #define GRTC_INTPEND5_COMPARE12_Pos (12UL)         /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTPEND5_COMPARE12_Msk (0x1UL << GRTC_INTPEND5_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.                 */
  #define GRTC_INTPEND5_COMPARE12_Min (0x0UL)        /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTPEND5_COMPARE12_Max (0x1UL)        /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTPEND5_COMPARE12_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE12_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE13 @Bit 13 : Read pending status of interrupt for event COMPARE[13] */
  #define GRTC_INTPEND5_COMPARE13_Pos (13UL)         /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTPEND5_COMPARE13_Msk (0x1UL << GRTC_INTPEND5_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.                 */
  #define GRTC_INTPEND5_COMPARE13_Min (0x0UL)        /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTPEND5_COMPARE13_Max (0x1UL)        /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTPEND5_COMPARE13_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE13_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE14 @Bit 14 : Read pending status of interrupt for event COMPARE[14] */
  #define GRTC_INTPEND5_COMPARE14_Pos (14UL)         /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTPEND5_COMPARE14_Msk (0x1UL << GRTC_INTPEND5_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.                 */
  #define GRTC_INTPEND5_COMPARE14_Min (0x0UL)        /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTPEND5_COMPARE14_Max (0x1UL)        /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTPEND5_COMPARE14_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE14_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* COMPARE15 @Bit 15 : Read pending status of interrupt for event COMPARE[15] */
  #define GRTC_INTPEND5_COMPARE15_Pos (15UL)         /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTPEND5_COMPARE15_Msk (0x1UL << GRTC_INTPEND5_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.                 */
  #define GRTC_INTPEND5_COMPARE15_Min (0x0UL)        /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTPEND5_COMPARE15_Max (0x1UL)        /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTPEND5_COMPARE15_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND5_COMPARE15_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RTCOMPARESYNC @Bit 25 : Read pending status of interrupt for event RTCOMPARESYNC */
  #define GRTC_INTPEND5_RTCOMPARESYNC_Pos (25UL)     /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTPEND5_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTPEND5_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.     */
  #define GRTC_INTPEND5_RTCOMPARESYNC_Min (0x0UL)    /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND5_RTCOMPARESYNC_Max (0x1UL)    /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTPEND5_RTCOMPARESYNC_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define GRTC_INTPEND5_RTCOMPARESYNC_Pending (0x1UL) /*!< Read: Pending                                                       */

/* SYSCOUNTERVALID @Bit 26 : Read pending status of interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTPEND5_SYSCOUNTERVALID_Pos (26UL)   /*!< Position of SYSCOUNTERVALID field.                                   */
  #define GRTC_INTPEND5_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTPEND5_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTPEND5_SYSCOUNTERVALID_Min (0x0UL)  /*!< Min enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND5_SYSCOUNTERVALID_Max (0x1UL)  /*!< Max enumerator value of SYSCOUNTERVALID field.                       */
  #define GRTC_INTPEND5_SYSCOUNTERVALID_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define GRTC_INTPEND5_SYSCOUNTERVALID_Pending (0x1UL) /*!< Read: Pending                                                     */


/* GRTC_INTEN6: Enable or disable interrupt */
  #define GRTC_INTEN6_ResetValue (0x00000000UL)      /*!< Reset value of INTEN6 register.                                      */

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN6_COMPARE0_Pos (0UL)             /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTEN6_COMPARE0_Msk (0x1UL << GRTC_INTEN6_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                        */
  #define GRTC_INTEN6_COMPARE0_Min (0x0UL)           /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN6_COMPARE0_Max (0x1UL)           /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN6_COMPARE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN6_COMPARE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN6_COMPARE1_Pos (1UL)             /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTEN6_COMPARE1_Msk (0x1UL << GRTC_INTEN6_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                        */
  #define GRTC_INTEN6_COMPARE1_Min (0x0UL)           /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN6_COMPARE1_Max (0x1UL)           /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN6_COMPARE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN6_COMPARE1_Enabled (0x1UL)       /*!< Enable                                                               */

