tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SYSCOUNTEREN @Bit 1 : Enable the SYSCOUNTER */
  #define GRTC_MODE_SYSCOUNTEREN_Pos (1UL)           /*!< Position of SYSCOUNTEREN field.                                      */
  #define GRTC_MODE_SYSCOUNTEREN_Msk (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos) /*!< Bit mask of SYSCOUNTEREN field.                */
  #define GRTC_MODE_SYSCOUNTEREN_Min (0x0UL)         /*!< Min enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Max (0x1UL)         /*!< Max enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Disabled (0x0UL)    /*!< SYSCOUNTER disabled                                                  */
  #define GRTC_MODE_SYSCOUNTEREN_Enabled (0x1UL)     /*!< SYSCOUNTER enabled                                                   */


/* GRTC_SYSCOUNTERL: The lower 32-bits of the SYSCOUNTER */
  #define GRTC_SYSCOUNTERL_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTERL register.                                 */

/* VALUE @Bits 0..31 : The lower 32-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTERL_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define GRTC_SYSCOUNTERL_VALUE_Msk (0xFFFFFFFFUL << GRTC_SYSCOUNTERL_VALUE_Pos) /*!< Bit mask of VALUE field.                */


/* GRTC_SYSCOUNTERH: The higher 20-bits of the SYSCOUNTER */
  #define GRTC_SYSCOUNTERH_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTERH register.                                 */

/* VALUE @Bits 0..19 : The higher 20-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTERH_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define GRTC_SYSCOUNTERH_VALUE_Msk (0xFFFFFUL << GRTC_SYSCOUNTERH_VALUE_Pos) /*!< Bit mask of VALUE field.                   */

/* OVERFLOW @Bit 31 : The SYSCOUNTERL overflow indication after reading it. */
  #define GRTC_SYSCOUNTERH_OVERFLOW_Pos (31UL)       /*!< Position of OVERFLOW field.                                          */
  #define GRTC_SYSCOUNTERH_OVERFLOW_Msk (0x1UL << GRTC_SYSCOUNTERH_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.              */
  #define GRTC_SYSCOUNTERH_OVERFLOW_Min (0x0UL)      /*!< Min enumerator value of OVERFLOW field.                              */
  #define GRTC_SYSCOUNTERH_OVERFLOW_Max (0x1UL)      /*!< Max enumerator value of OVERFLOW field.                              */
  #define GRTC_SYSCOUNTERH_OVERFLOW_NoOverflow (0x0UL) /*!< SYSCOUNTERL is not overflown                                       */
  #define GRTC_SYSCOUNTERH_OVERFLOW_Overflow (0x1UL) /*!< SYSCOUNTERL overflown                                                */


/* GRTC_KEEPRUNNING: Request to keep the SYSCOUNTER in the active state and prevent going to sleep */
  #define GRTC_KEEPRUNNING_ResetValue (0x00000000UL) /*!< Reset value of KEEPRUNNING register.                                 */

/* DOMAIN0 @Bit 0 : Request from the Domain [0] */
  #define GRTC_KEEPRUNNING_DOMAIN0_Pos (0UL)         /*!< Position of DOMAIN0 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN0_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN0_Pos) /*!< Bit mask of DOMAIN0 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN0_Min (0x0UL)       /*!< Min enumerator value of DOMAIN0 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN0_Max (0x1UL)       /*!< Max enumerator value of DOMAIN0 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN0_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN0_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN1 @Bit 1 : Request from the Domain [1] */
  #define GRTC_KEEPRUNNING_DOMAIN1_Pos (1UL)         /*!< Position of DOMAIN1 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN1_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN1_Pos) /*!< Bit mask of DOMAIN1 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN1_Min (0x0UL)       /*!< Min enumerator value of DOMAIN1 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN1_Max (0x1UL)       /*!< Max enumerator value of DOMAIN1 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN1_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN1_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN2 @Bit 2 : Request from the Domain [2] */
  #define GRTC_KEEPRUNNING_DOMAIN2_Pos (2UL)         /*!< Position of DOMAIN2 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN2_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN2_Pos) /*!< Bit mask of DOMAIN2 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN2_Min (0x0UL)       /*!< Min enumerator value of DOMAIN2 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN2_Max (0x1UL)       /*!< Max enumerator value of DOMAIN2 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN2_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN2_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN3 @Bit 3 : Request from the Domain [3] */
  #define GRTC_KEEPRUNNING_DOMAIN3_Pos (3UL)         /*!< Position of DOMAIN3 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN3_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN3_Pos) /*!< Bit mask of DOMAIN3 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN3_Min (0x0UL)       /*!< Min enumerator value of DOMAIN3 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN3_Max (0x1UL)       /*!< Max enumerator value of DOMAIN3 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN3_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN3_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN4 @Bit 4 : Request from the Domain [4] */
  #define GRTC_KEEPRUNNING_DOMAIN4_Pos (4UL)         /*!< Position of DOMAIN4 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN4_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN4_Pos) /*!< Bit mask of DOMAIN4 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN4_Min (0x0UL)       /*!< Min enumerator value of DOMAIN4 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN4_Max (0x1UL)       /*!< Max enumerator value of DOMAIN4 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN4_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN4_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN5 @Bit 5 : Request from the Domain [5] */
  #define GRTC_KEEPRUNNING_DOMAIN5_Pos (5UL)         /*!< Position of DOMAIN5 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN5_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN5_Pos) /*!< Bit mask of DOMAIN5 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN5_Min (0x0UL)       /*!< Min enumerator value of DOMAIN5 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN5_Max (0x1UL)       /*!< Max enumerator value of DOMAIN5 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN5_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN5_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN6 @Bit 6 : Request from the Domain [6] */
  #define GRTC_KEEPRUNNING_DOMAIN6_Pos (6UL)         /*!< Position of DOMAIN6 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN6_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN6_Pos) /*!< Bit mask of DOMAIN6 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN6_Min (0x0UL)       /*!< Min enumerator value of DOMAIN6 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN6_Max (0x1UL)       /*!< Max enumerator value of DOMAIN6 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN6_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN6_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

/* DOMAIN7 @Bit 7 : Request from the Domain [7] */
  #define GRTC_KEEPRUNNING_DOMAIN7_Pos (7UL)         /*!< Position of DOMAIN7 field.                                           */
  #define GRTC_KEEPRUNNING_DOMAIN7_Msk (0x1UL << GRTC_KEEPRUNNING_DOMAIN7_Pos) /*!< Bit mask of DOMAIN7 field.                 */
  #define GRTC_KEEPRUNNING_DOMAIN7_Min (0x0UL)       /*!< Min enumerator value of DOMAIN7 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN7_Max (0x1UL)       /*!< Max enumerator value of DOMAIN7 field.                               */
  #define GRTC_KEEPRUNNING_DOMAIN7_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                      */
  #define GRTC_KEEPRUNNING_DOMAIN7_Active (0x1UL)    /*!< Keep SYSCOUNTER active                                               */

