tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* VALUE @Bits 0..15 : Count to add to CC[0] */
  #define GRTC_INTERVAL_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_INTERVAL_VALUE_Msk (0xFFFFUL << GRTC_INTERVAL_VALUE_Pos) /*!< Bit mask of VALUE field.                          */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HSFLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct HSFLL_FREQM ==================================================== */
/**
  * @brief FREQM [HSFLL_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;                              /*!< (@ 0x00000000) Frequency measurement done status                     */
  __IM  uint32_t  ERROR;                             /*!< (@ 0x00000004) Frequency measurement error status                    */
  __IM  uint32_t  MEAS;                              /*!< (@ 0x00000008) Frequency measurement                                 */
} NRF_HSFLL_FREQM_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* HSFLL_FREQM_DONE: Frequency measurement done status */
  #define HSFLL_FREQM_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                        */

/* DONE @Bit 0 : Measurement done. */
  #define HSFLL_FREQM_DONE_DONE_Pos (0UL)            /*!< Position of DONE field.                                              */
  #define HSFLL_FREQM_DONE_DONE_Msk (0x1UL << HSFLL_FREQM_DONE_DONE_Pos) /*!< Bit mask of DONE field.                          */
  #define HSFLL_FREQM_DONE_DONE_Min (0x0UL)          /*!< Min enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_Max (0x1UL)          /*!< Max enumerator value of DONE field.                                  */
  #define HSFLL_FREQM_DONE_DONE_InProgress (0x0UL)   /*!< Frequency measurement is in progress.                                */
  #define HSFLL_FREQM_DONE_DONE_Completed (0x1UL)    /*!< Frequency measurement is completed.                                  */


/* HSFLL_FREQM_ERROR: Frequency measurement error status */
  #define HSFLL_FREQM_ERROR_ResetValue (0x00000000UL) /*!< Reset value of ERROR register.                                      */

/* ERROR @Bit 0 : Trim error status. */
  #define HSFLL_FREQM_ERROR_ERROR_Pos (0UL)          /*!< Position of ERROR field.                                             */
  #define HSFLL_FREQM_ERROR_ERROR_Msk (0x1UL << HSFLL_FREQM_ERROR_ERROR_Pos) /*!< Bit mask of ERROR field.                     */
  #define HSFLL_FREQM_ERROR_ERROR_Min (0x0UL)        /*!< Min enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_Max (0x1UL)        /*!< Max enumerator value of ERROR field.                                 */
  #define HSFLL_FREQM_ERROR_ERROR_OutsideLimit (0x1UL) /*!< Frequency exceeded the accuracy 2 percent in closed loop mode.     */
  #define HSFLL_FREQM_ERROR_ERROR_WithinLimit (0x0UL) /*!< Frequency stayed within accuracy 2 percent in closed loop mode.     */

/* TRIMUNDERFLOW @Bit 1 : Underflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos (1UL)  /*!< Position of TRIMUNDERFLOW field.                                     */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos) /*!< Bit mask of TRIMUNDERFLOW
                                                                            field.*/
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Min (0x0UL) /*!< Min enumerator value of TRIMUNDERFLOW field.                        */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Max (0x1UL) /*!< Max enumerator value of TRIMUNDERFLOW field.                        */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_OutsideLimit (0x1UL) /*!< Underflow                                                  */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_WithinLimit (0x0UL) /*!< No underflow                                                */

/* TRIMOVERFLOW @Bit 2 : Overflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos (2UL)   /*!< Position of TRIMOVERFLOW field.                                      */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos) /*!< Bit mask of TRIMOVERFLOW field.*/
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Min (0x0UL) /*!< Min enumerator value of TRIMOVERFLOW field.                          */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Max (0x1UL) /*!< Max enumerator value of TRIMOVERFLOW field.                          */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_OutsideLimit (0x1UL) /*!< Overflow                                                    */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_WithinLimit (0x0UL) /*!< No overflow                                                  */


/* HSFLL_FREQM_MEAS: Frequency measurement */
  #define HSFLL_FREQM_MEAS_ResetValue (0x00000000UL) /*!< Reset value of MEAS register.                                        */

/* VALUE @Bits 0..7 : Last frequency measurement value. */
  #define HSFLL_FREQM_MEAS_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define HSFLL_FREQM_MEAS_VALUE_Msk (0xFFUL << HSFLL_FREQM_MEAS_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* ==================================================== Struct HSFLL_TRIM ==================================================== */
/**
  * @brief TRIM [HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VSUP;                              /*!< (@ 0x00000000) Internal regulator voltage supply level trimming      */
  __IOM uint32_t  COARSE;                            /*!< (@ 0x00000004) Coarse frequency trimming                             */
  __IOM uint32_t  FINE;                              /*!< (@ 0x00000008) Fine frequency trimming                               */
  __IM  uint32_t  RESERVED[2];
} NRF_HSFLL_TRIM_Type;                               /*!< Size = 20 (0x014)                                                    */

/* HSFLL_TRIM_VSUP: Internal regulator voltage supply level trimming */
  #define HSFLL_TRIM_VSUP_ResetValue (0x00000010UL)  /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..4 : Trim value */
  #define HSFLL_TRIM_VSUP_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_VSUP_VALUE_Msk (0x1FUL << HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                        */


/* HSFLL_TRIM_COARSE: Coarse frequency trimming */
  #define HSFLL_TRIM_COARSE_ResetValue (0x00000004UL) /*!< Reset value of COARSE register.                                     */

