tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* VALUE @Bits 0..9 : Coarse frequency trimming value. */
  #define HSFLL_TRIM_COARSE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_COARSE_VALUE_Msk (0x3FFUL << HSFLL_TRIM_COARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                   */


/* HSFLL_TRIM_FINE: Fine frequency trimming */
  #define HSFLL_TRIM_FINE_ResetValue (0x0000001EUL)  /*!< Reset value of FINE register.                                        */

/* VALUE @Bits 0..10 : Fine frequency trimming value */
  #define HSFLL_TRIM_FINE_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_FINE_VALUE_Msk (0x7FFUL << HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit mask of VALUE field.                       */



/* ================================================= Struct HSFLL_CLOCKCTRL ================================================== */
/**
  * @brief CLOCKCTRL [HSFLL_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Clock control                                         */
  __IOM uint32_t  DITHERING;                         /*!< (@ 0x00000004) Clock dithering configuration                         */
  __IOM uint32_t  MULT;                              /*!< (@ 0x00000008) Multiplication factor                                 */
  __IOM uint32_t  SLEEP;                             /*!< (@ 0x0000000C) Sleep configuration                                   */
  __IOM uint32_t  RETAINFINETRIM;                    /*!< (@ 0x00000010) Fine trim retain control                              */
  __IOM uint32_t  OVERRIDELOCKED;                    /*!< (@ 0x00000014) Override the LOCKED signal                            */
} NRF_HSFLL_CLOCKCTRL_Type;                          /*!< Size = 24 (0x018)                                                    */

/* HSFLL_CLOCKCTRL_MODE: Clock control */
  #define HSFLL_CLOCKCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                    */

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Pos (0UL)        /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Msk (0x3UL << HSFLL_CLOCKCTRL_MODE_MODE_Pos) /*!< Bit mask of MODE field.                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Min (0x0UL)      /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Max (0x3UL)      /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Auto (0x0UL)     /*!< The PCGC controls the mode automatically.                            */
  #define HSFLL_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL) /*!< Open loop mode.                                                      */
  #define HSFLL_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL) /*!< Closed loop mode.                                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Bypass (0x3UL)   /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : HSFLL override mode. */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos (4UL)    /*!< Position of OVERRIDE field.                                          */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.      */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Min (0x0UL)  /*!< Min enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Max (0x1UL)  /*!< Max enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                          */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                            */


/* HSFLL_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define HSFLL_CLOCKCTRL_DITHERING_ResetValue (0x00096733UL) /*!< Reset value of DITHERING register.                          */

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL) /*!< Position of CYCLECOUNT field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL) /*!< Position of MAXOFFSET field.                                      */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of MAXOFFSET
                                                                            field.*/

/* INITVALUE @Bits 8..19 : Initial value for the dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_INITVALUE_Pos (8UL) /*!< Position of INITVALUE field.                                      */
  #define HSFLL_CLOCKCTRL_DITHERING_INITVALUE_Msk (0xFFFUL << HSFLL_CLOCKCTRL_DITHERING_INITVALUE_Pos) /*!< Bit mask of
                                                                            INITVALUE field.*/

/* EN @Bit 31 : Enable the clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << HSFLL_CLOCKCTRL_DITHERING_EN_Pos) /*!< Bit mask of EN field.              */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL) /*!< Clock dithering is disabled                                       */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL) /*!< Clock dithering is enabled                                         */


/* HSFLL_CLOCKCTRL_MULT: Multiplication factor */
  #define HSFLL_CLOCKCTRL_MULT_ResetValue (0x00000006UL) /*!< Reset value of MULT register.                                    */

/* VAL @Bits 0..4 : Multiplication factor value. Valid range: 4 to 25. Output frequency is a multiplication of 16 MHz reference
                    and the multiplication factor. */

  #define HSFLL_CLOCKCTRL_MULT_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_CLOCKCTRL_MULT_VAL_Msk (0x1FUL << HSFLL_CLOCKCTRL_MULT_VAL_Pos) /*!< Bit mask of VAL field.                    */


