tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* HSFLL_CLOCKCTRL_SLEEP: Sleep configuration */
  #define HSFLL_CLOCKCTRL_SLEEP_ResetValue (0x00000001UL) /*!< Reset value of SLEEP register.                                  */

/* MODE @Bit 0 : HSFLL sleep mode. */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Pos (0UL)       /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Max (0x1UL)     /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Normal (0x0UL)  /*!< Normal mode operation                                                */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Sleep (0x1UL)   /*!< Power down the HSFLL core                                            */

/* RETAIN @Bit 1 : Retain. */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos (1UL)     /*!< Position of RETAIN field.                                            */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos) /*!< Bit mask of RETAIN field.          */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Min (0x0UL)   /*!< Min enumerator value of RETAIN field.                                */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Max (0x1UL)   /*!< Max enumerator value of RETAIN field.                                */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Disabled (0x0UL) /*!< No retention while powered down                                   */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Enabled (0x1UL) /*!< Retain all inputs while powered down                               */


/* HSFLL_CLOCKCTRL_RETAINFINETRIM: Fine trim retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_ResetValue (0x00000000UL) /*!< Reset value of RETAINFINETRIM register.                */

/* RETAIN @Bit 0 : Retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos (0UL) /*!< Position of RETAIN field.                                       */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos) /*!< Bit mask of RETAIN
                                                                            field.*/
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Min (0x0UL) /*!< Min enumerator value of RETAIN field.                         */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Max (0x1UL) /*!< Max enumerator value of RETAIN field.                         */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_NoRetain (0x0UL) /*!< No retain.                                               */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Retain (0x1UL) /*!< Retain control when HSFLL goes to open-loop mode.          */


/* HSFLL_CLOCKCTRL_OVERRIDELOCKED: Override the LOCKED signal */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDELOCKED register.                */

/* OVERRIDE @Bit 0 : Override */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos (0UL) /*!< Position of OVERRIDE field.                                   */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos) /*!< Bit mask of
                                                                            OVERRIDE field.*/
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Min (0x0UL) /*!< Min enumerator value of OVERRIDE field.                     */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Max (0x1UL) /*!< Max enumerator value of OVERRIDE field.                     */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_NoOperation (0x0UL) /*!< No Operation.                                       */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Override (0x1UL) /*!< Override                                               */


/* ====================================================== Struct HSFLL ======================================================= */
/**
  * @brief HSFLL
  */
  typedef struct {                                   /*!< HSFLL Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the HSFLL                                       */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the HSFLL                                        */
    __IM uint32_t RESERVED[2];
    __OM uint32_t TASKS_FREQMEAS;                    /*!< (@ 0x00000010) Start frequency measurement in software-controlled
                                                                         mode*/
    __OM uint32_t TASKS_FREQCHANGE;                  /*!< (@ 0x00000014) Trigger frequency change                              */
    __IM uint32_t RESERVED1[58];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) HSFLL started                                         */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) HSFLL stopped                                         */
    __IM uint32_t RESERVED2;
    __IOM uint32_t EVENTS_FREQMDONE;                 /*!< (@ 0x0000010C) Frequency measurement done                            */
    __IOM uint32_t EVENTS_FREQCHANGED;               /*!< (@ 0x00000110) Frequency change done                                 */
    __IM uint32_t RESERVED3[187];
    __IM uint32_t CLOCKSTATUS;                       /*!< (@ 0x00000400) Clock status                                          */
    __IM uint32_t RESERVED4[7];
    __IOM NRF_HSFLL_FREQM_Type FREQM;                /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED5[5];
    __IOM NRF_HSFLL_TRIM_Type TRIM;                  /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED6[3];
    __IOM NRF_HSFLL_CLOCKCTRL_Type CLOCKCTRL;        /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
  } NRF_HSFLL_Type;                                  /*!< Size = 1156 (0x484)                                                  */

/* HSFLL_TASKS_START: Start the HSFLL */
  #define HSFLL_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the HSFLL */
  #define HSFLL_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define HSFLL_TASKS_START_TASKS_START_Msk (0x1UL << HSFLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define HSFLL_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define HSFLL_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define HSFLL_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* HSFLL_TASKS_STOP: Stop the HSFLL */
  #define HSFLL_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

