tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TASKS_STOP @Bit 0 : Stop the HSFLL */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << HSFLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* HSFLL_TASKS_FREQMEAS: Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQMEAS register.                          */

/* TASKS_FREQMEAS @Bit 0 : Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos (0UL) /*!< Position of TASKS_FREQMEAS field.                                 */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Msk (0x1UL << HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos) /*!< Bit mask of
                                                                            TASKS_FREQMEAS field.*/
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQMEAS field.                   */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQMEAS field.                   */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Trigger (0x1UL) /*!< Trigger task                                                */


/* HSFLL_TASKS_FREQCHANGE: Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQCHANGE register.                      */

/* TASKS_FREQCHANGE @Bit 0 : Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos (0UL) /*!< Position of TASKS_FREQCHANGE field.                           */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Msk (0x1UL << HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQCHANGE field.*/
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Trigger (0x1UL) /*!< Trigger task                                            */


/* HSFLL_EVENTS_STARTED: HSFLL started */
  #define HSFLL_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : HSFLL started */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* HSFLL_EVENTS_STOPPED: HSFLL stopped */
  #define HSFLL_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                          */

/* EVENTS_STOPPED @Bit 0 : HSFLL stopped */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                 */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                   */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                   */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                           */


/* HSFLL_EVENTS_FREQMDONE: Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQMDONE register.                      */

/* EVENTS_FREQMDONE @Bit 0 : Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos (0UL) /*!< Position of EVENTS_FREQMDONE field.                           */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Msk (0x1UL << HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_FREQMDONE field.*/
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQMDONE field.             */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQMDONE field.             */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Generated (0x1UL) /*!< Event generated                                       */


/* HSFLL_EVENTS_FREQCHANGED: Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQCHANGED register.                  */

/* EVENTS_FREQCHANGED @Bit 0 : Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos (0UL) /*!< Position of EVENTS_FREQCHANGED field.                     */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Msk (0x1UL << HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos) /*!< Bit
                                                                            mask of EVENTS_FREQCHANGED field.*/
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Generated (0x1UL) /*!< Event generated                                   */


