tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* HSFLL_CLOCKSTATUS: Clock status */
  #define HSFLL_CLOCKSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSTATUS register.                                */

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKSTATUS_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKSTATUS_MODE_Msk (0x3UL << HSFLL_CLOCKSTATUS_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define HSFLL_CLOCKSTATUS_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_Max (0x2UL)         /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_OpenLoop (0x0UL)    /*!< Open loop mode.                                                      */
  #define HSFLL_CLOCKSTATUS_MODE_ClosedLoop (0x1UL)  /*!< Closed loop mode.                                                    */
  #define HSFLL_CLOCKSTATUS_MODE_Bypass (0x2UL)      /*!< Bypass mode.                                                         */

/* OVERRIDE @Bit 4 : HSFLL Override mode. */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Pos (4UL)       /*!< Position of OVERRIDE field.                                          */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKSTATUS_OVERRIDE_Pos) /*!< Bit mask of OVERRIDE field.            */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Min (0x0UL)     /*!< Min enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Max (0x1UL)     /*!< Max enumerator value of OVERRIDE field.                              */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Disabled (0x0UL) /*!< Override mode disabled.                                             */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Enabled (0x1UL) /*!< Override mode enabled.                                               */

/* ACCURACY @Bit 9 : Clock accuracy. */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Pos (9UL)       /*!< Position of ACCURACY field.                                          */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Msk (0x1UL << HSFLL_CLOCKSTATUS_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Min (0x0UL)     /*!< Min enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Max (0x1UL)     /*!< Max enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_OutsideLimit (0x0UL) /*!< Clock accuracy is outside 2 percent.                            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_WithinLimit (0x1UL) /*!< Clock accuracy is within 2 percent.                              */

/* LOCKED @Bit 10 : The HSFLL lock status. */
  #define HSFLL_CLOCKSTATUS_LOCKED_Pos (10UL)        /*!< Position of LOCKED field.                                            */
  #define HSFLL_CLOCKSTATUS_LOCKED_Msk (0x1UL << HSFLL_CLOCKSTATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                  */
  #define HSFLL_CLOCKSTATUS_LOCKED_Min (0x0UL)       /*!< Min enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_Max (0x1UL)       /*!< Max enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_NotLocked (0x0UL) /*!< Not locked to reference clock                                        */
  #define HSFLL_CLOCKSTATUS_LOCKED_Locked (0x1UL)    /*!< Locked to reference clock.                                           */


/* HSFLL_MIRROR: Enable LOCK for mirrored registers */
  #define HSFLL_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HSFLL_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define HSFLL_MIRROR_LOCK_Msk (0x1UL << HSFLL_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define HSFLL_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I2S                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct I2S_CONFIG ==================================================== */
/**
  * @brief CONFIG [I2S_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) I2S mode                                              */
  __IOM uint32_t  RXEN;                              /*!< (@ 0x00000004) Reception (RX) enable                                 */
  __IOM uint32_t  TXEN;                              /*!< (@ 0x00000008) Transmission (TX) enable                              */
  __IOM uint32_t  MCKEN;                             /*!< (@ 0x0000000C) Master clock generator enable                         */
  __IOM uint32_t  MCKFREQ;                           /*!< (@ 0x00000010) I2S clock generator control                           */
  __IOM uint32_t  RATIO;                             /*!< (@ 0x00000014) MCK / LRCK ratio                                      */
  __IOM uint32_t  SWIDTH;                            /*!< (@ 0x00000018) Sample width                                          */
  __IOM uint32_t  ALIGN;                             /*!< (@ 0x0000001C) Alignment of sample within a frame                    */
  __IOM uint32_t  FORMAT;                            /*!< (@ 0x00000020) Frame format                                          */
  __IOM uint32_t  CHANNELS;                          /*!< (@ 0x00000024) Enable channels                                       */
  __IOM uint32_t  CLKCONFIG;                         /*!< (@ 0x00000028) Clock source selection for the I2S module             */
} NRF_I2S_CONFIG_Type;                               /*!< Size = 44 (0x02C)                                                    */

/* I2S_CONFIG_MODE: I2S mode */
  #define I2S_CONFIG_MODE_ResetValue (0x00000000UL)  /*!< Reset value of MODE register.                                        */

