tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* I2S_CONFIG_CLKCONFIG: Clock source selection for the I2S module */
  #define I2S_CONFIG_CLKCONFIG_ResetValue (0x00000000UL) /*!< Reset value of CLKCONFIG register.                               */

/* CLKSRC @Bit 0 : Clock source selection */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Pos (0UL)      /*!< Position of CLKSRC field.                                            */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_CLKSRC_Pos) /*!< Bit mask of CLKSRC field.            */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Min (0x0UL)    /*!< Min enumerator value of CLKSRC field.                                */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Max (0x1UL)    /*!< Max enumerator value of CLKSRC field.                                */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_PCLK32M (0x0UL) /*!< 32MHz peripheral clock                                              */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_ACLK (0x1UL)   /*!< Audio PLL clock                                                      */

/* BYPASS @Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no
                   effect. */

  #define I2S_CONFIG_CLKCONFIG_BYPASS_Pos (8UL)      /*!< Position of BYPASS field.                                            */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_BYPASS_Pos) /*!< Bit mask of BYPASS field.            */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Min (0x0UL)    /*!< Min enumerator value of BYPASS field.                                */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Max (0x1UL)    /*!< Max enumerator value of BYPASS field.                                */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Disable (0x0UL) /*!< Disable bypass                                                      */
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Enable (0x1UL) /*!< Enable bypass                                                        */



/* ===================================================== Struct I2S_RXD ====================================================== */
/**
  * @brief RXD [I2S_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Receive buffer RAM start address.                     */
} NRF_I2S_RXD_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* I2S_RXD_PTR: Receive buffer RAM start address. */
  #define I2S_RXD_PTR_ResetValue (0x00000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Receive buffer Data RAM start address. When receiving, words containing samples will be written to this
                     address. This address is a word aligned Data RAM address. */

  #define I2S_RXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define I2S_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */



/* ===================================================== Struct I2S_TXD ====================================================== */
/**
  * @brief TXD [I2S_TXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Transmit buffer RAM start address                     */
} NRF_I2S_TXD_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* I2S_TXD_PTR: Transmit buffer RAM start address */
  #define I2S_TXD_PTR_ResetValue (0x00000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from
                     this address. This address is a word aligned Data RAM address. */

  #define I2S_TXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define I2S_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */



/* ==================================================== Struct I2S_RXTXD ===================================================== */
/**
  * @brief RXTXD [I2S_RXTXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000000) Size of RXD and TXD buffers                           */
  __IM  uint32_t  RESERVED;
} NRF_I2S_RXTXD_Type;                                /*!< Size = 8 (0x008)                                                     */

/* I2S_RXTXD_MAXCNT: Size of RXD and TXD buffers */
  #define I2S_RXTXD_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..13 : Size of RXD and TXD buffers in number of 32 bit words */
  #define I2S_RXTXD_MAXCNT_MAXCNT_Pos (0UL)          /*!< Position of MAXCNT field.                                            */
  #define I2S_RXTXD_MAXCNT_MAXCNT_Msk (0x3FFFUL << I2S_RXTXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                 */



/* ===================================================== Struct I2S_PSEL ===================================================== */
/**
  * @brief PSEL [I2S_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;                               /*!< (@ 0x00000000) Pin select for MCK signal                             */
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000004) Pin select for SCK signal                             */
  __IOM uint32_t  LRCK;                              /*!< (@ 0x00000008) Pin select for LRCK signal                            */
  __IOM uint32_t  SDIN;                              /*!< (@ 0x0000000C) Pin select for SDIN signal                            */
  __IOM uint32_t  SDOUT;                             /*!< (@ 0x00000010) Pin select for SDOUT signal                           */
} NRF_I2S_PSEL_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* I2S_PSEL_MCK: Pin select for MCK signal */
  #define I2S_PSEL_MCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of MCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_MCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define I2S_PSEL_MCK_PIN_Msk (0x1FUL << I2S_PSEL_MCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define I2S_PSEL_MCK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_MCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_MCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define I2S_PSEL_MCK_PORT_Msk (0xFUL << I2S_PSEL_MCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define I2S_PSEL_MCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_MCK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_MCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_MCK_CONNECT_Msk (0x1UL << I2S_PSEL_MCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define I2S_PSEL_MCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_MCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_MCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define I2S_PSEL_MCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* I2S_PSEL_SCK: Pin select for SCK signal */
  #define I2S_PSEL_SCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SCK_PIN_Msk (0x1FUL << I2S_PSEL_SCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define I2S_PSEL_SCK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SCK_PORT_Msk (0xFUL << I2S_PSEL_SCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define I2S_PSEL_SCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SCK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SCK_CONNECT_Msk (0x1UL << I2S_PSEL_SCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define I2S_PSEL_SCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define I2S_PSEL_SCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* I2S_PSEL_LRCK: Pin select for LRCK signal */
  #define I2S_PSEL_LRCK_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of LRCK register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_LRCK_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define I2S_PSEL_LRCK_PIN_Msk (0x1FUL << I2S_PSEL_LRCK_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define I2S_PSEL_LRCK_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_LRCK_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_LRCK_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define I2S_PSEL_LRCK_PORT_Msk (0xFUL << I2S_PSEL_LRCK_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define I2S_PSEL_LRCK_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_LRCK_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_LRCK_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_LRCK_CONNECT_Msk (0x1UL << I2S_PSEL_LRCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define I2S_PSEL_LRCK_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_LRCK_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_LRCK_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define I2S_PSEL_LRCK_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* I2S_PSEL_SDIN: Pin select for SDIN signal */
  #define I2S_PSEL_SDIN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SDIN register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDIN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SDIN_PIN_Msk (0x1FUL << I2S_PSEL_SDIN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define I2S_PSEL_SDIN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SDIN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDIN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SDIN_PORT_Msk (0xFUL << I2S_PSEL_SDIN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define I2S_PSEL_SDIN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SDIN_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDIN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SDIN_CONNECT_Msk (0x1UL << I2S_PSEL_SDIN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define I2S_PSEL_SDIN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDIN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDIN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define I2S_PSEL_SDIN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* I2S_PSEL_SDOUT: Pin select for SDOUT signal */
  #define I2S_PSEL_SDOUT_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of SDOUT register.                                       */

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDOUT_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define I2S_PSEL_SDOUT_PIN_Msk (0x1FUL << I2S_PSEL_SDOUT_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define I2S_PSEL_SDOUT_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define I2S_PSEL_SDOUT_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDOUT_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define I2S_PSEL_SDOUT_PORT_Msk (0xFUL << I2S_PSEL_SDOUT_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define I2S_PSEL_SDOUT_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define I2S_PSEL_SDOUT_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDOUT_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define I2S_PSEL_SDOUT_CONNECT_Msk (0x1UL << I2S_PSEL_SDOUT_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define I2S_PSEL_SDOUT_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDOUT_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define I2S_PSEL_SDOUT_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define I2S_PSEL_SDOUT_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* ======================================================= Struct I2S ======================================================== */
/**
  * @brief Inter-IC Sound
  */
  typedef struct {                                   /*!< I2S Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous I2S transfer. Also starts MCK
                                                                         generator when this is enabled*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops I2S transfer and MCK generator. Triggering this
                                                                         task will cause the event STOPPED to be generated.*/
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and RX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words received on the SDIN pin.*/
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) I2S transfer stopped.                                 */
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000114) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and TX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words that are sent on the SDOUT pin.*/
    __IM uint32_t RESERVED3;
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x0000011C) Frame start event, generated on the active edge of
                                                                         LRCK*/
    __IM uint32_t RESERVED4[25];
    __IOM uint32_t PUBLISH_RXPTRUPD;                 /*!< (@ 0x00000184) Publish configuration for event RXPTRUPD              */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t PUBLISH_TXPTRUPD;                 /*!< (@ 0x00000194) Publish configuration for event TXPTRUPD              */
    __IM uint32_t RESERVED6;
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x0000019C) Publish configuration for event FRAMESTART            */
    __IM uint32_t RESERVED7[88];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED8[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable I2S module                                     */
    __IOM NRF_I2S_CONFIG_Type CONFIG;                /*!< (@ 0x00000504) (unspecified)                                         */
    __IM uint32_t RESERVED9[2];
    __IOM NRF_I2S_RXD_Type RXD;                      /*!< (@ 0x00000538) (unspecified)                                         */
    __IM uint32_t RESERVED10;
    __IOM NRF_I2S_TXD_Type TXD;                      /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED11[3];
    __IOM NRF_I2S_RXTXD_Type RXTXD;                  /*!< (@ 0x00000550) (unspecified)                                         */
    __IM uint32_t RESERVED12[2];
    __IOM NRF_I2S_PSEL_Type PSEL;                    /*!< (@ 0x00000560) (unspecified)                                         */
  } NRF_I2S_Type;                                    /*!< Size = 1396 (0x574)                                                  */

/* I2S_TASKS_START: Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
  #define I2S_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

