tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define I2S_INTENCLR_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTENCLR_RXPTRUPD_Msk (0x1UL << I2S_INTENCLR_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define I2S_INTENCLR_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENCLR_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENCLR_RXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define I2S_INTENCLR_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define I2S_INTENCLR_STOPPED_Msk (0x1UL << I2S_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define I2S_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define I2S_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 5 : Write '1' to disable interrupt for event TXPTRUPD */
  #define I2S_INTENCLR_TXPTRUPD_Pos (5UL)            /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTENCLR_TXPTRUPD_Msk (0x1UL << I2S_INTENCLR_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define I2S_INTENCLR_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENCLR_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENCLR_TXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define I2S_INTENCLR_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* FRAMESTART @Bit 7 : Write '1' to disable interrupt for event FRAMESTART */
  #define I2S_INTENCLR_FRAMESTART_Pos (7UL)          /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTENCLR_FRAMESTART_Msk (0x1UL << I2S_INTENCLR_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                */
  #define I2S_INTENCLR_FRAMESTART_Min (0x0UL)        /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTENCLR_FRAMESTART_Max (0x1UL)        /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTENCLR_FRAMESTART_Clear (0x1UL)      /*!< Disable                                                              */
  #define I2S_INTENCLR_FRAMESTART_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENCLR_FRAMESTART_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* I2S_ENABLE: Enable I2S module */
  #define I2S_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable I2S module */
  #define I2S_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define I2S_ENABLE_ENABLE_Msk (0x1UL << I2S_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define I2S_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define I2S_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct I3C_CDR ====================================================== */
/**
  * @brief CDR [I3C_CDR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STARTOFFSET;                       /*!< (@ 0x00000000) Start offset of recovered clock                       */
  __IOM uint32_t  MAXCYCLERATIO;                     /*!< (@ 0x00000004) Maximum cycle ratio between SDA/SCL and CDR (clock and
                                                                         data recovery) clock*/
  __IOM uint32_t  MAXSKEW;                           /*!< (@ 0x00000008) Maximum skew between SCL and SCL in CDR clock cycles  */
} NRF_I3C_CDR_Type;                                  /*!< Size = 12 (0x00C)                                                    */

/* I3C_CDR_STARTOFFSET: Start offset of recovered clock */
  #define I3C_CDR_STARTOFFSET_ResetValue (0x00000004UL) /*!< Reset value of STARTOFFSET register.                              */

