tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MODEI2C @Bit 0 : I2C or I3C mode select signal */
  #define I3C_SLAVEIF0_MODEI2C_Pos (0UL)             /*!< Position of MODEI2C field.                                           */
  #define I3C_SLAVEIF0_MODEI2C_Msk (0x1UL << I3C_SLAVEIF0_MODEI2C_Pos) /*!< Bit mask of MODEI2C field.                         */
  #define I3C_SLAVEIF0_MODEI2C_Min (0x0UL)           /*!< Min enumerator value of MODEI2C field.                               */
  #define I3C_SLAVEIF0_MODEI2C_Max (0x1UL)           /*!< Max enumerator value of MODEI2C field.                               */
  #define I3C_SLAVEIF0_MODEI2C_DISABLED (0x0UL)      /*!< (unspecified)                                                        */
  #define I3C_SLAVEIF0_MODEI2C_ENABLED (0x1UL)       /*!< (unspecified)                                                        */

/* ACTMODE @Bits 1..2 : Slave activity mode for GETSTATUS CCC */
  #define I3C_SLAVEIF0_ACTMODE_Pos (1UL)             /*!< Position of ACTMODE field.                                           */
  #define I3C_SLAVEIF0_ACTMODE_Msk (0x3UL << I3C_SLAVEIF0_ACTMODE_Pos) /*!< Bit mask of ACTMODE field.                         */

/* PENDINGINT @Bits 3..6 : Pending interrupt information for GETSTATUS CCC */
  #define I3C_SLAVEIF0_PENDINGINT_Pos (3UL)          /*!< Position of PENDINGINT field.                                        */
  #define I3C_SLAVEIF0_PENDINGINT_Msk (0xFUL << I3C_SLAVEIF0_PENDINGINT_Pos) /*!< Bit mask of PENDINGINT field.                */

/* STATICADDREN @Bit 7 : Slave static address valid */
  #define I3C_SLAVEIF0_STATICADDREN_Pos (7UL)        /*!< Position of STATICADDREN field.                                      */
  #define I3C_SLAVEIF0_STATICADDREN_Msk (0x1UL << I3C_SLAVEIF0_STATICADDREN_Pos) /*!< Bit mask of STATICADDREN field.          */
  #define I3C_SLAVEIF0_STATICADDREN_Min (0x0UL)      /*!< Min enumerator value of STATICADDREN field.                          */
  #define I3C_SLAVEIF0_STATICADDREN_Max (0x1UL)      /*!< Max enumerator value of STATICADDREN field.                          */
  #define I3C_SLAVEIF0_STATICADDREN_DISABLED (0x0UL) /*!< (unspecified)                                                        */
  #define I3C_SLAVEIF0_STATICADDREN_ENABLED (0x1UL)  /*!< (unspecified)                                                        */

/* STATICADDR @Bits 8..14 : Slave static address */
  #define I3C_SLAVEIF0_STATICADDR_Pos (8UL)          /*!< Position of STATICADDR field.                                        */
  #define I3C_SLAVEIF0_STATICADDR_Msk (0x7FUL << I3C_SLAVEIF0_STATICADDR_Pos) /*!< Bit mask of STATICADDR field.               */

/* SLAVEMAXRDSPEED @Bits 15..17 : Slave maximum read data rate */
  #define I3C_SLAVEIF0_SLAVEMAXRDSPEED_Pos (15UL)    /*!< Position of SLAVEMAXRDSPEED field.                                   */
  #define I3C_SLAVEIF0_SLAVEMAXRDSPEED_Msk (0x7UL << I3C_SLAVEIF0_SLAVEMAXRDSPEED_Pos) /*!< Bit mask of SLAVEMAXRDSPEED field. */

/* SLAVEMAXWRSPEED @Bits 18..20 : Slave maximum write write rate */
  #define I3C_SLAVEIF0_SLAVEMAXWRSPEED_Pos (18UL)    /*!< Position of SLAVEMAXWRSPEED field.                                   */
  #define I3C_SLAVEIF0_SLAVEMAXWRSPEED_Msk (0x7UL << I3C_SLAVEIF0_SLAVEMAXWRSPEED_Pos) /*!< Bit mask of SLAVEMAXWRSPEED field. */

/* SLAVECLKDATATURNTIME @Bits 21..23 : Slave maximum clock data turnaround time */
  #define I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Pos (21UL) /*!< Position of SLAVECLKDATATURNTIME field.                            */
  #define I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Msk (0x7UL << I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Pos) /*!< Bit mask of
                                                                            SLAVECLKDATATURNTIME field.*/

/* SLAVEDCR @Bits 24..31 : Device Characteristic Register value */
  #define I3C_SLAVEIF0_SLAVEDCR_Pos (24UL)           /*!< Position of SLAVEDCR field.                                          */
  #define I3C_SLAVEIF0_SLAVEDCR_Msk (0xFFUL << I3C_SLAVEIF0_SLAVEDCR_Pos) /*!< Bit mask of SLAVEDCR field.                     */


/* I3C_SLAVEIF1: I3C slave interface 1 */
  #define I3C_SLAVEIF1_ResetValue (0x00000000UL)     /*!< Reset value of SLAVEIF1 register.                                    */

/* WAKEUP @Bit 0 : Slave wakeup signal */
  #define I3C_SLAVEIF1_WAKEUP_Pos (0UL)              /*!< Position of WAKEUP field.                                            */
  #define I3C_SLAVEIF1_WAKEUP_Msk (0x1UL << I3C_SLAVEIF1_WAKEUP_Pos) /*!< Bit mask of WAKEUP field.                            */
  #define I3C_SLAVEIF1_WAKEUP_Min (0x0UL)            /*!< Min enumerator value of WAKEUP field.                                */
  #define I3C_SLAVEIF1_WAKEUP_Max (0x1UL)            /*!< Max enumerator value of WAKEUP field.                                */
  #define I3C_SLAVEIF1_WAKEUP_DISABLED (0x0UL)       /*!< (unspecified)                                                        */
  #define I3C_SLAVEIF1_WAKEUP_ENABLED (0x1UL)        /*!< (unspecified)                                                        */


/* I3C_SLAVEPID0: Slave Device Provisioned ID 0 */
  #define I3C_SLAVEPID0_ResetValue (0x00000000UL)    /*!< Reset value of SLAVEPID0 register.                                   */

/* ADDMEANING @Bits 0..11 : Additional Meaning */
  #define I3C_SLAVEPID0_ADDMEANING_Pos (0UL)         /*!< Position of ADDMEANING field.                                        */
  #define I3C_SLAVEPID0_ADDMEANING_Msk (0xFFFUL << I3C_SLAVEPID0_ADDMEANING_Pos) /*!< Bit mask of ADDMEANING field.            */

/* INSTANCEID @Bits 12..15 : Instance ID */
  #define I3C_SLAVEPID0_INSTANCEID_Pos (12UL)        /*!< Position of INSTANCEID field.                                        */
  #define I3C_SLAVEPID0_INSTANCEID_Msk (0xFUL << I3C_SLAVEPID0_INSTANCEID_Pos) /*!< Bit mask of INSTANCEID field.              */

/* PARTID @Bits 16..31 : Part ID */
  #define I3C_SLAVEPID0_PARTID_Pos (16UL)            /*!< Position of PARTID field.                                            */
  #define I3C_SLAVEPID0_PARTID_Msk (0xFFFFUL << I3C_SLAVEPID0_PARTID_Pos) /*!< Bit mask of PARTID field.                       */


