tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* STATICADDR @Bits 0..6 : Device Static Address. */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDR_Pos (0UL) /*!< Position of STATICADDR field.                                      */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVICEADDR_STATICADDR_Pos) /*!< Bit mask of STATICADDR
                                                                            field.*/

/* STATICADDRVALID @Bit 15 : Static Address Valid. */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Pos (15UL) /*!< Position of STATICADDRVALID field.                           */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Msk (0x1UL << I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Pos) /*!< Bit mask of
                                                                            STATICADDRVALID field.*/
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Min (0x0UL) /*!< Min enumerator value of STATICADDRVALID field.              */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Max (0x1UL) /*!< Max enumerator value of STATICADDRVALID field.              */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_INVALID (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_VALID (0x1UL) /*!< (unspecified)                                             */

/* DYNAMICADDR @Bits 16..22 : Device Dynamic Address. */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Pos (16UL) /*!< Position of DYNAMICADDR field.                                   */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Pos) /*!< Bit mask of
                                                                            DYNAMICADDR field.*/

/* DYNAMICADDRVALID @Bit 31 : Dynamic Address Valid */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Pos (31UL) /*!< Position of DYNAMICADDRVALID field.                         */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Msk (0x1UL << I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Pos) /*!< Bit mask of
                                                                            DYNAMICADDRVALID field.*/
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Min (0x0UL) /*!< Min enumerator value of DYNAMICADDRVALID field.            */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Max (0x1UL) /*!< Max enumerator value of DYNAMICADDRVALID field.            */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_INVALID (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_VALID (0x1UL) /*!< (unspecified)                                            */


/* I3CCORE_CORE_HWCAPABILITY: Hardware Capability register */
  #define I3CCORE_CORE_HWCAPABILITY_ResetValue (0x000E187BUL) /*!< Reset value of HWCAPABILITY register.                       */

/* DEVICEROLECONFIG @Bits 0..2 : Reflects the IC_DEVICE_ROLE Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Pos (0UL) /*!< Position of DEVICEROLECONFIG field.                        */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Msk (0x7UL << I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Pos) /*!< Bit mask
                                                                            of DEVICEROLECONFIG field.*/
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Min (0x1UL) /*!< Min enumerator value of DEVICEROLECONFIG field.          */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Max (0x4UL) /*!< Max enumerator value of DEVICEROLECONFIG field.          */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_MASTER (0x1UL) /*!< Master Only                                           */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_PMASTERSLAVE (0x2UL) /*!< Programmable Master-Slave                       */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_SECONDARYMASTER (0x3UL) /*!< Secondary Master                             */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_SLAVE (0x4UL) /*!< Slave Only                                             */

/* HDRDDREN @Bit 3 : Reflects the IC_SPEED_HDR_DDR Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Pos (3UL) /*!< Position of HDRDDREN field.                                        */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Pos) /*!< Bit mask of HDRDDREN
                                                                            field.*/
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Min (0x0UL) /*!< Min enumerator value of HDRDDREN field.                          */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Max (0x1UL) /*!< Max enumerator value of HDRDDREN field.                          */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_NOTSUPPORTED (0x0UL) /*!< HDR-DDR not supported                                   */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_SUPPORTED (0x1UL) /*!< HDR-DDR supported                                          */

/* HDRTSEN @Bit 4 : Reflects the IC_SPEED_HDR_TS Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Pos (4UL) /*!< Position of HDRTSEN field.                                          */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Pos) /*!< Bit mask of HDRTSEN
                                                                            field.*/
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Min (0x0UL) /*!< Min enumerator value of HDRTSEN field.                            */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Max (0x1UL) /*!< Max enumerator value of HDRTSEN field.                            */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_NOTSUPPORTED (0x0UL) /*!< HDR-TS not supported                                     */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_SUPPORTED (0x1UL) /*!< HDR-TS supported                                            */

/* CLOCKPERIOD @Bits 5..10 : Reflects the IC_CLK_PERIOD Configurable Parameter */
  #define I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Pos (5UL) /*!< Position of CLOCKPERIOD field.                                  */
  #define I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Msk (0x3FUL << I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Pos) /*!< Bit mask of
                                                                            CLOCKPERIOD field.*/

/* HDRTXCLOCKPERIOD @Bits 11..16 : Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Pos (11UL) /*!< Position of HDRTXCLOCKPERIOD field.                       */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Msk (0x3FUL << I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Pos) /*!< Bit
                                                                            mask of HDRTXCLOCKPERIOD field.*/

/* DMAEN @Bit 17 : Reflects the IC_HAS_DMA Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_DMAEN_Pos (17UL) /*!< Position of DMAEN field.                                             */
  #define I3CCORE_CORE_HWCAPABILITY_DMAEN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_DMAEN_Pos) /*!< Bit mask of DMAEN field.     */

/* SLVHJCAP @Bit 18 : Reflects the IC_SLV_HJ Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Pos (18UL) /*!< Position of SLVHJCAP field.                                       */
  #define I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Pos) /*!< Bit mask of SLVHJCAP
                                                                            field.*/

/* SLVIBICAP @Bit 19 : Reflects the IC_SLV_IBI Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Pos (19UL) /*!< Position of SLVIBICAP field.                                     */
  #define I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Pos) /*!< Bit mask of SLVIBICAP
                                                                            field.*/


/* I3CCORE_CORE_COMMANDQUEUEPORT: Command Queue Port. */
  #define I3CCORE_CORE_COMMANDQUEUEPORT_ResetValue (0x00000000UL) /*!< Reset value of COMMANDQUEUEPORT register.               */

/* COMMAND @Bits 0..31 : 32 bit command */
  #define I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Pos (0UL) /*!< Position of COMMAND field.                                      */
  #define I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Msk (0xFFFFFFFFUL << I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Pos) /*!< Bit mask of
                                                                            COMMAND field.*/


/* I3CCORE_CORE_RESPONSEQUEUEPORT: Response Queue Port */
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_ResetValue (0x00000000UL) /*!< Reset value of RESPONSEQUEUEPORT register.             */

/* RESPONSE @Bits 0..31 : 32 bit Response */
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Pos (0UL) /*!< Position of RESPONSE field.                                   */
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Msk (0xFFFFFFFFUL << I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Pos) /*!< Bit
                                                                            mask of RESPONSE field.*/


/* I3CCORE_CORE_RXDATAPORT: Receive Data Port Register */
  #define I3CCORE_CORE_RXDATAPORT_ResetValue (0x00000000UL) /*!< Reset value of RXDATAPORT register.                           */

/* RXDATAPORT @Bits 0..31 : Receive Data Port. */
  #define I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Pos (0UL) /*!< Position of RXDATAPORT field.                                      */
  #define I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Pos) /*!< Bit mask of
                                                                            RXDATAPORT field.*/


/* I3CCORE_CORE_TXDATAPORT: Transmit Data Port Register */
  #define I3CCORE_CORE_TXDATAPORT_ResetValue (0x00000000UL) /*!< Reset value of TXDATAPORT register.                           */

/* TXDATAPORT @Bits 0..31 : Transmit Data Port */
  #define I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Pos (0UL) /*!< Position of TXDATAPORT field.                                      */
  #define I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Pos) /*!< Bit mask of
                                                                            TXDATAPORT field.*/


