tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SIRREQREJECT @Bits 0..31 : In-band Slave Interrupt Request Reject */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Pos (0UL) /*!< Position of SIRREQREJECT field.                             */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Pos) /*!< Bit
                                                                            mask of SIRREQREJECT field.*/
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Min (0x0UL) /*!< Min enumerator value of SIRREQREJECT field.               */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Max (0x1UL) /*!< Max enumerator value of SIRREQREJECT field.               */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_ACK (0x00000000UL) /*!< ACK the SIR Request.                               */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_NACK (0x00000001UL) /*!< NACK and send directed auto disable CCC.          */


/* I3CCORE_CORE_RESETCTRL: This Register is used for general software reset and for individual buffer reset. */
  #define I3CCORE_CORE_RESETCTRL_ResetValue (0x00000000UL) /*!< Reset value of RESETCTRL register.                             */

/* SOFTRST @Bit 0 : Core Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_SOFTRST_Pos (0UL)   /*!< Position of SOFTRST field.                                           */
  #define I3CCORE_CORE_RESETCTRL_SOFTRST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_SOFTRST_Pos) /*!< Bit mask of SOFTRST field.     */

/* CMDQUEUERST @Bit 1 : Command Queue Software Reset */
  #define I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Pos (1UL) /*!< Position of CMDQUEUERST field.                                     */
  #define I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Pos) /*!< Bit mask of CMDQUEUERST
                                                                            field.*/

/* RESPQUEUERST @Bit 2 : Response Queue Software Reset */
  #define I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Pos (2UL) /*!< Position of RESPQUEUERST field.                                   */
  #define I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Pos) /*!< Bit mask of
                                                                            RESPQUEUERST field.*/

/* TXFIFORST @Bit 3 : Transmit Buffer Software Reset */
  #define I3CCORE_CORE_RESETCTRL_TXFIFORST_Pos (3UL) /*!< Position of TXFIFORST field.                                         */
  #define I3CCORE_CORE_RESETCTRL_TXFIFORST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_TXFIFORST_Pos) /*!< Bit mask of TXFIFORST
                                                                            field.*/

/* RXFIFORST @Bit 4 : Receive Buffer Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_RXFIFORST_Pos (4UL) /*!< Position of RXFIFORST field.                                         */
  #define I3CCORE_CORE_RESETCTRL_RXFIFORST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_RXFIFORST_Pos) /*!< Bit mask of RXFIFORST
                                                                            field.*/

/* IBIQUEUERST @Bit 5 : IBI Queue Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Pos (5UL) /*!< Position of IBIQUEUERST field.                                     */
  #define I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Pos) /*!< Bit mask of IBIQUEUERST
                                                                            field.*/

/* BUSRESETTYPE @Bits 29..30 : Bus Reset type */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Pos (29UL) /*!< Position of BUSRESETTYPE field.                                  */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Msk (0x3UL << I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Pos) /*!< Bit mask of
                                                                            BUSRESETTYPE field.*/
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Min (0x0UL) /*!< Min enumerator value of BUSRESETTYPE field.                     */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Max (0x3UL) /*!< Max enumerator value of BUSRESETTYPE field.                     */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_EXIT (0x0UL) /*!< Exit Pattern.                                                  */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_SCL_LOW_RESET (0x3UL) /*!< SCL_LOW_RESET Pattern.                                */

/* BUSRESET @Bit 31 : Bus Reset. */
  #define I3CCORE_CORE_RESETCTRL_BUSRESET_Pos (31UL) /*!< Position of BUSRESET field.                                          */
  #define I3CCORE_CORE_RESETCTRL_BUSRESET_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_BUSRESET_Pos) /*!< Bit mask of BUSRESET field.  */


/* I3CCORE_CORE_SLVEVENTSTATUS: This register indicates the status/values of some events/controls that are relavant to slave
                                 mode of operation. */

  #define I3CCORE_CORE_SLVEVENTSTATUS_ResetValue (0x0000000BUL) /*!< Reset value of SLVEVENTSTATUS register.                   */

/* SIREN @Bit 0 : Slave Interrupt Request Enable. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Pos (0UL) /*!< Position of SIREN field.                                            */
  #define I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Pos) /*!< Bit mask of SIREN field. */

/* MREN @Bit 1 : Master Request Enable. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MREN_Pos (1UL) /*!< Position of MREN field.                                              */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MREN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MREN_Pos) /*!< Bit mask of MREN field.    */

/* HJEN @Bit 3 : Hot-Join Interrupt Enable */
  #define I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Pos (3UL) /*!< Position of HJEN field.                                              */
  #define I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Pos) /*!< Bit mask of HJEN field.    */

/* ACTIVITYSTATE @Bits 4..5 : Activity State Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Pos (4UL) /*!< Position of ACTIVITYSTATE field.                            */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Msk (0x3UL << I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Pos) /*!< Bit mask
                                                                            of ACTIVITYSTATE field.*/
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Min (0x0UL) /*!< Min enumerator value of ACTIVITYSTATE field.              */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Max (0x3UL) /*!< Max enumerator value of ACTIVITYSTATE field.              */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS0 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS1 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS2 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS3 (0x3UL) /*!< (unspecified)                                          */

/* MRLUPDATED @Bit 6 : MRL Updated Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Pos (6UL) /*!< Position of MRLUPDATED field.                                  */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Pos) /*!< Bit mask of
                                                                            MRLUPDATED field.*/

/* MWLUPDATED @Bit 7 : MWL Updated Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Pos (7UL) /*!< Position of MWLUPDATED field.                                  */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Pos) /*!< Bit mask of
                                                                            MWLUPDATED field.*/


/* I3CCORE_CORE_INTRSTATUS: Interrupt Status Register */
  #define I3CCORE_CORE_INTRSTATUS_ResetValue (0x00000000UL) /*!< Reset value of INTRSTATUS register.                           */

/* TXTHLDSTS @Bit 0 : Transmit Buffer Threshold Status */
  #define I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Pos (0UL) /*!< Position of TXTHLDSTS field.                                        */
  #define I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Pos) /*!< Bit mask of TXTHLDSTS
                                                                            field.*/

/* RXTHLDSTS @Bit 1 : Receive Buffer Threshold Status. */
  #define I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Pos (1UL) /*!< Position of RXTHLDSTS field.                                        */
  #define I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Pos) /*!< Bit mask of RXTHLDSTS
                                                                            field.*/

/* IBITHLDSTS @Bit 2 : IBI Buffer Threshold Status. */
  #define I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Pos (2UL) /*!< Position of IBITHLDSTS field.                                      */
  #define I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Pos) /*!< Bit mask of IBITHLDSTS
                                                                            field.*/

/* CMDQUEUEREADYSTS @Bit 3 : Command Queue Ready. */
  #define I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Pos (3UL) /*!< Position of CMDQUEUEREADYSTS field.                          */
  #define I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Pos) /*!< Bit mask of
                                                                            CMDQUEUEREADYSTS field.*/

/* RESPREADYSTS @Bit 4 : Response Queue Ready Status. */
  #define I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Pos (4UL) /*!< Position of RESPREADYSTS field.                                  */
  #define I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Pos) /*!< Bit mask of
                                                                            RESPREADYSTS field.*/

/* TRANSFERABORTSTS @Bit 5 : Transfer Abort Status. */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Pos (5UL) /*!< Position of TRANSFERABORTSTS field.                          */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Pos) /*!< Bit mask of
                                                                            TRANSFERABORTSTS field.*/

/* CCCUPDATEDSTS @Bit 6 : CCC Table Updated Status. */
  #define I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Pos (6UL) /*!< Position of CCCUPDATEDSTS field.                                */
  #define I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Pos) /*!< Bit mask of
                                                                            CCCUPDATEDSTS field.*/

/* DYNADDRASSGNSTS @Bit 8 : Dynamic Address Assigned Status. */
  #define I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Pos (8UL) /*!< Position of DYNADDRASSGNSTS field.                            */
  #define I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Pos) /*!< Bit mask of
                                                                            DYNADDRASSGNSTS field.*/

/* TRANSFERERRSTS @Bit 9 : Transfer Error Status. */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Pos (9UL) /*!< Position of TRANSFERERRSTS field.                              */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Pos) /*!< Bit mask of
                                                                            TRANSFERERRSTS field.*/

/* DEFSLVSTS @Bit 10 : Define Slave CCC Received Status. */
  #define I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Pos (10UL) /*!< Position of DEFSLVSTS field.                                       */
  #define I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Pos) /*!< Bit mask of DEFSLVSTS
                                                                            field.*/

