tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRANSFERABORTFORCEEN @Bit 5 : Transfer Abort Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Pos (5UL) /*!< Position of TRANSFERABORTFORCEEN field.                   */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TRANSFERABORTFORCEEN_Pos) /*!< Bit
                                                                            mask of TRANSFERABORTFORCEEN field.*/

/* CCCUPDATEDFORCEEN @Bit 6 : CCC Table Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Pos (6UL) /*!< Position of CCCUPDATEDFORCEEN field.                         */
  #define I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_CCCUPDATEDFORCEEN_Pos) /*!< Bit mask of
                                                                            CCCUPDATEDFORCEEN field.*/

/* DYNADDRASSGNFORCEEN @Bit 8 : Dynamic Address Assigned Force Enable */
  #define I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Pos (8UL) /*!< Position of DYNADDRASSGNFORCEEN field.                     */
  #define I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_DYNADDRASSGNFORCEEN_Pos) /*!< Bit mask
                                                                            of DYNADDRASSGNFORCEEN field.*/

/* TRANSFERERRFORCEEN @Bit 9 : Transfer Error Force Enable */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Pos (9UL) /*!< Position of TRANSFERERRFORCEEN field.                       */
  #define I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_TRANSFERERRFORCEEN_Pos) /*!< Bit mask
                                                                            of TRANSFERERRFORCEEN field.*/

/* DEFSLVFORCEEN @Bit 10 : Define Slave CCC Received Force Enable */
  #define I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Pos (10UL) /*!< Position of DEFSLVFORCEEN field.                                */
  #define I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_DEFSLVFORCEEN_Pos) /*!< Bit mask of
                                                                            DEFSLVFORCEEN field.*/

/* READREQFORCEEN @Bit 11 : Read Request Received Force Enable */
  #define I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Pos (11UL) /*!< Position of READREQFORCEEN field.                              */
  #define I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_READREQFORCEEN_Pos) /*!< Bit mask of
                                                                            READREQFORCEEN field.*/

/* IBIUPDATEDFORCEEN @Bit 12 : IBI Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Pos (12UL) /*!< Position of IBIUPDATEDFORCEEN field.                        */
  #define I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_IBIUPDATEDFORCEEN_Pos) /*!< Bit mask of
                                                                            IBIUPDATEDFORCEEN field.*/

/* BUSOWNERUPDATEDFORCEEN @Bit 13 : Bus owner Updated Force Enable */
  #define I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Pos (13UL) /*!< Position of BUSOWNERUPDATEDFORCEEN field.              */
  #define I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_BUSOWNERUPDATEDFORCEEN_Pos) /*!<
                                                                            Bit mask of BUSOWNERUPDATEDFORCEEN field.*/

/* BUSRESETDONEFORCEEN @Bit 15 : Bus Reset Pattern Generation Done Force Enable. */
  #define I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Pos (15UL) /*!< Position of BUSRESETDONEFORCEEN field.                    */
  #define I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Msk (0x1UL << I3CCORE_CORE_INTRFORCE_BUSRESETDONEFORCEEN_Pos) /*!< Bit mask
                                                                            of BUSRESETDONEFORCEEN field.*/


/* I3CCORE_CORE_QUEUESTATUSLEVEL: Queue Status Level Register. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_ResetValue (0x00000010UL) /*!< Reset value of QUEUESTATUSLEVEL register.               */

/* CMDQUEUEEMPTYLOC @Bits 0..7 : Command Queue Empty Locations. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Pos (0UL) /*!< Position of CMDQUEUEEMPTYLOC field.                    */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_CMDQUEUEEMPTYLOC_Pos) /*!<
                                                                            Bit mask of CMDQUEUEEMPTYLOC field.*/

/* RESPBUFBLR @Bits 8..15 : Response Buffer Level Value. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Pos (8UL) /*!< Position of RESPBUFBLR field.                                */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_RESPBUFBLR_Pos) /*!< Bit mask of
                                                                            RESPBUFBLR field.*/

/* IBIBUFBLR @Bits 16..23 : IBI Buffer Level Value. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Pos (16UL) /*!< Position of IBIBUFBLR field.                                 */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Msk (0xFFUL << I3CCORE_CORE_QUEUESTATUSLEVEL_IBIBUFBLR_Pos) /*!< Bit mask of
                                                                            IBIBUFBLR field.*/

/* IBISTSCNT @Bits 24..28 : IBI Buffer Status Count. */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Pos (24UL) /*!< Position of IBISTSCNT field.                                 */
  #define I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Msk (0x1FUL << I3CCORE_CORE_QUEUESTATUSLEVEL_IBISTSCNT_Pos) /*!< Bit mask of
                                                                            IBISTSCNT field.*/


/* I3CCORE_CORE_DATABUFFERSTATUSLEVEL: Data Buffer Status Level Register. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_ResetValue (0x00000040UL) /*!< Reset value of DATABUFFERSTATUSLEVEL register.     */

/* TXBUFEMPTYLOC @Bits 0..7 : Transmit Buffer Empty Level Value. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Pos (0UL) /*!< Position of TXBUFEMPTYLOC field.                     */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Msk (0xFFUL << I3CCORE_CORE_DATABUFFERSTATUSLEVEL_TXBUFEMPTYLOC_Pos)
                                                                            /*!< Bit mask of TXBUFEMPTYLOC field.*/

/* RXBUFBLR @Bits 16..23 : Receive Buffer Level Value. */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Pos (16UL) /*!< Position of RXBUFBLR field.                              */
  #define I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Msk (0xFFUL << I3CCORE_CORE_DATABUFFERSTATUSLEVEL_RXBUFBLR_Pos) /*!< Bit
                                                                            mask of RXBUFBLR field.*/


/* I3CCORE_CORE_PRESENTSTATEM: The user can get status of the DWC_mipi_i3c Controller from this 32-bit read only register
                                (Master). */

  #define I3CCORE_CORE_PRESENTSTATEM_ResetValue (0x10000003UL) /*!< Reset value of PRESENTSTATEM register.                     */

