tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SCLLINESIGNALLEVEL @Bit 0 : This bit is used to check the SCL line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Pos (0UL) /*!< Position of SCLLINESIGNALLEVEL field.                   */
  #define I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_SCLLINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SCLLINESIGNALLEVEL field.*/

/* SDALINESIGNALLEVEL @Bit 1 : This bit is used to check the SDA line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Pos (1UL) /*!< Position of SDALINESIGNALLEVEL field.                   */
  #define I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_SDALINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SDALINESIGNALLEVEL field.*/

/* CURRENTMASTER @Bit 2 : This Bit is used to check whether the Master is Current Master or not. */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Pos (2UL) /*!< Position of CURRENTMASTER field.                             */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Pos) /*!< Bit mask of
                                                                            CURRENTMASTER field.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Min (0x0UL) /*!< Min enumerator value of CURRENTMASTER field.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_Max (0x1UL) /*!< Max enumerator value of CURRENTMASTER field.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_NOT_BUS_OWNER (0x0UL) /*!< Master is not Current Master                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CURRENTMASTER_BUS_OWNER (0x1UL) /*!< Master is Current Master                             */

/* CMTFRSTS @Bits 8..13 : Transfer Type Status */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Pos (8UL) /*!< Position of CMTFRSTS field.                                       */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Pos) /*!< Bit mask of CMTFRSTS
                                                                            field.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Min (0x0UL) /*!< Min enumerator value of CMTFRSTS field.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_Max (0xFUL) /*!< Max enumerator value of CMTFRSTS field.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_IDLE (0x00UL) /*!< Controller is in Idle state, waiting for commands from
                                                                 application or Slave initated In-band Interrupt.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_BCCCWTRANSFER (0x01UL) /*!< Broadcast CCC Write Transfer.                        */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DCCCWTRANSFER (0x02UL) /*!< Directed CCC Write Transfer.                         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DCCCRTRANSFER (0x03UL) /*!< Directed CCC Read Transfer.                          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_ENTDAATRANSFER (0x04UL) /*!< ENTDAA Address Assignment Transfer.                 */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SETDASATRANSFER (0x05UL) /*!< SETDASA Address Assignment Transfer.               */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRWTRANSFER (0x06UL) /*!< Private I3C SDR Write Transfer.                       */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRRTRANSFER (0x07UL) /*!< Private I3C SDR Read Transfer.                        */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRWTRANSFERI2C (0x08UL) /*!< Private I2C SDR Write Transfer.                    */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_SDRRTRANSFERI2C (0x09UL) /*!< Private I2C SDR Read Transfer.                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_TSWTRANSFER (0x0AUL) /*!< Private HDR Ternary Symbol(TS) Write Transfer.         */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_TSRTRANSFER (0x0BUL) /*!< Private HDR Ternary Symbol(TS) Read Transfer.          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DDRWTRANSFER (0x0CUL) /*!< Private HDR Double-Data Rate(DDR) Write Transfer.     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_DDRRTRANSFER (0x0DUL) /*!< Private HDR Double-Data Rate(DDR) Read Transfer.      */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_IBITRANSFER (0x0EUL) /*!< Servicing In-Band Interrupt Transfer.                  */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTS_HALT (0x0FUL) /*!< Halt state. Controller is in Halt State, waiting for the
                                                                 application to resume through DEVICE_CTRL Register.*/

/* CMTFRSTSTS @Bits 16..21 : Current Master Transfer State Status. */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Pos (16UL) /*!< Position of CMTFRSTSTS field.                                  */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Pos) /*!< Bit mask of
                                                                            CMTFRSTSTS field.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Min (0x0UL) /*!< Min enumerator value of CMTFRSTSTS field.                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Max (0x13UL) /*!< Max enumerator value of CMTFRSTSTS field.                    */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_IDLE (0x00UL) /*!< Controller is Idle state, waiting for commands from
                                                                   application or Slave initated In-band Interrupt.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_START (0x01UL) /*!< START Generation State.                                    */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RESTART (0x02UL) /*!< RESTART Generation State.                                */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_STOP (0x03UL) /*!< STOP Genration State.                                       */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_STARTH (0x04UL) /*!< START Hold Generation for the Slave Initiated START State.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_BWADDRGEN (0x05UL) /*!< Broadcast Write Address Header(7h7E,W) Generation
                                                                        State.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_BRADDRGEN (0x06UL) /*!< Broadcast Read Address Header(7h7E,R) Generation State.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_DAA (0x07UL) /*!< Dynamic Address Assignment State.                            */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_ADDRGEN (0x08UL) /*!< Slave Address Generation State.                          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_CCCBYTEGEN (0x0BUL) /*!< CCC Byte Generation State.                            */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_HDRCMDGEN (0x0CUL) /*!< HDR Command Generation State.                          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_WTRANSFER (0x0DUL) /*!< Write Data Transfer State.                             */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RTRANSFER (0x0EUL) /*!< Read Data Transfer State.                              */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RIBI (0x0FUL) /*!< In-Band Interrupt(SIR) Read Data State.                     */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_IBIAUTODISABLE (0x10UL) /*!< In-Band Interrupt Auto-Disable State              */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_DDRCRCGEN (0x11UL) /*!< HDR-DDR CRC Data Generation/Receive State.             */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_CLKEXTEND (0x12UL) /*!< Clock Extension State.                                 */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_HALT (0x13UL) /*!< Halt State.                                                 */

/* CMDTID @Bits 24..27 : This field reflects the Transaction-ID of the current executing command. */
  #define I3CCORE_CORE_PRESENTSTATEM_CMDTID_Pos (24UL) /*!< Position of CMDTID field.                                          */
  #define I3CCORE_CORE_PRESENTSTATEM_CMDTID_Msk (0xFUL << I3CCORE_CORE_PRESENTSTATEM_CMDTID_Pos) /*!< Bit mask of CMDTID field.*/

