tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SIR @Bit 0 : Slave Interrupt Request */
  #define I3CCORE_CORE_SLVINTRREQ_SIR_Pos (0UL)      /*!< Position of SIR field.                                               */
  #define I3CCORE_CORE_SLVINTRREQ_SIR_Msk (0x1UL << I3CCORE_CORE_SLVINTRREQ_SIR_Pos) /*!< Bit mask of SIR field.               */

/* SIRCTRL @Bits 1..2 : Slave Interrupt Request Control */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Pos (1UL)  /*!< Position of SIRCTRL field.                                           */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Msk (0x3UL << I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Pos) /*!< Bit mask of SIRCTRL field.   */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Min (0x0UL) /*!< Min enumerator value of SIRCTRL field.                              */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Max (0x0UL) /*!< Max enumerator value of SIRCTRL field.                              */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_SEND (0x0UL) /*!< Send the Assigned Dynamic Address                                  */

/* MR @Bit 3 : Master Request */
  #define I3CCORE_CORE_SLVINTRREQ_MR_Pos (3UL)       /*!< Position of MR field.                                                */
  #define I3CCORE_CORE_SLVINTRREQ_MR_Msk (0x1UL << I3CCORE_CORE_SLVINTRREQ_MR_Pos) /*!< Bit mask of MR field.                  */

/* IBISTS @Bits 8..9 : IBI Completion Status */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Pos (8UL)   /*!< Position of IBISTS field.                                            */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Msk (0x3UL << I3CCORE_CORE_SLVINTRREQ_IBISTS_Pos) /*!< Bit mask of IBISTS field.      */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Min (0x1UL) /*!< Min enumerator value of IBISTS field.                                */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Max (0x3UL) /*!< Max enumerator value of IBISTS field.                                */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_ACCEPTED (0x1UL) /*!< IBI accepted by the Master (ACK response received)              */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_NOATTEMPT (0x3UL) /*!< IBI Not Attempted                                              */


/* I3CCORE_CORE_SLVTSXSYMBLTIMING: TSP/TSL Symbol Timing Register */
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_ResetValue (0x0000003FUL) /*!< Reset value of SLVTSXSYMBLTIMING register.             */

/* SLVTSXSYMBLCNT @Bits 0..5 : TSP/TSL Symbol Count Value. */
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Pos (0UL) /*!< Position of SLVTSXSYMBLCNT field.                       */
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Msk (0x3FUL << I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Pos) /*!<
                                                                            Bit mask of SLVTSXSYMBLCNT field.*/


/* I3CCORE_CORE_DEVICECTRLEXTENDED: Device Control Extended register. */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_ResetValue (0x00000000UL) /*!< Reset value of DEVICECTRLEXTENDED register.           */

/* DEVOPERATIONMODE @Bits 0..1 : This bit is used to select the Device Operation Mode before the controller is enabled. */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Pos (0UL) /*!< Position of DEVOPERATIONMODE field.                  */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Msk (0x3UL << I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Pos)
                                                                            /*!< Bit mask of DEVOPERATIONMODE field.*/
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Min (0x0UL) /*!< Min enumerator value of DEVOPERATIONMODE field.    */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Max (0x1UL) /*!< Max enumerator value of DEVOPERATIONMODE field.    */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_MASTER (0x0UL) /*!< (unspecified)                                   */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_SLAVE (0x1UL) /*!< (unspecified)                                    */

/* REQMSTACKCTRL @Bit 3 : In Slave mode of operation, this bit serves as a control to ACK/NACK GETACCMST CCC from current
                          master. */

  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Pos (3UL) /*!< Position of REQMSTACKCTRL field.                        */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Msk (0x1UL << I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Pos) /*!<
                                                                            Bit mask of REQMSTACKCTRL field.*/
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Min (0x0UL) /*!< Min enumerator value of REQMSTACKCTRL field.          */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Max (0x1UL) /*!< Max enumerator value of REQMSTACKCTRL field.          */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_ACK (0x0UL) /*!< ACK GETACCMST CCC                                     */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_NACK (0x1UL) /*!< NACK GETACCMST CCC                                   */


/* I3CCORE_CORE_SCLI3CODTIMING: SCL I3C Open Drain Timing Register */
  #define I3CCORE_CORE_SCLI3CODTIMING_ResetValue (0x000A0010UL) /*!< Reset value of SCLI3CODTIMING register.                   */

/* I3CODLCNT @Bits 0..7 : I3C Open Drain Low Count. */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Pos (0UL) /*!< Position of I3CODLCNT field.                                    */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Pos) /*!< Bit mask of
                                                                            I3CODLCNT field.*/

/* I3CODHCNT @Bits 16..23 : I3C Open Drain High Count. */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Pos (16UL) /*!< Position of I3CODHCNT field.                                   */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Pos) /*!< Bit mask of
                                                                            I3CODHCNT field.*/


