tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Pos (16UL) /*!< Position of SDATXHOLD field.                           */
  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Msk (0x7UL << I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Pos) /*!<
                                                                            Bit mask of SDATXHOLD field.*/


/* I3CCORE_CORE_BUSFREEAVAILTIMING: Bus Free and Available Timing Register */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_ResetValue (0x00200020UL) /*!< Reset value of BUSFREEAVAILTIMING register.           */

/* BUSFREETIME @Bits 0..15 : This register field is used only in Master mode of operation */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Pos (0UL) /*!< Position of BUSFREETIME field.                            */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Msk (0xFFFFUL << I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Pos) /*!< Bit
                                                                            mask of BUSFREETIME field.*/

/* BUSAVAILABLETIME @Bits 16..31 : This register field is used only in Slave mode of operation */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Pos (16UL) /*!< Position of BUSAVAILABLETIME field.                 */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Msk (0xFFFFUL << I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Pos)
                                                                            /*!< Bit mask of BUSAVAILABLETIME field.*/


/* I3CCORE_CORE_BUSIDLETIMING: Bus Idle Timing Register */
  #define I3CCORE_CORE_BUSIDLETIMING_ResetValue (0x00000020UL) /*!< Reset value of BUSIDLETIMING register.                     */

/* BUSIDLETIME @Bits 0..19 : Bus Idle Count Value. */
  #define I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Pos (0UL) /*!< Position of BUSIDLETIME field.                                 */
  #define I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Msk (0xFFFFFUL << I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Pos) /*!< Bit mask of
                                                                            BUSIDLETIME field.*/


/* I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT: The SCL Low Master Extended Timeout register is used to define the duration of the SCL Low
                                      Bus Reset Pattern. */

  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_ResetValue (0x003567E0UL) /*!< Reset value of SCLLOWMSTEXTTIMEOUT register.         */

/* SCLLOWMSTTIMEOUTCOUNT @Bits 0..25 : This count defines the number of core clock periods to count for generation of the SCL
                                       Low Bus Reset Pattern. */

  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Pos (0UL) /*!< Position of SCLLOWMSTTIMEOUTCOUNT field.       */
  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Msk (0x3FFFFFFUL << I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Pos)
                                                                            /*!< Bit mask of SCLLOWMSTTIMEOUTCOUNT field.*/


/* I3CCORE_CORE_I3CVERID: This register reflects the current release number of DWC_mipi_i3c */
  #define I3CCORE_CORE_I3CVERID_ResetValue (0x3130302AUL) /*!< Reset value of I3CVERID register.                               */

/* I3CVERID @Bits 0..31 : Current release number */
  #define I3CCORE_CORE_I3CVERID_I3CVERID_Pos (0UL)   /*!< Position of I3CVERID field.                                          */
  #define I3CCORE_CORE_I3CVERID_I3CVERID_Msk (0xFFFFFFFFUL << I3CCORE_CORE_I3CVERID_I3CVERID_Pos) /*!< Bit mask of I3CVERID
                                                                            field.*/


/* I3CCORE_CORE_I3CVERTYPE: This register reflects the current release type of DWC_mipi_i3c. */
  #define I3CCORE_CORE_I3CVERTYPE_ResetValue (0x6C633033UL) /*!< Reset value of I3CVERTYPE register.                           */

/* I3CVERTYPE @Bits 0..31 : Current release type */
  #define I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Pos (0UL) /*!< Position of I3CVERTYPE field.                                      */
  #define I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Msk (0xFFFFFFFFUL << I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Pos) /*!< Bit mask of
                                                                            I3CVERTYPE field.*/


/* I3CCORE_CORE_QUEUESIZECAPABILITY: This register reflects the configured size of the Data Buffer and Queues in DWC_mipi_i3c. */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_ResetValue (0x00022355UL) /*!< Reset value of QUEUESIZECAPABILITY register.         */

/* TXBUFSIZE @Bits 0..3 : Transmit Data Buffer Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Pos (0UL) /*!< Position of TXBUFSIZE field.                               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Pos) /*!< Bit mask
                                                                            of TXBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Min (0x0UL) /*!< Min enumerator value of TXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Max (0x5UL) /*!< Max enumerator value of TXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_32DWORD (0x4UL) /*!< 32 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_64DWORD (0x5UL) /*!< 64 DWORDS                                            */

/* RXBUFSIZE @Bits 4..7 : Receive Data Buffer Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos (4UL) /*!< Position of RXBUFSIZE field.                               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos) /*!< Bit mask
                                                                            of RXBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Min (0x0UL) /*!< Min enumerator value of RXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Max (0x5UL) /*!< Max enumerator value of RXBUFSIZE field.                 */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                              */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_32DWORD (0x4UL) /*!< 32 DWORDS                                            */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_64DWORD (0x5UL) /*!< 64 DWORDS                                            */

/* CMDBUFSIZE @Bits 8..11 : Command Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos (8UL) /*!< Position of CMDBUFSIZE field.                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos) /*!< Bit
                                                                            mask of CMDBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Min (0x0UL) /*!< Min enumerator value of CMDBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Max (0x3UL) /*!< Max enumerator value of CMDBUFSIZE field.               */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_2DWORD (0x0UL) /*!< 2 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_4DWORD (0x1UL) /*!< 4 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_8DWORD (0x2UL) /*!< 8 DWORDS                                             */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_16DWORD (0x3UL) /*!< 16 DWORDS                                           */

