tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RSVD3CFG @Bits 15..31 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Pos (15UL)  /*!< Position of RSVD3CFG field.                                          */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Msk (0x1FFFFUL << I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Pos) /*!< Bit mask of RSVD3CFG field.*/


/* I3CCORE_DMA_CH0_DSR0: Destination Scatter register. */
  #define I3CCORE_DMA_CH0_DSR0_ResetValue (0x00000000UL) /*!< Reset value of DSR0 register.                                    */

/* DSI @Bits 0..19 : Destination Scatter Interval. */
  #define I3CCORE_DMA_CH0_DSR0_DSI_Pos (0UL)         /*!< Position of DSI field.                                               */
  #define I3CCORE_DMA_CH0_DSR0_DSI_Msk (0xFFFFFUL << I3CCORE_DMA_CH0_DSR0_DSI_Pos) /*!< Bit mask of DSI field.                 */

/* DSC @Bits 20..24 : Destination Scatter Count. */
  #define I3CCORE_DMA_CH0_DSR0_DSC_Pos (20UL)        /*!< Position of DSC field.                                               */
  #define I3CCORE_DMA_CH0_DSR0_DSC_Msk (0x1FUL << I3CCORE_DMA_CH0_DSR0_DSC_Pos) /*!< Bit mask of DSC field.                    */



/* ================================================= Struct I3CCORE_DMA_CH1 ================================================== */
/**
  * @brief CH1 [I3CCORE_DMA_CH1] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SAR1;                              /*!< (@ 0x00000000) This register contains the source address of the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DAR1;                              /*!< (@ 0x00000008) This register contains the destination address of the
                                                                         DMA transfer.*/
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  CTL1L;                             /*!< (@ 0x00000018) This register contains fields that control the DMA
                                                                         transfer.*/
  __IOM uint32_t  CTL1H;                             /*!< (@ 0x0000001C) This register contains fields that control the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED2[8];
  __IOM uint32_t  CFG1L;                             /*!< (@ 0x00000040) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IOM uint32_t  CFG1H;                             /*!< (@ 0x00000044) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IOM uint32_t  SGR1;                              /*!< (@ 0x00000048) Source Gather register                                */
} NRF_I3CCORE_DMA_CH1_Type;                          /*!< Size = 76 (0x04C)                                                    */

/* I3CCORE_DMA_CH1_SAR1: This register contains the source address of the DMA transfer. */
  #define I3CCORE_DMA_CH1_SAR1_ResetValue (0x00000000UL) /*!< Reset value of SAR1 register.                                    */

/* SAR @Bits 0..31 : Current Source Address of DMA transfer. */
  #define I3CCORE_DMA_CH1_SAR1_SAR_Pos (0UL)         /*!< Position of SAR field.                                               */
  #define I3CCORE_DMA_CH1_SAR1_SAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH1_SAR1_SAR_Pos) /*!< Bit mask of SAR field.              */


/* I3CCORE_DMA_CH1_DAR1: This register contains the destination address of the DMA transfer. */
  #define I3CCORE_DMA_CH1_DAR1_ResetValue (0x00000000UL) /*!< Reset value of DAR1 register.                                    */

/* DAR @Bits 0..31 : Current Destination address of DMA transfer. */
  #define I3CCORE_DMA_CH1_DAR1_DAR_Pos (0UL)         /*!< Position of DAR field.                                               */
  #define I3CCORE_DMA_CH1_DAR1_DAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH1_DAR1_DAR_Pos) /*!< Bit mask of DAR field.              */


/* I3CCORE_DMA_CH1_CTL1L: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH1_CTL1L_ResetValue (0x00F04805UL) /*!< Reset value of CTL1L register.                                  */

/* INTEN @Bit 0 : Interrupt Enable Bit. */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Pos (0UL)      /*!< Position of INTEN field.                                             */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_INTEN_Pos) /*!< Bit mask of INTEN field.             */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Min (0x0UL)    /*!< Min enumerator value of INTEN field.                                 */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Max (0x1UL)    /*!< Max enumerator value of INTEN field.                                 */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_INTERRUPT_DISABLE (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_INTERRUPT_ENABLE (0x1UL) /*!< (unspecified)                                              */

/* RSVDDSTTRWIDTH @Bits 1..3 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Pos (1UL) /*!< Position of RSVDDSTTRWIDTH field.                                */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Pos) /*!< Bit mask of
                                                                            RSVDDSTTRWIDTH field.*/

/* SRCTRWIDTH @Bits 4..6 : Source Transfer Width. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Pos (4UL) /*!< Position of SRCTRWIDTH field.                                        */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Pos) /*!< Bit mask of SRCTRWIDTH
                                                                            field.*/
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Min (0x0UL) /*!< Min enumerator value of SRCTRWIDTH field.                          */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Max (0x7UL) /*!< Max enumerator value of SRCTRWIDTH field.                          */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_0 (0x0UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_1 (0x1UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_2 (0x2UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_3 (0x3UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_4 (0x4UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_5 (0x5UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_6 (0x6UL) /*!< (unspecified)                                           */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_7 (0x7UL) /*!< (unspecified)                                           */

/* DINC @Bits 7..8 : Destination Address Increment. */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Pos (7UL)       /*!< Position of DINC field.                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_DINC_Pos) /*!< Bit mask of DINC field.                */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Min (0x0UL)     /*!< Min enumerator value of DINC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Max (0x3UL)     /*!< Max enumerator value of DINC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_0 (0x0UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_1 (0x1UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_2 (0x2UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_3 (0x3UL)  /*!< (unspecified)                                                        */

/* SINC @Bits 9..10 : Source Address Increment. */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Pos (9UL)       /*!< Position of SINC field.                                              */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_SINC_Pos) /*!< Bit mask of SINC field.                */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Min (0x0UL)     /*!< Min enumerator value of SINC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Max (0x3UL)     /*!< Max enumerator value of SINC field.                                  */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_0 (0x0UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_1 (0x1UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_2 (0x2UL)  /*!< (unspecified)                                                        */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_3 (0x3UL)  /*!< (unspecified)                                                        */

/* DESTMSIZE @Bits 11..13 : Destination Burst Transaction Length. */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Pos (11UL) /*!< Position of DESTMSIZE field.                                         */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Pos) /*!< Bit mask of DESTMSIZE field. */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Min (0x0UL) /*!< Min enumerator value of DESTMSIZE field.                            */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Max (0x7UL) /*!< Max enumerator value of DESTMSIZE field.                            */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_0 (0x0UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_1 (0x1UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_2 (0x2UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_3 (0x3UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_4 (0x4UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_5 (0x5UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_6 (0x6UL) /*!< (unspecified)                                              */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_7 (0x7UL) /*!< (unspecified)                                              */

/* SRCMSIZE @Bits 14..16 : Source Burst Transaction Length. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Pos (14UL)  /*!< Position of SRCMSIZE field.                                          */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Pos) /*!< Bit mask of SRCMSIZE field.    */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Min (0x0UL) /*!< Min enumerator value of SRCMSIZE field.                              */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Max (0x7UL) /*!< Max enumerator value of SRCMSIZE field.                              */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_0 (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_1 (0x1UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_2 (0x2UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_3 (0x3UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_4 (0x4UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_5 (0x5UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_6 (0x6UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_7 (0x7UL) /*!< (unspecified)                                                */

/* SRCGATHEREN @Bit 17 : Source gather enable. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Pos (17UL) /*!< Position of SRCGATHEREN field.                                     */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Pos) /*!< Bit mask of SRCGATHEREN
                                                                            field.*/
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Min (0x0UL) /*!< Min enumerator value of SRCGATHEREN field.                        */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Max (0x1UL) /*!< Max enumerator value of SRCGATHEREN field.                        */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_SRC_GATHER_DISABLE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_SRC_GATHER_ENABLE (0x1UL) /*!< (unspecified)                                       */

