tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* I3CCORE_DMA_CH1_CFG1H: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH1_CFG1H_ResetValue (0x00000004UL) /*!< Reset value of CFG1H register.                                  */

/* FCMODE @Bit 0 : Flow Control Mode. */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_Pos (0UL)     /*!< Position of FCMODE field.                                            */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_FCMODE_Pos) /*!< Bit mask of FCMODE field.          */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_Min (0x0UL)   /*!< Min enumerator value of FCMODE field.                                */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_Max (0x1UL)   /*!< Max enumerator value of FCMODE field.                                */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_FCMODE_0 (0x0UL) /*!< (unspecified)                                                     */
  #define I3CCORE_DMA_CH1_CFG1H_FCMODE_FCMODE_1 (0x1UL) /*!< (unspecified)                                                     */

/* FIFOMODE @Bit 1 : FIFO Mode Select. */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_Pos (1UL)   /*!< Position of FIFOMODE field.                                          */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_FIFOMODE_Pos) /*!< Bit mask of FIFOMODE field.    */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_Min (0x0UL) /*!< Min enumerator value of FIFOMODE field.                              */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_Max (0x1UL) /*!< Max enumerator value of FIFOMODE field.                              */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_FIFO_MODE_0 (0x0UL) /*!< (unspecified)                                                */
  #define I3CCORE_DMA_CH1_CFG1H_FIFOMODE_FIFO_MODE_1 (0x1UL) /*!< (unspecified)                                                */

/* PROTCTL @Bits 2..4 : Protection Control bits used to drive the AHB HPROT[3:1] bus. */
  #define I3CCORE_DMA_CH1_CFG1H_PROTCTL_Pos (2UL)    /*!< Position of PROTCTL field.                                           */
  #define I3CCORE_DMA_CH1_CFG1H_PROTCTL_Msk (0x7UL << I3CCORE_DMA_CH1_CFG1H_PROTCTL_Pos) /*!< Bit mask of PROTCTL field.       */

/* RSVDDSUPDEN @Bit 5 : Reserved field- read-only */
  #define I3CCORE_DMA_CH1_CFG1H_RSVDDSUPDEN_Pos (5UL) /*!< Position of RSVDDSUPDEN field.                                      */
  #define I3CCORE_DMA_CH1_CFG1H_RSVDDSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_RSVDDSUPDEN_Pos) /*!< Bit mask of RSVDDSUPDEN
                                                                            field.*/

/* RSVDSSUPDEN @Bit 6 : Reserved field- read-only */
  #define I3CCORE_DMA_CH1_CFG1H_RSVDSSUPDEN_Pos (6UL) /*!< Position of RSVDSSUPDEN field.                                      */
  #define I3CCORE_DMA_CH1_CFG1H_RSVDSSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_RSVDSSUPDEN_Pos) /*!< Bit mask of RSVDSSUPDEN
                                                                            field.*/

/* SRCPER @Bit 7 : Source Hardware Interface. */
  #define I3CCORE_DMA_CH1_CFG1H_SRCPER_Pos (7UL)     /*!< Position of SRCPER field.                                            */
  #define I3CCORE_DMA_CH1_CFG1H_SRCPER_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_SRCPER_Pos) /*!< Bit mask of SRCPER field.          */

/* RSVD1CFG @Bits 8..10 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1H_RSVD1CFG_Pos (8UL)   /*!< Position of RSVD1CFG field.                                          */
  #define I3CCORE_DMA_CH1_CFG1H_RSVD1CFG_Msk (0x7UL << I3CCORE_DMA_CH1_CFG1H_RSVD1CFG_Pos) /*!< Bit mask of RSVD1CFG field.    */

/* DESTPER @Bit 11 : Destination hardware interface. */
  #define I3CCORE_DMA_CH1_CFG1H_DESTPER_Pos (11UL)   /*!< Position of DESTPER field.                                           */
  #define I3CCORE_DMA_CH1_CFG1H_DESTPER_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1H_DESTPER_Pos) /*!< Bit mask of DESTPER field.       */


/* I3CCORE_DMA_CH1_SGR1: Source Gather register */
  #define I3CCORE_DMA_CH1_SGR1_ResetValue (0x00000000UL) /*!< Reset value of SGR1 register.                                    */

/* SGI @Bits 0..19 : Source Gather Interval. */
  #define I3CCORE_DMA_CH1_SGR1_SGI_Pos (0UL)         /*!< Position of SGI field.                                               */
  #define I3CCORE_DMA_CH1_SGR1_SGI_Msk (0xFFFFFUL << I3CCORE_DMA_CH1_SGR1_SGI_Pos) /*!< Bit mask of SGI field.                 */

/* SGC @Bits 20..24 : Source Gather Count. */
  #define I3CCORE_DMA_CH1_SGR1_SGC_Pos (20UL)        /*!< Position of SGC field.                                               */
  #define I3CCORE_DMA_CH1_SGR1_SGC_Msk (0x1FUL << I3CCORE_DMA_CH1_SGR1_SGC_Pos) /*!< Bit mask of SGC field.                    */



/* ================================================= Struct I3CCORE_DMA_INT ================================================== */
/**
  * @brief INT [I3CCORE_DMA_INT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RAWTFR;                            /*!< (@ 0x00000000) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RAWBLOCK;                          /*!< (@ 0x00000008) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  RAWSRCTRAN;                        /*!< (@ 0x00000010) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  RAWDSTTRAN;                        /*!< (@ 0x00000018) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  RAWERR;                            /*!< (@ 0x00000020) Interrupt events are stored in this Raw Interrupt
                                                                         Status register before masking.*/
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  STATUSTFR;                         /*!< (@ 0x00000028) Channel DMA Transfer complete interrupt event from all
                                                                         channels is stored in this Interrupt Status register
                                                                         after masking.*/
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  STATUSBLOCK;                       /*!< (@ 0x00000030) Channel Block complete interrupt event from all
                                                                         channels is stored in this Interrupt Status register
                                                                         after masking.*/
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  STATUSSRCTRAN;                     /*!< (@ 0x00000038) Channel Source Transaction complete interrupt event
                                                                         from all channels is stored in this Interrupt Status
                                                                         register after masking.*/
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  STATUSDSTTRAN;                     /*!< (@ 0x00000040) Channel destination transaction complete interrupt
                                                                         event from all channels is stored in this Interrupt
                                                                         Status register after masking.*/
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  STATUSERR;                         /*!< (@ 0x00000048) Channel Error interrupt event from all channels is
                                                                         stored in this Interrupt Status register after
                                                                         masking.*/
  __IM  uint32_t  RESERVED9;
  __IOM uint32_t  MASKTFR;                           /*!< (@ 0x00000050) The contents of the Raw Status register RawTfr is
                                                                         masked with the contents of the Mask register MaskTfr.*/
  __IM  uint32_t  RESERVED10;
  __IOM uint32_t  MASKBLOCK;                         /*!< (@ 0x00000058) The contents of the Raw Status register RawBlock is
                                                                         masked with the contents of the Mask register
                                                                         MaskBlock.*/
  __IM  uint32_t  RESERVED11;
  __IOM uint32_t  MASKSRCTRAN;                       /*!< (@ 0x00000060) The contents of the Raw Status register RawSrcTran is
                                                                         masked with the contents of the Mask register
                                                                         MaskSrcTran.*/
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  MASKDSTTRAN;                       /*!< (@ 0x00000068) The contents of the Raw Status register RawDstTran is
                                                                         masked with the contents of the Mask register
                                                                         MaskDstTran.*/
  __IM  uint32_t  RESERVED13;
  __IOM uint32_t  MASKERR;                           /*!< (@ 0x00000070) The contents of the Raw Status register RawErr is
                                                                         masked with the contents of the Mask register MaskErr.*/
  __IM  uint32_t  RESERVED14;
  __IOM uint32_t  CLEARTFR;                          /*!< (@ 0x00000078) Each bit in the RawTfr and StatusTfr is cleared on the
                                                                         same cycle by writing a 1 to the corresponding location
                                                                         in the this registers.*/
  __IM  uint32_t  RESERVED15;
  __IOM uint32_t  CLEARBLOCK;                        /*!< (@ 0x00000080) Each bit in the RawBlock and StatusBlock is cleared on
                                                                         the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/
  __IM  uint32_t  RESERVED16;
  __IOM uint32_t  CLEARSRCTRAN;                      /*!< (@ 0x00000088) Each bit in the RawSrcTran and StatusSrcTran is cleared
                                                                         on the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/
  __IM  uint32_t  RESERVED17;
  __IOM uint32_t  CLEARDSTTRAN;                      /*!< (@ 0x00000090) Each bit in the RawDstTran and StatusDstTran is cleared
                                                                         on the same cycle by writing a 1 to the corresponding
                                                                         location in the this registers.*/
  __IM  uint32_t  RESERVED18;
  __IOM uint32_t  CLEARERR;                          /*!< (@ 0x00000098) Each bit in the RawErr and StatusErr is cleared on the
                                                                         same cycle by writing a 1 to the corresponding location
                                                                         in the this registers.*/
  __IM  uint32_t  RESERVED19;
  __IOM uint32_t  STATUSINT;                         /*!< (@ 0x000000A0) The contents of each of the five Status registers
                                                                         StatusTfr, StatusBlock, StatusSrcTran, StatusDstTran,
                                                                         StatusErr is ORed to produce a single bit for each
                                                                         interrupt type in the Combined Status register
                                                                         (StatusInt).*/
} NRF_I3CCORE_DMA_INT_Type;                          /*!< Size = 164 (0x0A4)                                                   */

/* I3CCORE_DMA_INT_RAWTFR: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWTFR_ResetValue (0x00000000UL) /*!< Reset value of RAWTFR register.                                */

/* RAW @Bits 0..1 : Raw Status for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Pos (0UL)       /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWTFR_RAW_Pos) /*!< Bit mask of RAW field.                 */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Min (0x0UL)     /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_Max (0x1UL)     /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define I3CCORE_DMA_INT_RAWTFR_RAW_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */


/* I3CCORE_DMA_INT_RAWBLOCK: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWBLOCK_ResetValue (0x00000000UL) /*!< Reset value of RAWBLOCK register.                            */

/* RAW @Bits 0..1 : Raw Status for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Pos (0UL)     /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWBLOCK_RAW_Pos) /*!< Bit mask of RAW field.             */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Min (0x0UL)   /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_Max (0x1UL)   /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define I3CCORE_DMA_INT_RAWBLOCK_RAW_ACTIVE (0x1UL) /*!< (unspecified)                                                       */


/* I3CCORE_DMA_INT_RAWSRCTRAN: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_ResetValue (0x00000000UL) /*!< Reset value of RAWSRCTRAN register.                        */

/* RAW @Bits 0..1 : Raw Status for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Pos (0UL)   /*!< Position of RAW field.                                               */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Pos) /*!< Bit mask of RAW field.         */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Min (0x0UL) /*!< Min enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_Max (0x1UL) /*!< Max enumerator value of RAW field.                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define I3CCORE_DMA_INT_RAWSRCTRAN_RAW_ACTIVE (0x1UL) /*!< (unspecified)                                                     */


