tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* I3CCORE_DMA_INT_STATUSINT: The contents of each of the five Status registers StatusTfr, StatusBlock, StatusSrcTran,
                               StatusDstTran, StatusErr is ORed to produce a single bit for each interrupt type in the Combined
                               Status register (StatusInt). */

  #define I3CCORE_DMA_INT_STATUSINT_ResetValue (0x00000000UL) /*!< Reset value of STATUSINT register.                          */

/* TFR @Bit 0 : OR of the contents of StatusTfr register */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Pos (0UL)    /*!< Position of TFR field.                                               */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_TFR_Pos) /*!< Bit mask of TFR field.           */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Min (0x0UL)  /*!< Min enumerator value of TFR field.                                   */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Max (0x1UL)  /*!< Max enumerator value of TFR field.                                   */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* BLOCK @Bit 1 : OR of the contents of StatusBlock register */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Pos (1UL)  /*!< Position of BLOCK field.                                             */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_BLOCK_Pos) /*!< Bit mask of BLOCK field.     */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Min (0x0UL) /*!< Min enumerator value of BLOCK field.                                */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Max (0x1UL) /*!< Max enumerator value of BLOCK field.                                */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_INACTIVE (0x0UL) /*!< (unspecified)                                                  */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_ACTIVE (0x1UL) /*!< (unspecified)                                                    */

/* SRCT @Bit 2 : OR of the contents of StatusSrcTran */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Pos (2UL)   /*!< Position of SRCT field.                                              */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_SRCT_Pos) /*!< Bit mask of SRCT field.        */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Min (0x0UL) /*!< Min enumerator value of SRCT field.                                  */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Max (0x1UL) /*!< Max enumerator value of SRCT field.                                  */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* DSTT @Bit 3 : OR of the contents of StatusDstTran */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Pos (3UL)   /*!< Position of DSTT field.                                              */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_DSTT_Pos) /*!< Bit mask of DSTT field.        */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Min (0x0UL) /*!< Min enumerator value of DSTT field.                                  */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Max (0x1UL) /*!< Max enumerator value of DSTT field.                                  */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* ERR @Bit 4 : OR of the contents of StatusErr */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Pos (4UL)    /*!< Position of ERR field.                                               */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_ERR_Pos) /*!< Bit mask of ERR field.           */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Min (0x0UL)  /*!< Min enumerator value of ERR field.                                   */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Max (0x1UL)  /*!< Max enumerator value of ERR field.                                   */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_ACTIVE (0x1UL) /*!< (unspecified)                                                      */



/* ============================================= Struct I3CCORE_DMA_SWHANDSHAKE ============================================== */
/**
  * @brief SWHANDSHAKE [I3CCORE_DMA_SWHANDSHAKE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQSRCREG;                         /*!< (@ 0x00000000) A bit is assigned for each channel in this register.  */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  REQDSTREG;                         /*!< (@ 0x00000008) A bit is assigned for each channel in this register.  */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SGLRQSRCREG;                       /*!< (@ 0x00000010) A bit is assigned for each channel in this register.  */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SGLRQDSTREG;                       /*!< (@ 0x00000018) A bit is assigned for each channel in this register.  */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  LSTSRCREG;                         /*!< (@ 0x00000020) A bit is assigned for each channel in this register.  */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  LSTDSTREG;                         /*!< (@ 0x00000028) A bit is assigned for each channel in this register.  */
} NRF_I3CCORE_DMA_SWHANDSHAKE_Type;                  /*!< Size = 44 (0x02C)                                                    */

/* I3CCORE_DMA_SWHANDSHAKE_REQSRCREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_ResetValue (0x00000000UL) /*!< Reset value of REQSRCREG register.                  */

/* SRCREQ @Bits 0..1 : Source Software Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Pos (0UL) /*!< Position of SRCREQ field.                                    */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Pos) /*!< Bit mask of
                                                                            SRCREQ field.*/
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Min (0x0UL) /*!< Min enumerator value of SRCREQ field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Max (0x1UL) /*!< Max enumerator value of SRCREQ field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_INACTIVE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_ACTIVE (0x1UL) /*!< (unspecified)                                           */

/* RSVDREQSRCREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Pos (2UL) /*!< Position of RSVDREQSRCREG field.                      */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Pos)
                                                                            /*!< Bit mask of RSVDREQSRCREG field.*/

/* SRCREQWE @Bits 8..9 : Source Software Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Pos (8UL) /*!< Position of SRCREQWE field.                                */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Pos) /*!< Bit mask
                                                                            of SRCREQWE field.*/
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Min (0x0UL) /*!< Min enumerator value of SRCREQWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Max (0x1UL) /*!< Max enumerator value of SRCREQWE field.                  */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_DISABLED (0x0UL) /*!< (unspecified)                                       */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_ENABLED (0x1UL) /*!< (unspecified)                                        */


