tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH6CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH6_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_Pos (12UL) /*!< Position of CH6CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH6CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH6CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH6CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH6HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH6_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_Pos (13UL) /*!< Position of CH6HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_Pos) /*!< Bit mask
                                                                            of CH6HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_Min (0x0UL) /*!< Min enumerator value of CH6HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_Max (0x1UL) /*!< Max enumerator value of CH6HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH6FC @Bits 14..15 : The value of this register is derived from the DMAH_CH6_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_Pos (14UL) /*!< Position of CH6FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_Pos) /*!< Bit mask of
                                                                            CH6FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_Min (0x0UL) /*!< Min enumerator value of CH6FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_Max (0x3UL) /*!< Max enumerator value of CH6FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH6MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH6_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_Pos (16UL) /*!< Position of CH6MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH6MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH6MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH6MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH6DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH6_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_Pos (19UL) /*!< Position of CH6DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_Pos) /*!< Bit mask of
                                                                            CH6DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_Min (0x0UL) /*!< Min enumerator value of CH6DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_Max (0x4UL) /*!< Max enumerator value of CH6DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH6LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH6_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_Pos (22UL) /*!< Position of CH6LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_Pos) /*!< Bit mask of
                                                                            CH6LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_Min (0x0UL) /*!< Min enumerator value of CH6LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_Max (0x4UL) /*!< Max enumerator value of CH6LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH6SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH6_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_Pos (25UL) /*!< Position of CH6SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_Pos) /*!< Bit mask of
                                                                            CH6SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_Min (0x0UL) /*!< Min enumerator value of CH6SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_Max (0x4UL) /*!< Max enumerator value of CH6SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH6FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH6_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_Pos (28UL) /*!< Position of CH6FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH6FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH6FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH6FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_IFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS5H: DMA_COMP_PARAMS_5 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 5 and Channel 6. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS5H register.             */

