tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH5DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH5_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Pos (0UL) /*!< Position of CH5DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Pos) /*!< Bit mask of
                                                                            CH5DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Min (0x0UL) /*!< Min enumerator value of CH5DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Max (0x6UL) /*!< Max enumerator value of CH5DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH5STW @Bits 3..5 : The value of this register is derived from the DMAH_CH5_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Pos (3UL) /*!< Position of CH5STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Pos) /*!< Bit mask of
                                                                            CH5STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Min (0x0UL) /*!< Min enumerator value of CH5STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Max (0x6UL) /*!< Max enumerator value of CH5STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH5STATDST @Bit 6 : The value of this register is derived from the DMAH_CH5_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Pos (6UL) /*!< Position of CH5STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Pos) /*!< Bit
                                                                            mask of CH5STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Min (0x0UL) /*!< Min enumerator value of CH5STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Max (0x1UL) /*!< Max enumerator value of CH5STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH5STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH5_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Pos (7UL) /*!< Position of CH5STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Pos) /*!< Bit
                                                                            mask of CH5STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Min (0x0UL) /*!< Min enumerator value of CH5STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Max (0x1UL) /*!< Max enumerator value of CH5STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH5DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH5_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Pos (8UL) /*!< Position of CH5DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH5DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH5DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH5DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH5SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH5_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Pos (9UL) /*!< Position of CH5SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH5SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH5SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH5SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

