tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH4STW @Bits 3..5 : The value of this register is derived from the DMAH_CH4_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Pos (3UL) /*!< Position of CH4STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Pos) /*!< Bit mask of
                                                                            CH4STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Min (0x0UL) /*!< Min enumerator value of CH4STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Max (0x6UL) /*!< Max enumerator value of CH4STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH4STATDST @Bit 6 : The value of this register is derived from the DMAH_CH4_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Pos (6UL) /*!< Position of CH4STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Pos) /*!< Bit
                                                                            mask of CH4STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Min (0x0UL) /*!< Min enumerator value of CH4STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Max (0x1UL) /*!< Max enumerator value of CH4STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH4STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH4_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Pos (7UL) /*!< Position of CH4STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Pos) /*!< Bit
                                                                            mask of CH4STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Min (0x0UL) /*!< Min enumerator value of CH4STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Max (0x1UL) /*!< Max enumerator value of CH4STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH4DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH4_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Pos (8UL) /*!< Position of CH4DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH4DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH4DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH4DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH4SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH4_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Pos (9UL) /*!< Position of CH4SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH4SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH4SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH4SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH4LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH4_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Pos (10UL) /*!< Position of CH4LOCKEN field.                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Pos) /*!< Bit mask
                                                                            of CH4LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Min (0x0UL) /*!< Min enumerator value of CH4LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Max (0x1UL) /*!< Max enumerator value of CH4LOCKEN field.                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_FALSE (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_TRUE (0x1UL) /*!< (unspecified)                                           */

