tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH4MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH4_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Pos (11UL) /*!< Position of CH4MULTIBLKEN field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH4MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Min (0x0UL) /*!< Min enumerator value of CH4MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Max (0x1UL) /*!< Max enumerator value of CH4MULTIBLKEN field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_FALSE (0x0UL) /*!< (unspecified)                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_TRUE (0x1UL) /*!< (unspecified)                                       */

/* CH4CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH4_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Pos (12UL) /*!< Position of CH4CTLWBEN field.                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH4CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Min (0x0UL) /*!< Min enumerator value of CH4CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Max (0x1UL) /*!< Max enumerator value of CH4CTLWBEN field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH4HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH4_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Pos (13UL) /*!< Position of CH4HCLLP field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Pos) /*!< Bit mask
                                                                            of CH4HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Min (0x0UL) /*!< Min enumerator value of CH4HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Max (0x1UL) /*!< Max enumerator value of CH4HCLLP field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_PROGRAMMABLE (0x0UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_HARDCODED (0x1UL) /*!< (unspecified)                                       */

/* CH4FC @Bits 14..15 : The value of this register is derived from the DMAH_CH4_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Pos (14UL) /*!< Position of CH4FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Pos) /*!< Bit mask of
                                                                            CH4FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Min (0x0UL) /*!< Min enumerator value of CH4FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Max (0x3UL) /*!< Max enumerator value of CH4FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH4MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH4_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Pos (16UL) /*!< Position of CH4MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH4MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH4MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH4MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH4DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH4_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Pos (19UL) /*!< Position of CH4DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Pos) /*!< Bit mask of
                                                                            CH4DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Min (0x0UL) /*!< Min enumerator value of CH4DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Max (0x4UL) /*!< Max enumerator value of CH4DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH4LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH4_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Pos (22UL) /*!< Position of CH4LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Pos) /*!< Bit mask of
                                                                            CH4LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Min (0x0UL) /*!< Min enumerator value of CH4LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Max (0x4UL) /*!< Max enumerator value of CH4LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH4SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH4_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Pos (25UL) /*!< Position of CH4SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Pos) /*!< Bit mask of
                                                                            CH4SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Min (0x0UL) /*!< Min enumerator value of CH4SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Max (0x4UL) /*!< Max enumerator value of CH4SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

