tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH4FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH4_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Pos (28UL) /*!< Position of CH4FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH4FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH4FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH4FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS4H: DMA_COMP_PARAMS_4 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 3 and Channel 4. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS4H register.             */

/* CH3DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH3_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Pos (0UL) /*!< Position of CH3DTW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Pos) /*!< Bit mask of
                                                                            CH3DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Min (0x0UL) /*!< Min enumerator value of CH3DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Max (0x6UL) /*!< Max enumerator value of CH3DTW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH3STW @Bits 3..5 : The value of this register is derived from the DMAH_CH3_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Pos (3UL) /*!< Position of CH3STW field.                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Pos) /*!< Bit mask of
                                                                            CH3STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Min (0x0UL) /*!< Min enumerator value of CH3STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Max (0x6UL) /*!< Max enumerator value of CH3STW field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_8 (0x1UL) /*!< (unspecified)                                     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_16 (0x2UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_32 (0x3UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_64 (0x4UL) /*!< (unspecified)                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_128 (0x5UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_256 (0x6UL) /*!< (unspecified)                                   */

/* CH3STATDST @Bit 6 : The value of this register is derived from the DMAH_CH3_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Pos (6UL) /*!< Position of CH3STATDST field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Pos) /*!< Bit
                                                                            mask of CH3STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Min (0x0UL) /*!< Min enumerator value of CH3STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Max (0x1UL) /*!< Max enumerator value of CH3STATDST field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH3STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH3_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Pos (7UL) /*!< Position of CH3STATSRC field.                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Pos) /*!< Bit
                                                                            mask of CH3STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Min (0x0UL) /*!< Min enumerator value of CH3STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Max (0x1UL) /*!< Max enumerator value of CH3STATSRC field.               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_FALSE (0x0UL) /*!< (unspecified)                                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_TRUE (0x1UL) /*!< (unspecified)                                          */

/* CH3DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH3_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Pos (8UL) /*!< Position of CH3DSTSCAEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH3DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Min (0x0UL) /*!< Min enumerator value of CH3DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Max (0x1UL) /*!< Max enumerator value of CH3DSTSCAEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_TRUE (0x1UL) /*!< (unspecified)                                         */

/* CH3SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH3_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Pos (9UL) /*!< Position of CH3SRCGATEN field.                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH3SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Min (0x0UL) /*!< Min enumerator value of CH3SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Max (0x1UL) /*!< Max enumerator value of CH3SRCGATEN field.             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_FALSE (0x0UL) /*!< (unspecified)                                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_TRUE (0x1UL) /*!< (unspecified)                                         */

