tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH2FC @Bits 14..15 : The value of this register is derived from the DMAH_CH2_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Pos (14UL) /*!< Position of CH2FC field.                                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Pos) /*!< Bit mask of
                                                                            CH2FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Min (0x0UL) /*!< Min enumerator value of CH2FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Max (0x3UL) /*!< Max enumerator value of CH2FC field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_DMA (0x0UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_SRC (0x1UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_DST (0x2UL) /*!< (unspecified)                                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_ANY (0x3UL) /*!< (unspecified)                                             */

/* CH2MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH2_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Pos (16UL) /*!< Position of CH2MAXMULTSIZE field.                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH2MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Min (0x0UL) /*!< Min enumerator value of CH2MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Max (0x6UL) /*!< Max enumerator value of CH2MAXMULTSIZE field.       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL) /*!< (unspecified)                         */

/* CH2DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH2_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Pos (19UL) /*!< Position of CH2DMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Pos) /*!< Bit mask of
                                                                            CH2DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Min (0x0UL) /*!< Min enumerator value of CH2DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Max (0x4UL) /*!< Max enumerator value of CH2DMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_PROGRAMMABLE (0x4UL) /*!< (unspecified)                                      */

/* CH2LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH2_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Pos (22UL) /*!< Position of CH2LMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Pos) /*!< Bit mask of
                                                                            CH2LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Min (0x0UL) /*!< Min enumerator value of CH2LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Max (0x4UL) /*!< Max enumerator value of CH2LMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_PROGRAMMALE (0x4UL) /*!< (unspecified)                                       */

/* CH2SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH2_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Pos (25UL) /*!< Position of CH2SMS field.                                    */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Pos) /*!< Bit mask of
                                                                            CH2SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Min (0x0UL) /*!< Min enumerator value of CH2SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Max (0x4UL) /*!< Max enumerator value of CH2SMS field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_1 (0x0UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_2 (0x1UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_3 (0x2UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_4 (0x3UL) /*!< (unspecified)                                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_PROGRAMMALE (0x4UL) /*!< (unspecified)                                       */

/* CH2FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH2_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Pos (28UL) /*!< Position of CH2FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH2FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH2FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH2FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS3H: DMA_COMP_PARAMS_3 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 1 and Channel 2. */

