tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH0FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH0_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Pos (28UL) /*!< Position of CH0FIFODEPTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH0FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Min (0x0UL) /*!< Min enumerator value of CH0FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Max (0x5UL) /*!< Max enumerator value of CH0FIFODEPTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_8 (0x0UL) /*!< (unspecified)                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_16 (0x1UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_32 (0x2UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_64 (0x3UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_128 (0x4UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_256 (0x5UL) /*!< (unspecified)                              */


/* I3CCORE_DMA_MISC_DMACOMPPARAMS2H: DMA_COMP_PARAMS_2 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_ResetValue (0x00000000UL) /*!< Reset value of DMACOMPPARAMS2H register.             */

/* CHOMULTIBLKTYPE @Bits 0..3 : The values of these bit fields are derived from the DMAH_CH0_MULTI_BLK_TYPE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Pos (0UL) /*!< Position of CHOMULTIBLKTYPE field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CHOMULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CHOMULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CHOMULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH1MULTIBLKTYPE @Bits 4..7 : The values of these bit fields are derived from the DMAH_CH1_MULTI_BLK_TYPE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_Pos (4UL) /*!< Position of CH1MULTIBLKTYPE field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH1MULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH1MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH1MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH1MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH2MULTIBLKTYPE @Bits 8..11 : The values of these bit fields are derived from the DMAH_CH2_MULTI_BLK_TYPE coreConsultant
                                 parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Pos (8UL) /*!< Position of CH2MULTIBLKTYPE field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH2MULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH2MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH2MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH2MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

/* CH3MULTIBLKTYPE @Bits 12..15 : The values of these bit fields are derived from the DMAH_CH3_MULTI_BLK_TYPE coreConsultant
                                  parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Pos (12UL) /*!< Position of CH3MULTIBLKTYPE field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH3MULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Min (0x0UL) /*!< Min enumerator value of CH3MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_Max (0x8UL) /*!< Max enumerator value of CH3MULTIBLKTYPE field.     */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_PROGRAMMABLE (0x0UL) /*!< (unspecified)                             */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CONT_RELOAD (0x1UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_CONT (0x2UL) /*!< (unspecified)                              */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_RELOAD (0x3UL) /*!< (unspecified)                            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CONT_LLP (0x4UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_RELOAD_LLP (0x5UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_CNT_LLP (0x6UL) /*!< (unspecified)                                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_LLP_RELOAD (0x7UL) /*!< (unspecified)                               */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH3MULTIBLKTYPE_LLP_LLP (0x8UL) /*!< (unspecified)                                  */

