tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH1MAXBLKSIZE @Bits 4..7 : The values of these bit fields are derived from the DMAH_CH1_MAX_BLK_SIZE coreConsultant
                              parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Pos (4UL) /*!< Position of CH1MAXBLKSIZE field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH1MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH1MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH1MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH2MAXBLKSIZE @Bits 8..11 : The values of these bit fields are derived from the DMAH_CH2_MAX_BLK_SIZE coreConsultant
                               parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Pos (8UL) /*!< Position of CH2MAXBLKSIZE field.                       */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH2MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH2MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH2MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH3MAXBLKSIZE @Bits 12..15 : The values of these bit fields are derived from the DMAH_CH3_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Pos (12UL) /*!< Position of CH3MAXBLKSIZE field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH3MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH3MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH3MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH4MAXBLKSIZE @Bits 16..19 : The values of these bit fields are derived from the DMAH_CH4_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Pos (16UL) /*!< Position of CH4MAXBLKSIZE field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH4MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH4MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH4MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH5MAXBLKSIZE @Bits 20..23 : The values of these bit fields are derived from the DMAH_CH5_MAX_BLK_SIZE coreConsultant
                                parameter. */

