tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Pos (20UL) /*!< Position of CH5MAXBLKSIZE field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH5MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH5MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH5MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH6MAXBLKSIZE @Bits 24..27 : The values of these bit fields are derived from the DMAH_CH6_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Pos (24UL) /*!< Position of CH6MAXBLKSIZE field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH6MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH6MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH6MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */

/* CH7MAXBLKSIZE @Bits 28..31 : The values of these bit fields are derived from the DMAH_CH7_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Pos (28UL) /*!< Position of CH7MAXBLKSIZE field.                      */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH7MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Min (0x0UL) /*!< Min enumerator value of CH7MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Max (0xAUL) /*!< Max enumerator value of CH7MAXBLKSIZE field.         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL) /*!< (unspecified)                         */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL) /*!< (unspecified)                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL) /*!< (unspecified)                        */


