tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* M1HDATAWIDTH @Bits 21..22 : The value of this register is derived from the DMAH_M1_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Pos (21UL) /*!< Position of M1HDATAWIDTH field.                        */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M1HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of M1HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Max (0x3UL) /*!< Max enumerator value of M1HDATAWIDTH field.           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL) /*!< (unspecified)                           */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL) /*!< (unspecified)                          */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL) /*!< (unspecified)                          */

/* NUMHSINT @Bits 23..27 : The value of this register is derived from the DMAH_NUM_HS_INT coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Pos (23UL) /*!< Position of NUMHSINT field.                                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Msk (0x1FUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Pos) /*!< Bit mask
                                                                            of NUMHSINT field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Min (0x0UL) /*!< Min enumerator value of NUMHSINT field.                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Max (0x10UL) /*!< Max enumerator value of NUMHSINT field.                  */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_0 (0x00UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_1 (0x01UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_2 (0x02UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_3 (0x03UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_4 (0x04UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_5 (0x05UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_6 (0x06UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_7 (0x07UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_8 (0x08UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_9 (0x09UL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_a (0x0AUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_b (0x0BUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_c (0x0CUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_d (0x0DUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_e (0x0EUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_f (0x0FUL) /*!< (unspecified)                                 */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_10 (0x10UL) /*!< (unspecified)                                */

/* ADDENCODEDPARAMS @Bit 28 : The value of this register is derived from the DMAH_ADD_ENCODED_PARAMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Pos (28UL) /*!< Position of ADDENCODEDPARAMS field.                */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Pos)
                                                                            /*!< Bit mask of ADDENCODEDPARAMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Min (0x0UL) /*!< Min enumerator value of ADDENCODEDPARAMS field.   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Max (0x1UL) /*!< Max enumerator value of ADDENCODEDPARAMS field.   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_FALSE (0x0UL) /*!< (unspecified)                                   */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_TRUE (0x1UL) /*!< (unspecified)                                    */

/* STATICENDIANSELECT @Bit 29 : The value of this register is derived from the DMAH_STATIC_ENDIAN_SELECT coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Pos (29UL) /*!< Position of STATICENDIANSELECT field.            */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Pos)
                                                                            /*!< Bit mask of STATICENDIANSELECT field.*/


/* I3CCORE_DMA_MISC_DMACOMPSID0: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the component type. */

  #define I3CCORE_DMA_MISC_DMACOMPSID0_ResetValue (0x44571110UL) /*!< Reset value of DMACOMPSID0 register.                     */

/* DMACOMPTYPE @Bits 0..31 : DMA Component Type Number = `h44571110. */
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos (0UL) /*!< Position of DMACOMPTYPE field.                               */
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos) /*!< Bit
                                                                            mask of DMACOMPTYPE field.*/


