tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* I3CCORE_DMA_MISC_DMACOMPSID1: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the version of the packaged component. */

  #define I3CCORE_DMA_MISC_DMACOMPSID1_ResetValue (0x3232322AUL) /*!< Reset value of DMACOMPSID1 register.                     */

/* DMACOMPVERSION @Bits 0..31 : DMA Component Version. */
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos (0UL) /*!< Position of DMACOMPVERSION field.                         */
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos) /*!<
                                                                            Bit mask of DMACOMPVERSION field.*/



/* =================================================== Struct I3CCORE_DMA ==================================================== */
/**
  * @brief DMA [I3CCORE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_I3CCORE_DMA_CH0_Type CH0;                /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED;
  __IOM NRF_I3CCORE_DMA_CH1_Type CH1;                /*!< (@ 0x00000058) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[135];
  __IOM NRF_I3CCORE_DMA_INT_Type INT;                /*!< (@ 0x000002C0) (unspecified)                                         */
  __IM  uint32_t  RESERVED2;
  __IOM NRF_I3CCORE_DMA_SWHANDSHAKE_Type SWHANDSHAKE; /*!< (@ 0x00000368) (unspecified)                                        */
  __IM  uint32_t  RESERVED3;
  __IOM NRF_I3CCORE_DMA_MISC_Type MISC;              /*!< (@ 0x00000398) (unspecified)                                         */
} NRF_I3CCORE_DMA_Type;                              /*!< Size = 1024 (0x400)                                                  */

/* ===================================================== Struct I3CCORE ====================================================== */
/**
  * @brief I3CCORE
  */
  typedef struct {                                   /*!< I3CCORE Structure                                                    */
    __IOM NRF_I3CCORE_CORE_Type CORE;                /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[390];
    __IOM NRF_I3CCORE_DMA_Type DMA;                  /*!< (@ 0x00000900) (unspecified)                                         */
  } NRF_I3CCORE_Type;                                /*!< Size = 3328 (0xD00)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           IPCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct IPCT_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [IPCT_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) Overflow status for SEND tasks Write 0 to clear       */
} NRF_IPCT_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* IPCT_OVERFLOW_SEND: Overflow status for SEND tasks Write 0 to clear */
  #define IPCT_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

/* SEND0 @Bit 0 : Overflow status for SEND[0] task */
  #define IPCT_OVERFLOW_SEND_SEND0_Pos (0UL)         /*!< Position of SEND0 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND0_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND0_Pos) /*!< Bit mask of SEND0 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND0_Min (0x0UL)       /*!< Min enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Max (0x1UL)       /*!< Max enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND1 @Bit 1 : Overflow status for SEND[1] task */
  #define IPCT_OVERFLOW_SEND_SEND1_Pos (1UL)         /*!< Position of SEND1 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND1_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND1_Pos) /*!< Bit mask of SEND1 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND1_Min (0x0UL)       /*!< Min enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Max (0x1UL)       /*!< Max enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND2 @Bit 2 : Overflow status for SEND[2] task */
  #define IPCT_OVERFLOW_SEND_SEND2_Pos (2UL)         /*!< Position of SEND2 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND2_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND2_Pos) /*!< Bit mask of SEND2 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND2_Min (0x0UL)       /*!< Min enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Max (0x1UL)       /*!< Max enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND3 @Bit 3 : Overflow status for SEND[3] task */
  #define IPCT_OVERFLOW_SEND_SEND3_Pos (3UL)         /*!< Position of SEND3 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND3_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND3_Pos) /*!< Bit mask of SEND3 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND3_Min (0x0UL)       /*!< Min enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Max (0x1UL)       /*!< Max enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

