tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SEND4 @Bit 4 : Overflow status for SEND[4] task */
  #define IPCT_OVERFLOW_SEND_SEND4_Pos (4UL)         /*!< Position of SEND4 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND4_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND4_Pos) /*!< Bit mask of SEND4 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND4_Min (0x0UL)       /*!< Min enumerator value of SEND4 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND4_Max (0x1UL)       /*!< Max enumerator value of SEND4 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND4_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND4_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND5 @Bit 5 : Overflow status for SEND[5] task */
  #define IPCT_OVERFLOW_SEND_SEND5_Pos (5UL)         /*!< Position of SEND5 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND5_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND5_Pos) /*!< Bit mask of SEND5 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND5_Min (0x0UL)       /*!< Min enumerator value of SEND5 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND5_Max (0x1UL)       /*!< Max enumerator value of SEND5 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND5_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND5_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND6 @Bit 6 : Overflow status for SEND[6] task */
  #define IPCT_OVERFLOW_SEND_SEND6_Pos (6UL)         /*!< Position of SEND6 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND6_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND6_Pos) /*!< Bit mask of SEND6 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND6_Min (0x0UL)       /*!< Min enumerator value of SEND6 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND6_Max (0x1UL)       /*!< Max enumerator value of SEND6 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND6_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND6_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND7 @Bit 7 : Overflow status for SEND[7] task */
  #define IPCT_OVERFLOW_SEND_SEND7_Pos (7UL)         /*!< Position of SEND7 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND7_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND7_Pos) /*!< Bit mask of SEND7 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND7_Min (0x0UL)       /*!< Min enumerator value of SEND7 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND7_Max (0x1UL)       /*!< Max enumerator value of SEND7 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND7_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND7_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND8 @Bit 8 : Overflow status for SEND[8] task */
  #define IPCT_OVERFLOW_SEND_SEND8_Pos (8UL)         /*!< Position of SEND8 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND8_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND8_Pos) /*!< Bit mask of SEND8 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND8_Min (0x0UL)       /*!< Min enumerator value of SEND8 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND8_Max (0x1UL)       /*!< Max enumerator value of SEND8 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND8_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND8_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND9 @Bit 9 : Overflow status for SEND[9] task */
  #define IPCT_OVERFLOW_SEND_SEND9_Pos (9UL)         /*!< Position of SEND9 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND9_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND9_Pos) /*!< Bit mask of SEND9 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND9_Min (0x0UL)       /*!< Min enumerator value of SEND9 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND9_Max (0x1UL)       /*!< Max enumerator value of SEND9 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND9_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND9_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND10 @Bit 10 : Overflow status for SEND[10] task */
  #define IPCT_OVERFLOW_SEND_SEND10_Pos (10UL)       /*!< Position of SEND10 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND10_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND10_Pos) /*!< Bit mask of SEND10 field.                */
  #define IPCT_OVERFLOW_SEND_SEND10_Min (0x0UL)      /*!< Min enumerator value of SEND10 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND10_Max (0x1UL)      /*!< Max enumerator value of SEND10 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND10_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND10_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */

/* SEND11 @Bit 11 : Overflow status for SEND[11] task */
  #define IPCT_OVERFLOW_SEND_SEND11_Pos (11UL)       /*!< Position of SEND11 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND11_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND11_Pos) /*!< Bit mask of SEND11 field.                */
  #define IPCT_OVERFLOW_SEND_SEND11_Min (0x0UL)      /*!< Min enumerator value of SEND11 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND11_Max (0x1UL)      /*!< Max enumerator value of SEND11 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND11_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND11_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */

/* SEND12 @Bit 12 : Overflow status for SEND[12] task */
  #define IPCT_OVERFLOW_SEND_SEND12_Pos (12UL)       /*!< Position of SEND12 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND12_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND12_Pos) /*!< Bit mask of SEND12 field.                */
  #define IPCT_OVERFLOW_SEND_SEND12_Min (0x0UL)      /*!< Min enumerator value of SEND12 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND12_Max (0x1UL)      /*!< Max enumerator value of SEND12 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND12_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND12_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */

/* SEND13 @Bit 13 : Overflow status for SEND[13] task */
  #define IPCT_OVERFLOW_SEND_SEND13_Pos (13UL)       /*!< Position of SEND13 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND13_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND13_Pos) /*!< Bit mask of SEND13 field.                */
  #define IPCT_OVERFLOW_SEND_SEND13_Min (0x0UL)      /*!< Min enumerator value of SEND13 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND13_Max (0x1UL)      /*!< Max enumerator value of SEND13 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND13_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND13_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */

/* SEND14 @Bit 14 : Overflow status for SEND[14] task */
  #define IPCT_OVERFLOW_SEND_SEND14_Pos (14UL)       /*!< Position of SEND14 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND14_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND14_Pos) /*!< Bit mask of SEND14 field.                */
  #define IPCT_OVERFLOW_SEND_SEND14_Min (0x0UL)      /*!< Min enumerator value of SEND14 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND14_Max (0x1UL)      /*!< Max enumerator value of SEND14 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND14_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND14_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */

