tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* IPCT_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define IPCT_PUBLISH_RECEIVE_MaxCount (16UL)       /*!< Max size of PUBLISH_RECEIVE[16] array.                               */
  #define IPCT_PUBLISH_RECEIVE_MaxIndex (15UL)       /*!< Max index of PUBLISH_RECEIVE[16] array.                              */
  #define IPCT_PUBLISH_RECEIVE_MinIndex (0UL)        /*!< Min index of PUBLISH_RECEIVE[16] array.                              */
  #define IPCT_PUBLISH_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RECEIVE[16] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_RECEIVE_EN_Msk (0x1UL << IPCT_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define IPCT_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* IPCT_PUBLISH_ACKED: Publish configuration for event ACKED[n] */
  #define IPCT_PUBLISH_ACKED_MaxCount (16UL)         /*!< Max size of PUBLISH_ACKED[16] array.                                 */
  #define IPCT_PUBLISH_ACKED_MaxIndex (15UL)         /*!< Max index of PUBLISH_ACKED[16] array.                                */
  #define IPCT_PUBLISH_ACKED_MinIndex (0UL)          /*!< Min index of PUBLISH_ACKED[16] array.                                */
  #define IPCT_PUBLISH_ACKED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ACKED[16] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event ACKED[n] will publish to */
  #define IPCT_PUBLISH_ACKED_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_ACKED_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_ACKED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define IPCT_PUBLISH_ACKED_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_ACKED_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_ACKED_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_ACKED_EN_Msk (0x1UL << IPCT_PUBLISH_ACKED_EN_Pos) /*!< Bit mask of EN field.                            */
  #define IPCT_PUBLISH_ACKED_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_ACKED_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_ACKED_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_ACKED_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* IPCT_SHORTS: Shortcuts between local events and tasks */
  #define IPCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* RECEIVE0_ACK0 @Bit 0 : Shortcut between event RECEIVE[0] and task ACK[0] */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Pos (0UL)        /*!< Position of RECEIVE0_ACK0 field.                                     */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Msk (0x1UL << IPCT_SHORTS_RECEIVE0_ACK0_Pos) /*!< Bit mask of RECEIVE0_ACK0 field.         */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Min (0x0UL)      /*!< Min enumerator value of RECEIVE0_ACK0 field.                         */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Max (0x1UL)      /*!< Max enumerator value of RECEIVE0_ACK0 field.                         */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE0_ACK0_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE1_ACK1 @Bit 1 : Shortcut between event RECEIVE[1] and task ACK[1] */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Pos (1UL)        /*!< Position of RECEIVE1_ACK1 field.                                     */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Msk (0x1UL << IPCT_SHORTS_RECEIVE1_ACK1_Pos) /*!< Bit mask of RECEIVE1_ACK1 field.         */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Min (0x0UL)      /*!< Min enumerator value of RECEIVE1_ACK1 field.                         */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Max (0x1UL)      /*!< Max enumerator value of RECEIVE1_ACK1 field.                         */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE1_ACK1_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE2_ACK2 @Bit 2 : Shortcut between event RECEIVE[2] and task ACK[2] */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Pos (2UL)        /*!< Position of RECEIVE2_ACK2 field.                                     */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Msk (0x1UL << IPCT_SHORTS_RECEIVE2_ACK2_Pos) /*!< Bit mask of RECEIVE2_ACK2 field.         */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Min (0x0UL)      /*!< Min enumerator value of RECEIVE2_ACK2 field.                         */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Max (0x1UL)      /*!< Max enumerator value of RECEIVE2_ACK2 field.                         */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE2_ACK2_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

