tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE3_ACK3 @Bit 3 : Shortcut between event RECEIVE[3] and task ACK[3] */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Pos (3UL)        /*!< Position of RECEIVE3_ACK3 field.                                     */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Msk (0x1UL << IPCT_SHORTS_RECEIVE3_ACK3_Pos) /*!< Bit mask of RECEIVE3_ACK3 field.         */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Min (0x0UL)      /*!< Min enumerator value of RECEIVE3_ACK3 field.                         */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Max (0x1UL)      /*!< Max enumerator value of RECEIVE3_ACK3 field.                         */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE3_ACK3_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE4_ACK4 @Bit 4 : Shortcut between event RECEIVE[4] and task ACK[4] */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Pos (4UL)        /*!< Position of RECEIVE4_ACK4 field.                                     */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Msk (0x1UL << IPCT_SHORTS_RECEIVE4_ACK4_Pos) /*!< Bit mask of RECEIVE4_ACK4 field.         */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Min (0x0UL)      /*!< Min enumerator value of RECEIVE4_ACK4 field.                         */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Max (0x1UL)      /*!< Max enumerator value of RECEIVE4_ACK4 field.                         */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE4_ACK4_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE5_ACK5 @Bit 5 : Shortcut between event RECEIVE[5] and task ACK[5] */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Pos (5UL)        /*!< Position of RECEIVE5_ACK5 field.                                     */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Msk (0x1UL << IPCT_SHORTS_RECEIVE5_ACK5_Pos) /*!< Bit mask of RECEIVE5_ACK5 field.         */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Min (0x0UL)      /*!< Min enumerator value of RECEIVE5_ACK5 field.                         */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Max (0x1UL)      /*!< Max enumerator value of RECEIVE5_ACK5 field.                         */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE5_ACK5_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE6_ACK6 @Bit 6 : Shortcut between event RECEIVE[6] and task ACK[6] */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Pos (6UL)        /*!< Position of RECEIVE6_ACK6 field.                                     */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Msk (0x1UL << IPCT_SHORTS_RECEIVE6_ACK6_Pos) /*!< Bit mask of RECEIVE6_ACK6 field.         */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Min (0x0UL)      /*!< Min enumerator value of RECEIVE6_ACK6 field.                         */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Max (0x1UL)      /*!< Max enumerator value of RECEIVE6_ACK6 field.                         */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE6_ACK6_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE7_ACK7 @Bit 7 : Shortcut between event RECEIVE[7] and task ACK[7] */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Pos (7UL)        /*!< Position of RECEIVE7_ACK7 field.                                     */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Msk (0x1UL << IPCT_SHORTS_RECEIVE7_ACK7_Pos) /*!< Bit mask of RECEIVE7_ACK7 field.         */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Min (0x0UL)      /*!< Min enumerator value of RECEIVE7_ACK7 field.                         */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Max (0x1UL)      /*!< Max enumerator value of RECEIVE7_ACK7 field.                         */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE7_ACK7_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE8_ACK8 @Bit 8 : Shortcut between event RECEIVE[8] and task ACK[8] */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Pos (8UL)        /*!< Position of RECEIVE8_ACK8 field.                                     */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Msk (0x1UL << IPCT_SHORTS_RECEIVE8_ACK8_Pos) /*!< Bit mask of RECEIVE8_ACK8 field.         */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Min (0x0UL)      /*!< Min enumerator value of RECEIVE8_ACK8 field.                         */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Max (0x1UL)      /*!< Max enumerator value of RECEIVE8_ACK8 field.                         */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE8_ACK8_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RECEIVE9_ACK9 @Bit 9 : Shortcut between event RECEIVE[9] and task ACK[9] */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Pos (9UL)        /*!< Position of RECEIVE9_ACK9 field.                                     */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Msk (0x1UL << IPCT_SHORTS_RECEIVE9_ACK9_Pos) /*!< Bit mask of RECEIVE9_ACK9 field.         */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Min (0x0UL)      /*!< Min enumerator value of RECEIVE9_ACK9 field.                         */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Max (0x1UL)      /*!< Max enumerator value of RECEIVE9_ACK9 field.                         */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define IPCT_SHORTS_RECEIVE9_ACK9_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

