tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE10_ACK10 @Bit 10 : Shortcut between event RECEIVE[10] and task ACK[10] */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Pos (10UL)     /*!< Position of RECEIVE10_ACK10 field.                                   */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Msk (0x1UL << IPCT_SHORTS_RECEIVE10_ACK10_Pos) /*!< Bit mask of RECEIVE10_ACK10 field.   */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Min (0x0UL)    /*!< Min enumerator value of RECEIVE10_ACK10 field.                       */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Max (0x1UL)    /*!< Max enumerator value of RECEIVE10_ACK10 field.                       */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE10_ACK10_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE11_ACK11 @Bit 11 : Shortcut between event RECEIVE[11] and task ACK[11] */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Pos (11UL)     /*!< Position of RECEIVE11_ACK11 field.                                   */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Msk (0x1UL << IPCT_SHORTS_RECEIVE11_ACK11_Pos) /*!< Bit mask of RECEIVE11_ACK11 field.   */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Min (0x0UL)    /*!< Min enumerator value of RECEIVE11_ACK11 field.                       */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Max (0x1UL)    /*!< Max enumerator value of RECEIVE11_ACK11 field.                       */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE11_ACK11_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE12_ACK12 @Bit 12 : Shortcut between event RECEIVE[12] and task ACK[12] */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Pos (12UL)     /*!< Position of RECEIVE12_ACK12 field.                                   */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Msk (0x1UL << IPCT_SHORTS_RECEIVE12_ACK12_Pos) /*!< Bit mask of RECEIVE12_ACK12 field.   */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Min (0x0UL)    /*!< Min enumerator value of RECEIVE12_ACK12 field.                       */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Max (0x1UL)    /*!< Max enumerator value of RECEIVE12_ACK12 field.                       */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE12_ACK12_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE13_ACK13 @Bit 13 : Shortcut between event RECEIVE[13] and task ACK[13] */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Pos (13UL)     /*!< Position of RECEIVE13_ACK13 field.                                   */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Msk (0x1UL << IPCT_SHORTS_RECEIVE13_ACK13_Pos) /*!< Bit mask of RECEIVE13_ACK13 field.   */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Min (0x0UL)    /*!< Min enumerator value of RECEIVE13_ACK13 field.                       */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Max (0x1UL)    /*!< Max enumerator value of RECEIVE13_ACK13 field.                       */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE13_ACK13_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE14_ACK14 @Bit 14 : Shortcut between event RECEIVE[14] and task ACK[14] */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Pos (14UL)     /*!< Position of RECEIVE14_ACK14 field.                                   */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Msk (0x1UL << IPCT_SHORTS_RECEIVE14_ACK14_Pos) /*!< Bit mask of RECEIVE14_ACK14 field.   */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Min (0x0UL)    /*!< Min enumerator value of RECEIVE14_ACK14 field.                       */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Max (0x1UL)    /*!< Max enumerator value of RECEIVE14_ACK14 field.                       */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE14_ACK14_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE15_ACK15 @Bit 15 : Shortcut between event RECEIVE[15] and task ACK[15] */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Pos (15UL)     /*!< Position of RECEIVE15_ACK15 field.                                   */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Msk (0x1UL << IPCT_SHORTS_RECEIVE15_ACK15_Pos) /*!< Bit mask of RECEIVE15_ACK15 field.   */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Min (0x0UL)    /*!< Min enumerator value of RECEIVE15_ACK15 field.                       */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Max (0x1UL)    /*!< Max enumerator value of RECEIVE15_ACK15 field.                       */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE15_ACK15_Enabled (0x1UL) /*!< Enable shortcut                                                     */


/* IPCT_INTEN0: Enable or disable interrupt */
  #define IPCT_INTEN0_ResetValue (0x00000000UL)      /*!< Reset value of INTEN0 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN0_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN0_RECEIVE0_Msk (0x1UL << IPCT_INTEN0_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN0_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN0_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN0_RECEIVE1_Msk (0x1UL << IPCT_INTEN0_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN0_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN0_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN0_RECEIVE2_Msk (0x1UL << IPCT_INTEN0_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN0_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN0_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN0_RECEIVE3_Msk (0x1UL << IPCT_INTEN0_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN0_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN0_RECEIVE4_Pos (4UL)             /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTEN0_RECEIVE4_Msk (0x1UL << IPCT_INTEN0_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                        */
  #define IPCT_INTEN0_RECEIVE4_Min (0x0UL)           /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN0_RECEIVE4_Max (0x1UL)           /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN0_RECEIVE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN0_RECEIVE5_Pos (5UL)             /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTEN0_RECEIVE5_Msk (0x1UL << IPCT_INTEN0_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                        */
  #define IPCT_INTEN0_RECEIVE5_Min (0x0UL)           /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN0_RECEIVE5_Max (0x1UL)           /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN0_RECEIVE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE5_Enabled (0x1UL)       /*!< Enable                                                               */

