tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED12 @Bit 28 : Write '1' to enable interrupt for event ACKED[12] */
  #define IPCT_INTENSET0_ACKED12_Pos (28UL)          /*!< Position of ACKED12 field.                                           */
  #define IPCT_INTENSET0_ACKED12_Msk (0x1UL << IPCT_INTENSET0_ACKED12_Pos) /*!< Bit mask of ACKED12 field.                     */
  #define IPCT_INTENSET0_ACKED12_Min (0x0UL)         /*!< Min enumerator value of ACKED12 field.                               */
  #define IPCT_INTENSET0_ACKED12_Max (0x1UL)         /*!< Max enumerator value of ACKED12 field.                               */
  #define IPCT_INTENSET0_ACKED12_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET0_ACKED12_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET0_ACKED12_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED13 @Bit 29 : Write '1' to enable interrupt for event ACKED[13] */
  #define IPCT_INTENSET0_ACKED13_Pos (29UL)          /*!< Position of ACKED13 field.                                           */
  #define IPCT_INTENSET0_ACKED13_Msk (0x1UL << IPCT_INTENSET0_ACKED13_Pos) /*!< Bit mask of ACKED13 field.                     */
  #define IPCT_INTENSET0_ACKED13_Min (0x0UL)         /*!< Min enumerator value of ACKED13 field.                               */
  #define IPCT_INTENSET0_ACKED13_Max (0x1UL)         /*!< Max enumerator value of ACKED13 field.                               */
  #define IPCT_INTENSET0_ACKED13_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET0_ACKED13_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET0_ACKED13_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED14 @Bit 30 : Write '1' to enable interrupt for event ACKED[14] */
  #define IPCT_INTENSET0_ACKED14_Pos (30UL)          /*!< Position of ACKED14 field.                                           */
  #define IPCT_INTENSET0_ACKED14_Msk (0x1UL << IPCT_INTENSET0_ACKED14_Pos) /*!< Bit mask of ACKED14 field.                     */
  #define IPCT_INTENSET0_ACKED14_Min (0x0UL)         /*!< Min enumerator value of ACKED14 field.                               */
  #define IPCT_INTENSET0_ACKED14_Max (0x1UL)         /*!< Max enumerator value of ACKED14 field.                               */
  #define IPCT_INTENSET0_ACKED14_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET0_ACKED14_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET0_ACKED14_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED15 @Bit 31 : Write '1' to enable interrupt for event ACKED[15] */
  #define IPCT_INTENSET0_ACKED15_Pos (31UL)          /*!< Position of ACKED15 field.                                           */
  #define IPCT_INTENSET0_ACKED15_Msk (0x1UL << IPCT_INTENSET0_ACKED15_Pos) /*!< Bit mask of ACKED15 field.                     */
  #define IPCT_INTENSET0_ACKED15_Min (0x0UL)         /*!< Min enumerator value of ACKED15 field.                               */
  #define IPCT_INTENSET0_ACKED15_Max (0x1UL)         /*!< Max enumerator value of ACKED15 field.                               */
  #define IPCT_INTENSET0_ACKED15_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET0_ACKED15_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET0_ACKED15_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* IPCT_INTENCLR0: Disable interrupt */
  #define IPCT_INTENCLR0_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR0 register.                                   */

/* RECEIVE0 @Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
  #define IPCT_INTENCLR0_RECEIVE0_Pos (0UL)          /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE0_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                  */
  #define IPCT_INTENCLR0_RECEIVE0_Min (0x0UL)        /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR0_RECEIVE0_Max (0x1UL)        /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTENCLR0_RECEIVE0_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE1 @Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
  #define IPCT_INTENCLR0_RECEIVE1_Pos (1UL)          /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE1_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                  */
  #define IPCT_INTENCLR0_RECEIVE1_Min (0x0UL)        /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR0_RECEIVE1_Max (0x1UL)        /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTENCLR0_RECEIVE1_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE2 @Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
  #define IPCT_INTENCLR0_RECEIVE2_Pos (2UL)          /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE2_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                  */
  #define IPCT_INTENCLR0_RECEIVE2_Min (0x0UL)        /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR0_RECEIVE2_Max (0x1UL)        /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTENCLR0_RECEIVE2_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

