tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE3 @Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
  #define IPCT_INTENCLR0_RECEIVE3_Pos (3UL)          /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE3_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                  */
  #define IPCT_INTENCLR0_RECEIVE3_Min (0x0UL)        /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTENCLR0_RECEIVE3_Max (0x1UL)        /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTENCLR0_RECEIVE3_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE3_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE3_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE4 @Bit 4 : Write '1' to disable interrupt for event RECEIVE[4] */
  #define IPCT_INTENCLR0_RECEIVE4_Pos (4UL)          /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE4_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                  */
  #define IPCT_INTENCLR0_RECEIVE4_Min (0x0UL)        /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTENCLR0_RECEIVE4_Max (0x1UL)        /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTENCLR0_RECEIVE4_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE5 @Bit 5 : Write '1' to disable interrupt for event RECEIVE[5] */
  #define IPCT_INTENCLR0_RECEIVE5_Pos (5UL)          /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE5_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                  */
  #define IPCT_INTENCLR0_RECEIVE5_Min (0x0UL)        /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTENCLR0_RECEIVE5_Max (0x1UL)        /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTENCLR0_RECEIVE5_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE5_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE5_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE6 @Bit 6 : Write '1' to disable interrupt for event RECEIVE[6] */
  #define IPCT_INTENCLR0_RECEIVE6_Pos (6UL)          /*!< Position of RECEIVE6 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE6_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field.                  */
  #define IPCT_INTENCLR0_RECEIVE6_Min (0x0UL)        /*!< Min enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTENCLR0_RECEIVE6_Max (0x1UL)        /*!< Max enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTENCLR0_RECEIVE6_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE6_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE6_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE7 @Bit 7 : Write '1' to disable interrupt for event RECEIVE[7] */
  #define IPCT_INTENCLR0_RECEIVE7_Pos (7UL)          /*!< Position of RECEIVE7 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE7_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field.                  */
  #define IPCT_INTENCLR0_RECEIVE7_Min (0x0UL)        /*!< Min enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTENCLR0_RECEIVE7_Max (0x1UL)        /*!< Max enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTENCLR0_RECEIVE7_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE7_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE7_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE8 @Bit 8 : Write '1' to disable interrupt for event RECEIVE[8] */
  #define IPCT_INTENCLR0_RECEIVE8_Pos (8UL)          /*!< Position of RECEIVE8 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE8_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE8_Pos) /*!< Bit mask of RECEIVE8 field.                  */
  #define IPCT_INTENCLR0_RECEIVE8_Min (0x0UL)        /*!< Min enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTENCLR0_RECEIVE8_Max (0x1UL)        /*!< Max enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTENCLR0_RECEIVE8_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE8_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE8_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE9 @Bit 9 : Write '1' to disable interrupt for event RECEIVE[9] */
  #define IPCT_INTENCLR0_RECEIVE9_Pos (9UL)          /*!< Position of RECEIVE9 field.                                          */
  #define IPCT_INTENCLR0_RECEIVE9_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE9_Pos) /*!< Bit mask of RECEIVE9 field.                  */
  #define IPCT_INTENCLR0_RECEIVE9_Min (0x0UL)        /*!< Min enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTENCLR0_RECEIVE9_Max (0x1UL)        /*!< Max enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTENCLR0_RECEIVE9_Clear (0x1UL)      /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE9_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE9_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RECEIVE10 @Bit 10 : Write '1' to disable interrupt for event RECEIVE[10] */
  #define IPCT_INTENCLR0_RECEIVE10_Pos (10UL)        /*!< Position of RECEIVE10 field.                                         */
  #define IPCT_INTENCLR0_RECEIVE10_Msk (0x1UL << IPCT_INTENCLR0_RECEIVE10_Pos) /*!< Bit mask of RECEIVE10 field.               */
  #define IPCT_INTENCLR0_RECEIVE10_Min (0x0UL)       /*!< Min enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTENCLR0_RECEIVE10_Max (0x1UL)       /*!< Max enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTENCLR0_RECEIVE10_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR0_RECEIVE10_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR0_RECEIVE10_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

