tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE14 @Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
  #define IPCT_INTEN3_RECEIVE14_Pos (14UL)           /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTEN3_RECEIVE14_Msk (0x1UL << IPCT_INTEN3_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.                     */
  #define IPCT_INTEN3_RECEIVE14_Min (0x0UL)          /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTEN3_RECEIVE14_Max (0x1UL)          /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTEN3_RECEIVE14_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN3_RECEIVE14_Enabled (0x1UL)      /*!< Enable                                                               */

/* RECEIVE15 @Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
  #define IPCT_INTEN3_RECEIVE15_Pos (15UL)           /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTEN3_RECEIVE15_Msk (0x1UL << IPCT_INTEN3_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.                     */
  #define IPCT_INTEN3_RECEIVE15_Min (0x0UL)          /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTEN3_RECEIVE15_Max (0x1UL)          /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTEN3_RECEIVE15_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN3_RECEIVE15_Enabled (0x1UL)      /*!< Enable                                                               */

/* ACKED0 @Bit 16 : Enable or disable interrupt for event ACKED[0] */
  #define IPCT_INTEN3_ACKED0_Pos (16UL)              /*!< Position of ACKED0 field.                                            */
  #define IPCT_INTEN3_ACKED0_Msk (0x1UL << IPCT_INTEN3_ACKED0_Pos) /*!< Bit mask of ACKED0 field.                              */
  #define IPCT_INTEN3_ACKED0_Min (0x0UL)             /*!< Min enumerator value of ACKED0 field.                                */
  #define IPCT_INTEN3_ACKED0_Max (0x1UL)             /*!< Max enumerator value of ACKED0 field.                                */
  #define IPCT_INTEN3_ACKED0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED0_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED1 @Bit 17 : Enable or disable interrupt for event ACKED[1] */
  #define IPCT_INTEN3_ACKED1_Pos (17UL)              /*!< Position of ACKED1 field.                                            */
  #define IPCT_INTEN3_ACKED1_Msk (0x1UL << IPCT_INTEN3_ACKED1_Pos) /*!< Bit mask of ACKED1 field.                              */
  #define IPCT_INTEN3_ACKED1_Min (0x0UL)             /*!< Min enumerator value of ACKED1 field.                                */
  #define IPCT_INTEN3_ACKED1_Max (0x1UL)             /*!< Max enumerator value of ACKED1 field.                                */
  #define IPCT_INTEN3_ACKED1_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED1_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED2 @Bit 18 : Enable or disable interrupt for event ACKED[2] */
  #define IPCT_INTEN3_ACKED2_Pos (18UL)              /*!< Position of ACKED2 field.                                            */
  #define IPCT_INTEN3_ACKED2_Msk (0x1UL << IPCT_INTEN3_ACKED2_Pos) /*!< Bit mask of ACKED2 field.                              */
  #define IPCT_INTEN3_ACKED2_Min (0x0UL)             /*!< Min enumerator value of ACKED2 field.                                */
  #define IPCT_INTEN3_ACKED2_Max (0x1UL)             /*!< Max enumerator value of ACKED2 field.                                */
  #define IPCT_INTEN3_ACKED2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED2_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED3 @Bit 19 : Enable or disable interrupt for event ACKED[3] */
  #define IPCT_INTEN3_ACKED3_Pos (19UL)              /*!< Position of ACKED3 field.                                            */
  #define IPCT_INTEN3_ACKED3_Msk (0x1UL << IPCT_INTEN3_ACKED3_Pos) /*!< Bit mask of ACKED3 field.                              */
  #define IPCT_INTEN3_ACKED3_Min (0x0UL)             /*!< Min enumerator value of ACKED3 field.                                */
  #define IPCT_INTEN3_ACKED3_Max (0x1UL)             /*!< Max enumerator value of ACKED3 field.                                */
  #define IPCT_INTEN3_ACKED3_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED3_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED4 @Bit 20 : Enable or disable interrupt for event ACKED[4] */
  #define IPCT_INTEN3_ACKED4_Pos (20UL)              /*!< Position of ACKED4 field.                                            */
  #define IPCT_INTEN3_ACKED4_Msk (0x1UL << IPCT_INTEN3_ACKED4_Pos) /*!< Bit mask of ACKED4 field.                              */
  #define IPCT_INTEN3_ACKED4_Min (0x0UL)             /*!< Min enumerator value of ACKED4 field.                                */
  #define IPCT_INTEN3_ACKED4_Max (0x1UL)             /*!< Max enumerator value of ACKED4 field.                                */
  #define IPCT_INTEN3_ACKED4_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED4_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED5 @Bit 21 : Enable or disable interrupt for event ACKED[5] */
  #define IPCT_INTEN3_ACKED5_Pos (21UL)              /*!< Position of ACKED5 field.                                            */
  #define IPCT_INTEN3_ACKED5_Msk (0x1UL << IPCT_INTEN3_ACKED5_Pos) /*!< Bit mask of ACKED5 field.                              */
  #define IPCT_INTEN3_ACKED5_Min (0x0UL)             /*!< Min enumerator value of ACKED5 field.                                */
  #define IPCT_INTEN3_ACKED5_Max (0x1UL)             /*!< Max enumerator value of ACKED5 field.                                */
  #define IPCT_INTEN3_ACKED5_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED5_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED6 @Bit 22 : Enable or disable interrupt for event ACKED[6] */
  #define IPCT_INTEN3_ACKED6_Pos (22UL)              /*!< Position of ACKED6 field.                                            */
  #define IPCT_INTEN3_ACKED6_Msk (0x1UL << IPCT_INTEN3_ACKED6_Pos) /*!< Bit mask of ACKED6 field.                              */
  #define IPCT_INTEN3_ACKED6_Min (0x0UL)             /*!< Min enumerator value of ACKED6 field.                                */
  #define IPCT_INTEN3_ACKED6_Max (0x1UL)             /*!< Max enumerator value of ACKED6 field.                                */
  #define IPCT_INTEN3_ACKED6_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED6_Enabled (0x1UL)         /*!< Enable                                                               */

