tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED7 @Bit 23 : Enable or disable interrupt for event ACKED[7] */
  #define IPCT_INTEN3_ACKED7_Pos (23UL)              /*!< Position of ACKED7 field.                                            */
  #define IPCT_INTEN3_ACKED7_Msk (0x1UL << IPCT_INTEN3_ACKED7_Pos) /*!< Bit mask of ACKED7 field.                              */
  #define IPCT_INTEN3_ACKED7_Min (0x0UL)             /*!< Min enumerator value of ACKED7 field.                                */
  #define IPCT_INTEN3_ACKED7_Max (0x1UL)             /*!< Max enumerator value of ACKED7 field.                                */
  #define IPCT_INTEN3_ACKED7_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED7_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED8 @Bit 24 : Enable or disable interrupt for event ACKED[8] */
  #define IPCT_INTEN3_ACKED8_Pos (24UL)              /*!< Position of ACKED8 field.                                            */
  #define IPCT_INTEN3_ACKED8_Msk (0x1UL << IPCT_INTEN3_ACKED8_Pos) /*!< Bit mask of ACKED8 field.                              */
  #define IPCT_INTEN3_ACKED8_Min (0x0UL)             /*!< Min enumerator value of ACKED8 field.                                */
  #define IPCT_INTEN3_ACKED8_Max (0x1UL)             /*!< Max enumerator value of ACKED8 field.                                */
  #define IPCT_INTEN3_ACKED8_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED8_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED9 @Bit 25 : Enable or disable interrupt for event ACKED[9] */
  #define IPCT_INTEN3_ACKED9_Pos (25UL)              /*!< Position of ACKED9 field.                                            */
  #define IPCT_INTEN3_ACKED9_Msk (0x1UL << IPCT_INTEN3_ACKED9_Pos) /*!< Bit mask of ACKED9 field.                              */
  #define IPCT_INTEN3_ACKED9_Min (0x0UL)             /*!< Min enumerator value of ACKED9 field.                                */
  #define IPCT_INTEN3_ACKED9_Max (0x1UL)             /*!< Max enumerator value of ACKED9 field.                                */
  #define IPCT_INTEN3_ACKED9_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED9_Enabled (0x1UL)         /*!< Enable                                                               */

/* ACKED10 @Bit 26 : Enable or disable interrupt for event ACKED[10] */
  #define IPCT_INTEN3_ACKED10_Pos (26UL)             /*!< Position of ACKED10 field.                                           */
  #define IPCT_INTEN3_ACKED10_Msk (0x1UL << IPCT_INTEN3_ACKED10_Pos) /*!< Bit mask of ACKED10 field.                           */
  #define IPCT_INTEN3_ACKED10_Min (0x0UL)            /*!< Min enumerator value of ACKED10 field.                               */
  #define IPCT_INTEN3_ACKED10_Max (0x1UL)            /*!< Max enumerator value of ACKED10 field.                               */
  #define IPCT_INTEN3_ACKED10_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED10_Enabled (0x1UL)        /*!< Enable                                                               */

/* ACKED11 @Bit 27 : Enable or disable interrupt for event ACKED[11] */
  #define IPCT_INTEN3_ACKED11_Pos (27UL)             /*!< Position of ACKED11 field.                                           */
  #define IPCT_INTEN3_ACKED11_Msk (0x1UL << IPCT_INTEN3_ACKED11_Pos) /*!< Bit mask of ACKED11 field.                           */
  #define IPCT_INTEN3_ACKED11_Min (0x0UL)            /*!< Min enumerator value of ACKED11 field.                               */
  #define IPCT_INTEN3_ACKED11_Max (0x1UL)            /*!< Max enumerator value of ACKED11 field.                               */
  #define IPCT_INTEN3_ACKED11_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED11_Enabled (0x1UL)        /*!< Enable                                                               */

/* ACKED12 @Bit 28 : Enable or disable interrupt for event ACKED[12] */
  #define IPCT_INTEN3_ACKED12_Pos (28UL)             /*!< Position of ACKED12 field.                                           */
  #define IPCT_INTEN3_ACKED12_Msk (0x1UL << IPCT_INTEN3_ACKED12_Pos) /*!< Bit mask of ACKED12 field.                           */
  #define IPCT_INTEN3_ACKED12_Min (0x0UL)            /*!< Min enumerator value of ACKED12 field.                               */
  #define IPCT_INTEN3_ACKED12_Max (0x1UL)            /*!< Max enumerator value of ACKED12 field.                               */
  #define IPCT_INTEN3_ACKED12_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED12_Enabled (0x1UL)        /*!< Enable                                                               */

/* ACKED13 @Bit 29 : Enable or disable interrupt for event ACKED[13] */
  #define IPCT_INTEN3_ACKED13_Pos (29UL)             /*!< Position of ACKED13 field.                                           */
  #define IPCT_INTEN3_ACKED13_Msk (0x1UL << IPCT_INTEN3_ACKED13_Pos) /*!< Bit mask of ACKED13 field.                           */
  #define IPCT_INTEN3_ACKED13_Min (0x0UL)            /*!< Min enumerator value of ACKED13 field.                               */
  #define IPCT_INTEN3_ACKED13_Max (0x1UL)            /*!< Max enumerator value of ACKED13 field.                               */
  #define IPCT_INTEN3_ACKED13_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED13_Enabled (0x1UL)        /*!< Enable                                                               */

/* ACKED14 @Bit 30 : Enable or disable interrupt for event ACKED[14] */
  #define IPCT_INTEN3_ACKED14_Pos (30UL)             /*!< Position of ACKED14 field.                                           */
  #define IPCT_INTEN3_ACKED14_Msk (0x1UL << IPCT_INTEN3_ACKED14_Pos) /*!< Bit mask of ACKED14 field.                           */
  #define IPCT_INTEN3_ACKED14_Min (0x0UL)            /*!< Min enumerator value of ACKED14 field.                               */
  #define IPCT_INTEN3_ACKED14_Max (0x1UL)            /*!< Max enumerator value of ACKED14 field.                               */
  #define IPCT_INTEN3_ACKED14_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN3_ACKED14_Enabled (0x1UL)        /*!< Enable                                                               */

