tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED7 @Bit 23 : Write '1' to disable interrupt for event ACKED[7] */
  #define IPCT_INTENCLR4_ACKED7_Pos (23UL)           /*!< Position of ACKED7 field.                                            */
  #define IPCT_INTENCLR4_ACKED7_Msk (0x1UL << IPCT_INTENCLR4_ACKED7_Pos) /*!< Bit mask of ACKED7 field.                        */
  #define IPCT_INTENCLR4_ACKED7_Min (0x0UL)          /*!< Min enumerator value of ACKED7 field.                                */
  #define IPCT_INTENCLR4_ACKED7_Max (0x1UL)          /*!< Max enumerator value of ACKED7 field.                                */
  #define IPCT_INTENCLR4_ACKED7_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED7_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED7_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED8 @Bit 24 : Write '1' to disable interrupt for event ACKED[8] */
  #define IPCT_INTENCLR4_ACKED8_Pos (24UL)           /*!< Position of ACKED8 field.                                            */
  #define IPCT_INTENCLR4_ACKED8_Msk (0x1UL << IPCT_INTENCLR4_ACKED8_Pos) /*!< Bit mask of ACKED8 field.                        */
  #define IPCT_INTENCLR4_ACKED8_Min (0x0UL)          /*!< Min enumerator value of ACKED8 field.                                */
  #define IPCT_INTENCLR4_ACKED8_Max (0x1UL)          /*!< Max enumerator value of ACKED8 field.                                */
  #define IPCT_INTENCLR4_ACKED8_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED8_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED8_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED9 @Bit 25 : Write '1' to disable interrupt for event ACKED[9] */
  #define IPCT_INTENCLR4_ACKED9_Pos (25UL)           /*!< Position of ACKED9 field.                                            */
  #define IPCT_INTENCLR4_ACKED9_Msk (0x1UL << IPCT_INTENCLR4_ACKED9_Pos) /*!< Bit mask of ACKED9 field.                        */
  #define IPCT_INTENCLR4_ACKED9_Min (0x0UL)          /*!< Min enumerator value of ACKED9 field.                                */
  #define IPCT_INTENCLR4_ACKED9_Max (0x1UL)          /*!< Max enumerator value of ACKED9 field.                                */
  #define IPCT_INTENCLR4_ACKED9_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED9_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED9_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED10 @Bit 26 : Write '1' to disable interrupt for event ACKED[10] */
  #define IPCT_INTENCLR4_ACKED10_Pos (26UL)          /*!< Position of ACKED10 field.                                           */
  #define IPCT_INTENCLR4_ACKED10_Msk (0x1UL << IPCT_INTENCLR4_ACKED10_Pos) /*!< Bit mask of ACKED10 field.                     */
  #define IPCT_INTENCLR4_ACKED10_Min (0x0UL)         /*!< Min enumerator value of ACKED10 field.                               */
  #define IPCT_INTENCLR4_ACKED10_Max (0x1UL)         /*!< Max enumerator value of ACKED10 field.                               */
  #define IPCT_INTENCLR4_ACKED10_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED10_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED10_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED11 @Bit 27 : Write '1' to disable interrupt for event ACKED[11] */
  #define IPCT_INTENCLR4_ACKED11_Pos (27UL)          /*!< Position of ACKED11 field.                                           */
  #define IPCT_INTENCLR4_ACKED11_Msk (0x1UL << IPCT_INTENCLR4_ACKED11_Pos) /*!< Bit mask of ACKED11 field.                     */
  #define IPCT_INTENCLR4_ACKED11_Min (0x0UL)         /*!< Min enumerator value of ACKED11 field.                               */
  #define IPCT_INTENCLR4_ACKED11_Max (0x1UL)         /*!< Max enumerator value of ACKED11 field.                               */
  #define IPCT_INTENCLR4_ACKED11_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED11_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED11_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED12 @Bit 28 : Write '1' to disable interrupt for event ACKED[12] */
  #define IPCT_INTENCLR4_ACKED12_Pos (28UL)          /*!< Position of ACKED12 field.                                           */
  #define IPCT_INTENCLR4_ACKED12_Msk (0x1UL << IPCT_INTENCLR4_ACKED12_Pos) /*!< Bit mask of ACKED12 field.                     */
  #define IPCT_INTENCLR4_ACKED12_Min (0x0UL)         /*!< Min enumerator value of ACKED12 field.                               */
  #define IPCT_INTENCLR4_ACKED12_Max (0x1UL)         /*!< Max enumerator value of ACKED12 field.                               */
  #define IPCT_INTENCLR4_ACKED12_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED12_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED12_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED13 @Bit 29 : Write '1' to disable interrupt for event ACKED[13] */
  #define IPCT_INTENCLR4_ACKED13_Pos (29UL)          /*!< Position of ACKED13 field.                                           */
  #define IPCT_INTENCLR4_ACKED13_Msk (0x1UL << IPCT_INTENCLR4_ACKED13_Pos) /*!< Bit mask of ACKED13 field.                     */
  #define IPCT_INTENCLR4_ACKED13_Min (0x0UL)         /*!< Min enumerator value of ACKED13 field.                               */
  #define IPCT_INTENCLR4_ACKED13_Max (0x1UL)         /*!< Max enumerator value of ACKED13 field.                               */
  #define IPCT_INTENCLR4_ACKED13_Clear (0x1UL)       /*!< Disable                                                              */
  #define IPCT_INTENCLR4_ACKED13_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR4_ACKED13_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

