tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED11 @Bit 27 : Read pending status of interrupt for event ACKED[11] */
  #define IPCT_INTPEND4_ACKED11_Pos (27UL)           /*!< Position of ACKED11 field.                                           */
  #define IPCT_INTPEND4_ACKED11_Msk (0x1UL << IPCT_INTPEND4_ACKED11_Pos) /*!< Bit mask of ACKED11 field.                       */
  #define IPCT_INTPEND4_ACKED11_Min (0x0UL)          /*!< Min enumerator value of ACKED11 field.                               */
  #define IPCT_INTPEND4_ACKED11_Max (0x1UL)          /*!< Max enumerator value of ACKED11 field.                               */
  #define IPCT_INTPEND4_ACKED11_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND4_ACKED11_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED12 @Bit 28 : Read pending status of interrupt for event ACKED[12] */
  #define IPCT_INTPEND4_ACKED12_Pos (28UL)           /*!< Position of ACKED12 field.                                           */
  #define IPCT_INTPEND4_ACKED12_Msk (0x1UL << IPCT_INTPEND4_ACKED12_Pos) /*!< Bit mask of ACKED12 field.                       */
  #define IPCT_INTPEND4_ACKED12_Min (0x0UL)          /*!< Min enumerator value of ACKED12 field.                               */
  #define IPCT_INTPEND4_ACKED12_Max (0x1UL)          /*!< Max enumerator value of ACKED12 field.                               */
  #define IPCT_INTPEND4_ACKED12_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND4_ACKED12_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED13 @Bit 29 : Read pending status of interrupt for event ACKED[13] */
  #define IPCT_INTPEND4_ACKED13_Pos (29UL)           /*!< Position of ACKED13 field.                                           */
  #define IPCT_INTPEND4_ACKED13_Msk (0x1UL << IPCT_INTPEND4_ACKED13_Pos) /*!< Bit mask of ACKED13 field.                       */
  #define IPCT_INTPEND4_ACKED13_Min (0x0UL)          /*!< Min enumerator value of ACKED13 field.                               */
  #define IPCT_INTPEND4_ACKED13_Max (0x1UL)          /*!< Max enumerator value of ACKED13 field.                               */
  #define IPCT_INTPEND4_ACKED13_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND4_ACKED13_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED14 @Bit 30 : Read pending status of interrupt for event ACKED[14] */
  #define IPCT_INTPEND4_ACKED14_Pos (30UL)           /*!< Position of ACKED14 field.                                           */
  #define IPCT_INTPEND4_ACKED14_Msk (0x1UL << IPCT_INTPEND4_ACKED14_Pos) /*!< Bit mask of ACKED14 field.                       */
  #define IPCT_INTPEND4_ACKED14_Min (0x0UL)          /*!< Min enumerator value of ACKED14 field.                               */
  #define IPCT_INTPEND4_ACKED14_Max (0x1UL)          /*!< Max enumerator value of ACKED14 field.                               */
  #define IPCT_INTPEND4_ACKED14_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND4_ACKED14_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED15 @Bit 31 : Read pending status of interrupt for event ACKED[15] */
  #define IPCT_INTPEND4_ACKED15_Pos (31UL)           /*!< Position of ACKED15 field.                                           */
  #define IPCT_INTPEND4_ACKED15_Msk (0x1UL << IPCT_INTPEND4_ACKED15_Pos) /*!< Bit mask of ACKED15 field.                       */
  #define IPCT_INTPEND4_ACKED15_Min (0x0UL)          /*!< Min enumerator value of ACKED15 field.                               */
  #define IPCT_INTPEND4_ACKED15_Max (0x1UL)          /*!< Max enumerator value of ACKED15 field.                               */
  #define IPCT_INTPEND4_ACKED15_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND4_ACKED15_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* IPCT_INTEN5: Enable or disable interrupt */
  #define IPCT_INTEN5_ResetValue (0x00000000UL)      /*!< Reset value of INTEN5 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN5_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN5_RECEIVE0_Msk (0x1UL << IPCT_INTEN5_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN5_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN5_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN5_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN5_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN5_RECEIVE1_Msk (0x1UL << IPCT_INTEN5_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN5_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN5_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN5_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN5_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN5_RECEIVE2_Msk (0x1UL << IPCT_INTEN5_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN5_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN5_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN5_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN5_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN5_RECEIVE3_Msk (0x1UL << IPCT_INTEN5_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN5_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN5_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN5_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN5_RECEIVE4_Pos (4UL)             /*!< Position of RECEIVE4 field.                                          */
  #define IPCT_INTEN5_RECEIVE4_Msk (0x1UL << IPCT_INTEN5_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field.                        */
  #define IPCT_INTEN5_RECEIVE4_Min (0x0UL)           /*!< Min enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN5_RECEIVE4_Max (0x1UL)           /*!< Max enumerator value of RECEIVE4 field.                              */
  #define IPCT_INTEN5_RECEIVE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN5_RECEIVE5_Pos (5UL)             /*!< Position of RECEIVE5 field.                                          */
  #define IPCT_INTEN5_RECEIVE5_Msk (0x1UL << IPCT_INTEN5_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field.                        */
  #define IPCT_INTEN5_RECEIVE5_Min (0x0UL)           /*!< Min enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN5_RECEIVE5_Max (0x1UL)           /*!< Max enumerator value of RECEIVE5 field.                              */
  #define IPCT_INTEN5_RECEIVE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN5_RECEIVE5_Enabled (0x1UL)       /*!< Enable                                                               */

