tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED2 @Bit 18 : Write '1' to enable interrupt for event ACKED[2] */
  #define IPCT_INTENSET5_ACKED2_Pos (18UL)           /*!< Position of ACKED2 field.                                            */
  #define IPCT_INTENSET5_ACKED2_Msk (0x1UL << IPCT_INTENSET5_ACKED2_Pos) /*!< Bit mask of ACKED2 field.                        */
  #define IPCT_INTENSET5_ACKED2_Min (0x0UL)          /*!< Min enumerator value of ACKED2 field.                                */
  #define IPCT_INTENSET5_ACKED2_Max (0x1UL)          /*!< Max enumerator value of ACKED2 field.                                */
  #define IPCT_INTENSET5_ACKED2_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED3 @Bit 19 : Write '1' to enable interrupt for event ACKED[3] */
  #define IPCT_INTENSET5_ACKED3_Pos (19UL)           /*!< Position of ACKED3 field.                                            */
  #define IPCT_INTENSET5_ACKED3_Msk (0x1UL << IPCT_INTENSET5_ACKED3_Pos) /*!< Bit mask of ACKED3 field.                        */
  #define IPCT_INTENSET5_ACKED3_Min (0x0UL)          /*!< Min enumerator value of ACKED3 field.                                */
  #define IPCT_INTENSET5_ACKED3_Max (0x1UL)          /*!< Max enumerator value of ACKED3 field.                                */
  #define IPCT_INTENSET5_ACKED3_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED4 @Bit 20 : Write '1' to enable interrupt for event ACKED[4] */
  #define IPCT_INTENSET5_ACKED4_Pos (20UL)           /*!< Position of ACKED4 field.                                            */
  #define IPCT_INTENSET5_ACKED4_Msk (0x1UL << IPCT_INTENSET5_ACKED4_Pos) /*!< Bit mask of ACKED4 field.                        */
  #define IPCT_INTENSET5_ACKED4_Min (0x0UL)          /*!< Min enumerator value of ACKED4 field.                                */
  #define IPCT_INTENSET5_ACKED4_Max (0x1UL)          /*!< Max enumerator value of ACKED4 field.                                */
  #define IPCT_INTENSET5_ACKED4_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED4_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED4_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED5 @Bit 21 : Write '1' to enable interrupt for event ACKED[5] */
  #define IPCT_INTENSET5_ACKED5_Pos (21UL)           /*!< Position of ACKED5 field.                                            */
  #define IPCT_INTENSET5_ACKED5_Msk (0x1UL << IPCT_INTENSET5_ACKED5_Pos) /*!< Bit mask of ACKED5 field.                        */
  #define IPCT_INTENSET5_ACKED5_Min (0x0UL)          /*!< Min enumerator value of ACKED5 field.                                */
  #define IPCT_INTENSET5_ACKED5_Max (0x1UL)          /*!< Max enumerator value of ACKED5 field.                                */
  #define IPCT_INTENSET5_ACKED5_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED5_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED5_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED6 @Bit 22 : Write '1' to enable interrupt for event ACKED[6] */
  #define IPCT_INTENSET5_ACKED6_Pos (22UL)           /*!< Position of ACKED6 field.                                            */
  #define IPCT_INTENSET5_ACKED6_Msk (0x1UL << IPCT_INTENSET5_ACKED6_Pos) /*!< Bit mask of ACKED6 field.                        */
  #define IPCT_INTENSET5_ACKED6_Min (0x0UL)          /*!< Min enumerator value of ACKED6 field.                                */
  #define IPCT_INTENSET5_ACKED6_Max (0x1UL)          /*!< Max enumerator value of ACKED6 field.                                */
  #define IPCT_INTENSET5_ACKED6_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED6_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED6_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED7 @Bit 23 : Write '1' to enable interrupt for event ACKED[7] */
  #define IPCT_INTENSET5_ACKED7_Pos (23UL)           /*!< Position of ACKED7 field.                                            */
  #define IPCT_INTENSET5_ACKED7_Msk (0x1UL << IPCT_INTENSET5_ACKED7_Pos) /*!< Bit mask of ACKED7 field.                        */
  #define IPCT_INTENSET5_ACKED7_Min (0x0UL)          /*!< Min enumerator value of ACKED7 field.                                */
  #define IPCT_INTENSET5_ACKED7_Max (0x1UL)          /*!< Max enumerator value of ACKED7 field.                                */
  #define IPCT_INTENSET5_ACKED7_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED7_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED7_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED8 @Bit 24 : Write '1' to enable interrupt for event ACKED[8] */
  #define IPCT_INTENSET5_ACKED8_Pos (24UL)           /*!< Position of ACKED8 field.                                            */
  #define IPCT_INTENSET5_ACKED8_Msk (0x1UL << IPCT_INTENSET5_ACKED8_Pos) /*!< Bit mask of ACKED8 field.                        */
  #define IPCT_INTENSET5_ACKED8_Min (0x0UL)          /*!< Min enumerator value of ACKED8 field.                                */
  #define IPCT_INTENSET5_ACKED8_Max (0x1UL)          /*!< Max enumerator value of ACKED8 field.                                */
  #define IPCT_INTENSET5_ACKED8_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED8_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED8_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED9 @Bit 25 : Write '1' to enable interrupt for event ACKED[9] */
  #define IPCT_INTENSET5_ACKED9_Pos (25UL)           /*!< Position of ACKED9 field.                                            */
  #define IPCT_INTENSET5_ACKED9_Msk (0x1UL << IPCT_INTENSET5_ACKED9_Pos) /*!< Bit mask of ACKED9 field.                        */
  #define IPCT_INTENSET5_ACKED9_Min (0x0UL)          /*!< Min enumerator value of ACKED9 field.                                */
  #define IPCT_INTENSET5_ACKED9_Max (0x1UL)          /*!< Max enumerator value of ACKED9 field.                                */
  #define IPCT_INTENSET5_ACKED9_Set (0x1UL)          /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED9_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED9_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ACKED10 @Bit 26 : Write '1' to enable interrupt for event ACKED[10] */
  #define IPCT_INTENSET5_ACKED10_Pos (26UL)          /*!< Position of ACKED10 field.                                           */
  #define IPCT_INTENSET5_ACKED10_Msk (0x1UL << IPCT_INTENSET5_ACKED10_Pos) /*!< Bit mask of ACKED10 field.                     */
  #define IPCT_INTENSET5_ACKED10_Min (0x0UL)         /*!< Min enumerator value of ACKED10 field.                               */
  #define IPCT_INTENSET5_ACKED10_Max (0x1UL)         /*!< Max enumerator value of ACKED10 field.                               */
  #define IPCT_INTENSET5_ACKED10_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED10_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED10_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACKED11 @Bit 27 : Write '1' to enable interrupt for event ACKED[11] */
  #define IPCT_INTENSET5_ACKED11_Pos (27UL)          /*!< Position of ACKED11 field.                                           */
  #define IPCT_INTENSET5_ACKED11_Msk (0x1UL << IPCT_INTENSET5_ACKED11_Pos) /*!< Bit mask of ACKED11 field.                     */
  #define IPCT_INTENSET5_ACKED11_Min (0x0UL)         /*!< Min enumerator value of ACKED11 field.                               */
  #define IPCT_INTENSET5_ACKED11_Max (0x1UL)         /*!< Max enumerator value of ACKED11 field.                               */
  #define IPCT_INTENSET5_ACKED11_Set (0x1UL)         /*!< Enable                                                               */
  #define IPCT_INTENSET5_ACKED11_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define IPCT_INTENSET5_ACKED11_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

