tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE6 @Bit 6 : Read pending status of interrupt for event RECEIVE[6] */
  #define IPCT_INTPEND5_RECEIVE6_Pos (6UL)           /*!< Position of RECEIVE6 field.                                          */
  #define IPCT_INTPEND5_RECEIVE6_Msk (0x1UL << IPCT_INTPEND5_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field.                    */
  #define IPCT_INTPEND5_RECEIVE6_Min (0x0UL)         /*!< Min enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTPEND5_RECEIVE6_Max (0x1UL)         /*!< Max enumerator value of RECEIVE6 field.                              */
  #define IPCT_INTPEND5_RECEIVE6_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE6_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE7 @Bit 7 : Read pending status of interrupt for event RECEIVE[7] */
  #define IPCT_INTPEND5_RECEIVE7_Pos (7UL)           /*!< Position of RECEIVE7 field.                                          */
  #define IPCT_INTPEND5_RECEIVE7_Msk (0x1UL << IPCT_INTPEND5_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field.                    */
  #define IPCT_INTPEND5_RECEIVE7_Min (0x0UL)         /*!< Min enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTPEND5_RECEIVE7_Max (0x1UL)         /*!< Max enumerator value of RECEIVE7 field.                              */
  #define IPCT_INTPEND5_RECEIVE7_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE7_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE8 @Bit 8 : Read pending status of interrupt for event RECEIVE[8] */
  #define IPCT_INTPEND5_RECEIVE8_Pos (8UL)           /*!< Position of RECEIVE8 field.                                          */
  #define IPCT_INTPEND5_RECEIVE8_Msk (0x1UL << IPCT_INTPEND5_RECEIVE8_Pos) /*!< Bit mask of RECEIVE8 field.                    */
  #define IPCT_INTPEND5_RECEIVE8_Min (0x0UL)         /*!< Min enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTPEND5_RECEIVE8_Max (0x1UL)         /*!< Max enumerator value of RECEIVE8 field.                              */
  #define IPCT_INTPEND5_RECEIVE8_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE8_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE9 @Bit 9 : Read pending status of interrupt for event RECEIVE[9] */
  #define IPCT_INTPEND5_RECEIVE9_Pos (9UL)           /*!< Position of RECEIVE9 field.                                          */
  #define IPCT_INTPEND5_RECEIVE9_Msk (0x1UL << IPCT_INTPEND5_RECEIVE9_Pos) /*!< Bit mask of RECEIVE9 field.                    */
  #define IPCT_INTPEND5_RECEIVE9_Min (0x0UL)         /*!< Min enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTPEND5_RECEIVE9_Max (0x1UL)         /*!< Max enumerator value of RECEIVE9 field.                              */
  #define IPCT_INTPEND5_RECEIVE9_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE9_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE10 @Bit 10 : Read pending status of interrupt for event RECEIVE[10] */
  #define IPCT_INTPEND5_RECEIVE10_Pos (10UL)         /*!< Position of RECEIVE10 field.                                         */
  #define IPCT_INTPEND5_RECEIVE10_Msk (0x1UL << IPCT_INTPEND5_RECEIVE10_Pos) /*!< Bit mask of RECEIVE10 field.                 */
  #define IPCT_INTPEND5_RECEIVE10_Min (0x0UL)        /*!< Min enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTPEND5_RECEIVE10_Max (0x1UL)        /*!< Max enumerator value of RECEIVE10 field.                             */
  #define IPCT_INTPEND5_RECEIVE10_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE10_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RECEIVE11 @Bit 11 : Read pending status of interrupt for event RECEIVE[11] */
  #define IPCT_INTPEND5_RECEIVE11_Pos (11UL)         /*!< Position of RECEIVE11 field.                                         */
  #define IPCT_INTPEND5_RECEIVE11_Msk (0x1UL << IPCT_INTPEND5_RECEIVE11_Pos) /*!< Bit mask of RECEIVE11 field.                 */
  #define IPCT_INTPEND5_RECEIVE11_Min (0x0UL)        /*!< Min enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTPEND5_RECEIVE11_Max (0x1UL)        /*!< Max enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTPEND5_RECEIVE11_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE11_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RECEIVE12 @Bit 12 : Read pending status of interrupt for event RECEIVE[12] */
  #define IPCT_INTPEND5_RECEIVE12_Pos (12UL)         /*!< Position of RECEIVE12 field.                                         */
  #define IPCT_INTPEND5_RECEIVE12_Msk (0x1UL << IPCT_INTPEND5_RECEIVE12_Pos) /*!< Bit mask of RECEIVE12 field.                 */
  #define IPCT_INTPEND5_RECEIVE12_Min (0x0UL)        /*!< Min enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTPEND5_RECEIVE12_Max (0x1UL)        /*!< Max enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTPEND5_RECEIVE12_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE12_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RECEIVE13 @Bit 13 : Read pending status of interrupt for event RECEIVE[13] */
  #define IPCT_INTPEND5_RECEIVE13_Pos (13UL)         /*!< Position of RECEIVE13 field.                                         */
  #define IPCT_INTPEND5_RECEIVE13_Msk (0x1UL << IPCT_INTPEND5_RECEIVE13_Pos) /*!< Bit mask of RECEIVE13 field.                 */
  #define IPCT_INTPEND5_RECEIVE13_Min (0x0UL)        /*!< Min enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTPEND5_RECEIVE13_Max (0x1UL)        /*!< Max enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTPEND5_RECEIVE13_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND5_RECEIVE13_Pending (0x1UL)    /*!< Read: Pending                                                        */

