tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RECEIVE14 @Bit 14 : Read pending status of interrupt for event RECEIVE[14] */
  #define IPCT_INTPEND7_RECEIVE14_Pos (14UL)         /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTPEND7_RECEIVE14_Msk (0x1UL << IPCT_INTPEND7_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.                 */
  #define IPCT_INTPEND7_RECEIVE14_Min (0x0UL)        /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTPEND7_RECEIVE14_Max (0x1UL)        /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTPEND7_RECEIVE14_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_RECEIVE14_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* RECEIVE15 @Bit 15 : Read pending status of interrupt for event RECEIVE[15] */
  #define IPCT_INTPEND7_RECEIVE15_Pos (15UL)         /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTPEND7_RECEIVE15_Msk (0x1UL << IPCT_INTPEND7_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.                 */
  #define IPCT_INTPEND7_RECEIVE15_Min (0x0UL)        /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTPEND7_RECEIVE15_Max (0x1UL)        /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTPEND7_RECEIVE15_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_RECEIVE15_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* ACKED0 @Bit 16 : Read pending status of interrupt for event ACKED[0] */
  #define IPCT_INTPEND7_ACKED0_Pos (16UL)            /*!< Position of ACKED0 field.                                            */
  #define IPCT_INTPEND7_ACKED0_Msk (0x1UL << IPCT_INTPEND7_ACKED0_Pos) /*!< Bit mask of ACKED0 field.                          */
  #define IPCT_INTPEND7_ACKED0_Min (0x0UL)           /*!< Min enumerator value of ACKED0 field.                                */
  #define IPCT_INTPEND7_ACKED0_Max (0x1UL)           /*!< Max enumerator value of ACKED0 field.                                */
  #define IPCT_INTPEND7_ACKED0_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED0_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED1 @Bit 17 : Read pending status of interrupt for event ACKED[1] */
  #define IPCT_INTPEND7_ACKED1_Pos (17UL)            /*!< Position of ACKED1 field.                                            */
  #define IPCT_INTPEND7_ACKED1_Msk (0x1UL << IPCT_INTPEND7_ACKED1_Pos) /*!< Bit mask of ACKED1 field.                          */
  #define IPCT_INTPEND7_ACKED1_Min (0x0UL)           /*!< Min enumerator value of ACKED1 field.                                */
  #define IPCT_INTPEND7_ACKED1_Max (0x1UL)           /*!< Max enumerator value of ACKED1 field.                                */
  #define IPCT_INTPEND7_ACKED1_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED1_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED2 @Bit 18 : Read pending status of interrupt for event ACKED[2] */
  #define IPCT_INTPEND7_ACKED2_Pos (18UL)            /*!< Position of ACKED2 field.                                            */
  #define IPCT_INTPEND7_ACKED2_Msk (0x1UL << IPCT_INTPEND7_ACKED2_Pos) /*!< Bit mask of ACKED2 field.                          */
  #define IPCT_INTPEND7_ACKED2_Min (0x0UL)           /*!< Min enumerator value of ACKED2 field.                                */
  #define IPCT_INTPEND7_ACKED2_Max (0x1UL)           /*!< Max enumerator value of ACKED2 field.                                */
  #define IPCT_INTPEND7_ACKED2_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED2_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED3 @Bit 19 : Read pending status of interrupt for event ACKED[3] */
  #define IPCT_INTPEND7_ACKED3_Pos (19UL)            /*!< Position of ACKED3 field.                                            */
  #define IPCT_INTPEND7_ACKED3_Msk (0x1UL << IPCT_INTPEND7_ACKED3_Pos) /*!< Bit mask of ACKED3 field.                          */
  #define IPCT_INTPEND7_ACKED3_Min (0x0UL)           /*!< Min enumerator value of ACKED3 field.                                */
  #define IPCT_INTPEND7_ACKED3_Max (0x1UL)           /*!< Max enumerator value of ACKED3 field.                                */
  #define IPCT_INTPEND7_ACKED3_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED3_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED4 @Bit 20 : Read pending status of interrupt for event ACKED[4] */
  #define IPCT_INTPEND7_ACKED4_Pos (20UL)            /*!< Position of ACKED4 field.                                            */
  #define IPCT_INTPEND7_ACKED4_Msk (0x1UL << IPCT_INTPEND7_ACKED4_Pos) /*!< Bit mask of ACKED4 field.                          */
  #define IPCT_INTPEND7_ACKED4_Min (0x0UL)           /*!< Min enumerator value of ACKED4 field.                                */
  #define IPCT_INTPEND7_ACKED4_Max (0x1UL)           /*!< Max enumerator value of ACKED4 field.                                */
  #define IPCT_INTPEND7_ACKED4_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED4_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED5 @Bit 21 : Read pending status of interrupt for event ACKED[5] */
  #define IPCT_INTPEND7_ACKED5_Pos (21UL)            /*!< Position of ACKED5 field.                                            */
  #define IPCT_INTPEND7_ACKED5_Msk (0x1UL << IPCT_INTPEND7_ACKED5_Pos) /*!< Bit mask of ACKED5 field.                          */
  #define IPCT_INTPEND7_ACKED5_Min (0x0UL)           /*!< Min enumerator value of ACKED5 field.                                */
  #define IPCT_INTPEND7_ACKED5_Max (0x1UL)           /*!< Max enumerator value of ACKED5 field.                                */
  #define IPCT_INTPEND7_ACKED5_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED5_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED6 @Bit 22 : Read pending status of interrupt for event ACKED[6] */
  #define IPCT_INTPEND7_ACKED6_Pos (22UL)            /*!< Position of ACKED6 field.                                            */
  #define IPCT_INTPEND7_ACKED6_Msk (0x1UL << IPCT_INTPEND7_ACKED6_Pos) /*!< Bit mask of ACKED6 field.                          */
  #define IPCT_INTPEND7_ACKED6_Min (0x0UL)           /*!< Min enumerator value of ACKED6 field.                                */
  #define IPCT_INTPEND7_ACKED6_Max (0x1UL)           /*!< Max enumerator value of ACKED6 field.                                */
  #define IPCT_INTPEND7_ACKED6_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED6_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED7 @Bit 23 : Read pending status of interrupt for event ACKED[7] */
  #define IPCT_INTPEND7_ACKED7_Pos (23UL)            /*!< Position of ACKED7 field.                                            */
  #define IPCT_INTPEND7_ACKED7_Msk (0x1UL << IPCT_INTPEND7_ACKED7_Pos) /*!< Bit mask of ACKED7 field.                          */
  #define IPCT_INTPEND7_ACKED7_Min (0x0UL)           /*!< Min enumerator value of ACKED7 field.                                */
  #define IPCT_INTPEND7_ACKED7_Max (0x1UL)           /*!< Max enumerator value of ACKED7 field.                                */
  #define IPCT_INTPEND7_ACKED7_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED7_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED8 @Bit 24 : Read pending status of interrupt for event ACKED[8] */
  #define IPCT_INTPEND7_ACKED8_Pos (24UL)            /*!< Position of ACKED8 field.                                            */
  #define IPCT_INTPEND7_ACKED8_Msk (0x1UL << IPCT_INTPEND7_ACKED8_Pos) /*!< Bit mask of ACKED8 field.                          */
  #define IPCT_INTPEND7_ACKED8_Min (0x0UL)           /*!< Min enumerator value of ACKED8 field.                                */
  #define IPCT_INTPEND7_ACKED8_Max (0x1UL)           /*!< Max enumerator value of ACKED8 field.                                */
  #define IPCT_INTPEND7_ACKED8_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED8_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED9 @Bit 25 : Read pending status of interrupt for event ACKED[9] */
  #define IPCT_INTPEND7_ACKED9_Pos (25UL)            /*!< Position of ACKED9 field.                                            */
  #define IPCT_INTPEND7_ACKED9_Msk (0x1UL << IPCT_INTPEND7_ACKED9_Pos) /*!< Bit mask of ACKED9 field.                          */
  #define IPCT_INTPEND7_ACKED9_Min (0x0UL)           /*!< Min enumerator value of ACKED9 field.                                */
  #define IPCT_INTPEND7_ACKED9_Max (0x1UL)           /*!< Max enumerator value of ACKED9 field.                                */
  #define IPCT_INTPEND7_ACKED9_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED9_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* ACKED10 @Bit 26 : Read pending status of interrupt for event ACKED[10] */
  #define IPCT_INTPEND7_ACKED10_Pos (26UL)           /*!< Position of ACKED10 field.                                           */
  #define IPCT_INTPEND7_ACKED10_Msk (0x1UL << IPCT_INTPEND7_ACKED10_Pos) /*!< Bit mask of ACKED10 field.                       */
  #define IPCT_INTPEND7_ACKED10_Min (0x0UL)          /*!< Min enumerator value of ACKED10 field.                               */
  #define IPCT_INTPEND7_ACKED10_Max (0x1UL)          /*!< Max enumerator value of ACKED10 field.                               */
  #define IPCT_INTPEND7_ACKED10_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED10_Pending (0x1UL)      /*!< Read: Pending                                                        */

