tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACKED11 @Bit 27 : Read pending status of interrupt for event ACKED[11] */
  #define IPCT_INTPEND7_ACKED11_Pos (27UL)           /*!< Position of ACKED11 field.                                           */
  #define IPCT_INTPEND7_ACKED11_Msk (0x1UL << IPCT_INTPEND7_ACKED11_Pos) /*!< Bit mask of ACKED11 field.                       */
  #define IPCT_INTPEND7_ACKED11_Min (0x0UL)          /*!< Min enumerator value of ACKED11 field.                               */
  #define IPCT_INTPEND7_ACKED11_Max (0x1UL)          /*!< Max enumerator value of ACKED11 field.                               */
  #define IPCT_INTPEND7_ACKED11_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED11_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED12 @Bit 28 : Read pending status of interrupt for event ACKED[12] */
  #define IPCT_INTPEND7_ACKED12_Pos (28UL)           /*!< Position of ACKED12 field.                                           */
  #define IPCT_INTPEND7_ACKED12_Msk (0x1UL << IPCT_INTPEND7_ACKED12_Pos) /*!< Bit mask of ACKED12 field.                       */
  #define IPCT_INTPEND7_ACKED12_Min (0x0UL)          /*!< Min enumerator value of ACKED12 field.                               */
  #define IPCT_INTPEND7_ACKED12_Max (0x1UL)          /*!< Max enumerator value of ACKED12 field.                               */
  #define IPCT_INTPEND7_ACKED12_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED12_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED13 @Bit 29 : Read pending status of interrupt for event ACKED[13] */
  #define IPCT_INTPEND7_ACKED13_Pos (29UL)           /*!< Position of ACKED13 field.                                           */
  #define IPCT_INTPEND7_ACKED13_Msk (0x1UL << IPCT_INTPEND7_ACKED13_Pos) /*!< Bit mask of ACKED13 field.                       */
  #define IPCT_INTPEND7_ACKED13_Min (0x0UL)          /*!< Min enumerator value of ACKED13 field.                               */
  #define IPCT_INTPEND7_ACKED13_Max (0x1UL)          /*!< Max enumerator value of ACKED13 field.                               */
  #define IPCT_INTPEND7_ACKED13_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED13_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED14 @Bit 30 : Read pending status of interrupt for event ACKED[14] */
  #define IPCT_INTPEND7_ACKED14_Pos (30UL)           /*!< Position of ACKED14 field.                                           */
  #define IPCT_INTPEND7_ACKED14_Msk (0x1UL << IPCT_INTPEND7_ACKED14_Pos) /*!< Bit mask of ACKED14 field.                       */
  #define IPCT_INTPEND7_ACKED14_Min (0x0UL)          /*!< Min enumerator value of ACKED14 field.                               */
  #define IPCT_INTPEND7_ACKED14_Max (0x1UL)          /*!< Max enumerator value of ACKED14 field.                               */
  #define IPCT_INTPEND7_ACKED14_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED14_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACKED15 @Bit 31 : Read pending status of interrupt for event ACKED[15] */
  #define IPCT_INTPEND7_ACKED15_Pos (31UL)           /*!< Position of ACKED15 field.                                           */
  #define IPCT_INTPEND7_ACKED15_Msk (0x1UL << IPCT_INTPEND7_ACKED15_Pos) /*!< Bit mask of ACKED15 field.                       */
  #define IPCT_INTPEND7_ACKED15_Min (0x0UL)          /*!< Min enumerator value of ACKED15 field.                               */
  #define IPCT_INTPEND7_ACKED15_Max (0x1UL)          /*!< Max enumerator value of ACKED15 field.                               */
  #define IPCT_INTPEND7_ACKED15_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND7_ACKED15_Pending (0x1UL)      /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LPCOMP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct LPCOMP ====================================================== */
/**
  * @brief Low-power comparator
  */
  typedef struct {                                   /*!< LPCOMP Structure                                                     */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value                               */
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) LPCOMP is ready and output is valid                   */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[61];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable LPCOMP                                         */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Input pin select                                      */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference select                                      */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t CONFIGVOLTLVL;                    /*!< (@ 0x00000518) Configure voltage level for analog input              */
    __IM uint32_t RESERVED8;
    __IOM uint32_t ANADETECT;                        /*!< (@ 0x00000520) Analog detect configuration                           */
    __IM uint32_t RESERVED9[5];
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
  } NRF_LPCOMP_Type;                                 /*!< Size = 1340 (0x53C)                                                  */

/* LPCOMP_TASKS_START: Start comparator */
  #define LPCOMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                               */

