tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* READY_SAMPLE @Bit 0 : Shortcut between event READY and task SAMPLE */
  #define LPCOMP_SHORTS_READY_SAMPLE_Pos (0UL)       /*!< Position of READY_SAMPLE field.                                      */
  #define LPCOMP_SHORTS_READY_SAMPLE_Msk (0x1UL << LPCOMP_SHORTS_READY_SAMPLE_Pos) /*!< Bit mask of READY_SAMPLE field.        */
  #define LPCOMP_SHORTS_READY_SAMPLE_Min (0x0UL)     /*!< Min enumerator value of READY_SAMPLE field.                          */
  #define LPCOMP_SHORTS_READY_SAMPLE_Max (0x1UL)     /*!< Max enumerator value of READY_SAMPLE field.                          */
  #define LPCOMP_SHORTS_READY_SAMPLE_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define LPCOMP_SHORTS_READY_SAMPLE_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* READY_STOP @Bit 1 : Shortcut between event READY and task STOP */
  #define LPCOMP_SHORTS_READY_STOP_Pos (1UL)         /*!< Position of READY_STOP field.                                        */
  #define LPCOMP_SHORTS_READY_STOP_Msk (0x1UL << LPCOMP_SHORTS_READY_STOP_Pos) /*!< Bit mask of READY_STOP field.              */
  #define LPCOMP_SHORTS_READY_STOP_Min (0x0UL)       /*!< Min enumerator value of READY_STOP field.                            */
  #define LPCOMP_SHORTS_READY_STOP_Max (0x1UL)       /*!< Max enumerator value of READY_STOP field.                            */
  #define LPCOMP_SHORTS_READY_STOP_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define LPCOMP_SHORTS_READY_STOP_Enabled (0x1UL)   /*!< Enable shortcut                                                      */

/* DOWN_STOP @Bit 2 : Shortcut between event DOWN and task STOP */
  #define LPCOMP_SHORTS_DOWN_STOP_Pos (2UL)          /*!< Position of DOWN_STOP field.                                         */
  #define LPCOMP_SHORTS_DOWN_STOP_Msk (0x1UL << LPCOMP_SHORTS_DOWN_STOP_Pos) /*!< Bit mask of DOWN_STOP field.                 */
  #define LPCOMP_SHORTS_DOWN_STOP_Min (0x0UL)        /*!< Min enumerator value of DOWN_STOP field.                             */
  #define LPCOMP_SHORTS_DOWN_STOP_Max (0x1UL)        /*!< Max enumerator value of DOWN_STOP field.                             */
  #define LPCOMP_SHORTS_DOWN_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define LPCOMP_SHORTS_DOWN_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* UP_STOP @Bit 3 : Shortcut between event UP and task STOP */
  #define LPCOMP_SHORTS_UP_STOP_Pos (3UL)            /*!< Position of UP_STOP field.                                           */
  #define LPCOMP_SHORTS_UP_STOP_Msk (0x1UL << LPCOMP_SHORTS_UP_STOP_Pos) /*!< Bit mask of UP_STOP field.                       */
  #define LPCOMP_SHORTS_UP_STOP_Min (0x0UL)          /*!< Min enumerator value of UP_STOP field.                               */
  #define LPCOMP_SHORTS_UP_STOP_Max (0x1UL)          /*!< Max enumerator value of UP_STOP field.                               */
  #define LPCOMP_SHORTS_UP_STOP_Disabled (0x0UL)     /*!< Disable shortcut                                                     */
  #define LPCOMP_SHORTS_UP_STOP_Enabled (0x1UL)      /*!< Enable shortcut                                                      */

/* CROSS_STOP @Bit 4 : Shortcut between event CROSS and task STOP */
  #define LPCOMP_SHORTS_CROSS_STOP_Pos (4UL)         /*!< Position of CROSS_STOP field.                                        */
  #define LPCOMP_SHORTS_CROSS_STOP_Msk (0x1UL << LPCOMP_SHORTS_CROSS_STOP_Pos) /*!< Bit mask of CROSS_STOP field.              */
  #define LPCOMP_SHORTS_CROSS_STOP_Min (0x0UL)       /*!< Min enumerator value of CROSS_STOP field.                            */
  #define LPCOMP_SHORTS_CROSS_STOP_Max (0x1UL)       /*!< Max enumerator value of CROSS_STOP field.                            */
  #define LPCOMP_SHORTS_CROSS_STOP_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define LPCOMP_SHORTS_CROSS_STOP_Enabled (0x1UL)   /*!< Enable shortcut                                                      */


/* LPCOMP_INTENSET: Enable interrupt */
  #define LPCOMP_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define LPCOMP_INTENSET_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define LPCOMP_INTENSET_READY_Msk (0x1UL << LPCOMP_INTENSET_READY_Pos) /*!< Bit mask of READY field.                         */
  #define LPCOMP_INTENSET_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define LPCOMP_INTENSET_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define LPCOMP_INTENSET_READY_Set (0x1UL)          /*!< Enable                                                               */
  #define LPCOMP_INTENSET_READY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENSET_READY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DOWN @Bit 1 : Write '1' to enable interrupt for event DOWN */
  #define LPCOMP_INTENSET_DOWN_Pos (1UL)             /*!< Position of DOWN field.                                              */
  #define LPCOMP_INTENSET_DOWN_Msk (0x1UL << LPCOMP_INTENSET_DOWN_Pos) /*!< Bit mask of DOWN field.                            */
  #define LPCOMP_INTENSET_DOWN_Min (0x0UL)           /*!< Min enumerator value of DOWN field.                                  */
  #define LPCOMP_INTENSET_DOWN_Max (0x1UL)           /*!< Max enumerator value of DOWN field.                                  */
  #define LPCOMP_INTENSET_DOWN_Set (0x1UL)           /*!< Enable                                                               */
  #define LPCOMP_INTENSET_DOWN_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENSET_DOWN_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* UP @Bit 2 : Write '1' to enable interrupt for event UP */
  #define LPCOMP_INTENSET_UP_Pos (2UL)               /*!< Position of UP field.                                                */
  #define LPCOMP_INTENSET_UP_Msk (0x1UL << LPCOMP_INTENSET_UP_Pos) /*!< Bit mask of UP field.                                  */
  #define LPCOMP_INTENSET_UP_Min (0x0UL)             /*!< Min enumerator value of UP field.                                    */
  #define LPCOMP_INTENSET_UP_Max (0x1UL)             /*!< Max enumerator value of UP field.                                    */
  #define LPCOMP_INTENSET_UP_Set (0x1UL)             /*!< Enable                                                               */
  #define LPCOMP_INTENSET_UP_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENSET_UP_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CROSS @Bit 3 : Write '1' to enable interrupt for event CROSS */
  #define LPCOMP_INTENSET_CROSS_Pos (3UL)            /*!< Position of CROSS field.                                             */
  #define LPCOMP_INTENSET_CROSS_Msk (0x1UL << LPCOMP_INTENSET_CROSS_Pos) /*!< Bit mask of CROSS field.                         */
  #define LPCOMP_INTENSET_CROSS_Min (0x0UL)          /*!< Min enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENSET_CROSS_Max (0x1UL)          /*!< Max enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENSET_CROSS_Set (0x1UL)          /*!< Enable                                                               */
  #define LPCOMP_INTENSET_CROSS_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENSET_CROSS_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


