tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* LPCOMP_INTENCLR: Disable interrupt */
  #define LPCOMP_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define LPCOMP_INTENCLR_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define LPCOMP_INTENCLR_READY_Msk (0x1UL << LPCOMP_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                         */
  #define LPCOMP_INTENCLR_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define LPCOMP_INTENCLR_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define LPCOMP_INTENCLR_READY_Clear (0x1UL)        /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_READY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_READY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DOWN @Bit 1 : Write '1' to disable interrupt for event DOWN */
  #define LPCOMP_INTENCLR_DOWN_Pos (1UL)             /*!< Position of DOWN field.                                              */
  #define LPCOMP_INTENCLR_DOWN_Msk (0x1UL << LPCOMP_INTENCLR_DOWN_Pos) /*!< Bit mask of DOWN field.                            */
  #define LPCOMP_INTENCLR_DOWN_Min (0x0UL)           /*!< Min enumerator value of DOWN field.                                  */
  #define LPCOMP_INTENCLR_DOWN_Max (0x1UL)           /*!< Max enumerator value of DOWN field.                                  */
  #define LPCOMP_INTENCLR_DOWN_Clear (0x1UL)         /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_DOWN_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_DOWN_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* UP @Bit 2 : Write '1' to disable interrupt for event UP */
  #define LPCOMP_INTENCLR_UP_Pos (2UL)               /*!< Position of UP field.                                                */
  #define LPCOMP_INTENCLR_UP_Msk (0x1UL << LPCOMP_INTENCLR_UP_Pos) /*!< Bit mask of UP field.                                  */
  #define LPCOMP_INTENCLR_UP_Min (0x0UL)             /*!< Min enumerator value of UP field.                                    */
  #define LPCOMP_INTENCLR_UP_Max (0x1UL)             /*!< Max enumerator value of UP field.                                    */
  #define LPCOMP_INTENCLR_UP_Clear (0x1UL)           /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_UP_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_UP_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CROSS @Bit 3 : Write '1' to disable interrupt for event CROSS */
  #define LPCOMP_INTENCLR_CROSS_Pos (3UL)            /*!< Position of CROSS field.                                             */
  #define LPCOMP_INTENCLR_CROSS_Msk (0x1UL << LPCOMP_INTENCLR_CROSS_Pos) /*!< Bit mask of CROSS field.                         */
  #define LPCOMP_INTENCLR_CROSS_Min (0x0UL)          /*!< Min enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENCLR_CROSS_Max (0x1UL)          /*!< Max enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENCLR_CROSS_Clear (0x1UL)        /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_CROSS_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_CROSS_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* LPCOMP_RESULT: Compare result */
  #define LPCOMP_RESULT_ResetValue (0x00000000UL)    /*!< Reset value of RESULT register.                                      */

/* RESULT @Bit 0 : Result of last compare. Decision point SAMPLE task. */
  #define LPCOMP_RESULT_RESULT_Pos (0UL)             /*!< Position of RESULT field.                                            */
  #define LPCOMP_RESULT_RESULT_Msk (0x1UL << LPCOMP_RESULT_RESULT_Pos) /*!< Bit mask of RESULT field.                          */
  #define LPCOMP_RESULT_RESULT_Min (0x0UL)           /*!< Min enumerator value of RESULT field.                                */
  #define LPCOMP_RESULT_RESULT_Max (0x1UL)           /*!< Max enumerator value of RESULT field.                                */
  #define LPCOMP_RESULT_RESULT_Below (0x0UL)         /*!< Input voltage is below the reference threshold (VIN+ < VIN-)         */
  #define LPCOMP_RESULT_RESULT_Above (0x1UL)         /*!< Input voltage is above the reference threshold (VIN+ > VIN-)         */


/* LPCOMP_ENABLE: Enable LPCOMP */
  #define LPCOMP_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable LPCOMP */
  #define LPCOMP_ENABLE_ENABLE_Pos (0UL)             /*!< Position of ENABLE field.                                            */
  #define LPCOMP_ENABLE_ENABLE_Msk (0x3UL << LPCOMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */
  #define LPCOMP_ENABLE_ENABLE_Min (0x0UL)           /*!< Min enumerator value of ENABLE field.                                */
  #define LPCOMP_ENABLE_ENABLE_Max (0x1UL)           /*!< Max enumerator value of ENABLE field.                                */
  #define LPCOMP_ENABLE_ENABLE_Disabled (0x0UL)      /*!< Disable                                                              */
  #define LPCOMP_ENABLE_ENABLE_Enabled (0x1UL)       /*!< Enable                                                               */


/* LPCOMP_PSEL: Input pin select */
  #define LPCOMP_PSEL_ResetValue (0x00000000UL)      /*!< Reset value of PSEL register.                                        */

/* PSEL @Bits 0..3 : Analog pin select */
  #define LPCOMP_PSEL_PSEL_Pos (0UL)                 /*!< Position of PSEL field.                                              */
  #define LPCOMP_PSEL_PSEL_Msk (0xFUL << LPCOMP_PSEL_PSEL_Pos) /*!< Bit mask of PSEL field.                                    */
  #define LPCOMP_PSEL_PSEL_Min (0x0UL)               /*!< Min enumerator value of PSEL field.                                  */
  #define LPCOMP_PSEL_PSEL_Max (0x9UL)               /*!< Max enumerator value of PSEL field.                                  */
  #define LPCOMP_PSEL_PSEL_AnalogInput0 (0x0UL)      /*!< AIN0 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput1 (0x1UL)      /*!< AIN1 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput2 (0x2UL)      /*!< AIN2 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput3 (0x3UL)      /*!< AIN3 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput4 (0x4UL)      /*!< AIN4 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput5 (0x5UL)      /*!< AIN5 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput6 (0x6UL)      /*!< AIN6 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput7 (0x7UL)      /*!< AIN7 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput8 (0x8UL)      /*!< AIN8 selected as analog input                                        */
  #define LPCOMP_PSEL_PSEL_AnalogInput9 (0x9UL)      /*!< AIN9 selected as analog input                                        */


/* LPCOMP_REFSEL: Reference select */
  #define LPCOMP_REFSEL_ResetValue (0x00000004UL)    /*!< Reset value of REFSEL register.                                      */

/* REFSEL @Bits 0..3 : Reference select */
  #define LPCOMP_REFSEL_REFSEL_Pos (0UL)             /*!< Position of REFSEL field.                                            */
  #define LPCOMP_REFSEL_REFSEL_Msk (0xFUL << LPCOMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field.                          */
  #define LPCOMP_REFSEL_REFSEL_Min (0x0UL)           /*!< Min enumerator value of REFSEL field.                                */
  #define LPCOMP_REFSEL_REFSEL_Max (0xFUL)           /*!< Max enumerator value of REFSEL field.                                */
  #define LPCOMP_REFSEL_REFSEL_Ref1_8Vdd (0x0UL)     /*!< VDD * 1/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref2_8Vdd (0x1UL)     /*!< VDD * 2/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref3_8Vdd (0x2UL)     /*!< VDD * 3/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref4_8Vdd (0x3UL)     /*!< VDD * 4/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref5_8Vdd (0x4UL)     /*!< VDD * 5/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref6_8Vdd (0x5UL)     /*!< VDD * 6/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref7_8Vdd (0x6UL)     /*!< VDD * 7/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_ARef (0x7UL)          /*!< External analog reference selected                                   */
  #define LPCOMP_REFSEL_REFSEL_Ref1_16Vdd (0x8UL)    /*!< VDD * 1/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref3_16Vdd (0x9UL)    /*!< VDD * 3/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref5_16Vdd (0xAUL)    /*!< VDD * 5/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref7_16Vdd (0xBUL)    /*!< VDD * 7/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref9_16Vdd (0xCUL)    /*!< VDD * 9/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref11_16Vdd (0xDUL)   /*!< VDD * 11/16 selected as reference                                    */
  #define LPCOMP_REFSEL_REFSEL_Ref13_16Vdd (0xEUL)   /*!< VDD * 13/16 selected as reference                                    */
  #define LPCOMP_REFSEL_REFSEL_Ref15_16Vdd (0xFUL)   /*!< VDD * 15/16 selected as reference                                    */


/* LPCOMP_EXTREFSEL: External reference select */
  #define LPCOMP_EXTREFSEL_ResetValue (0x00000000UL) /*!< Reset value of EXTREFSEL register.                                   */

