tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EXTREFSEL @Bit 0 : External analog reference select */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_Pos (0UL)       /*!< Position of EXTREFSEL field.                                         */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_Msk (0x1UL << LPCOMP_EXTREFSEL_EXTREFSEL_Pos) /*!< Bit mask of EXTREFSEL field.           */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_Min (0x0UL)     /*!< Min enumerator value of EXTREFSEL field.                             */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_Max (0x1UL)     /*!< Max enumerator value of EXTREFSEL field.                             */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_AnalogReference0 (0x0UL) /*!< Use AIN0 as external analog reference                       */
  #define LPCOMP_EXTREFSEL_EXTREFSEL_AnalogReference1 (0x1UL) /*!< Use AIN1 as external analog reference                       */


/* LPCOMP_CONFIGVOLTLVL: Configure voltage level for analog input */
  #define LPCOMP_CONFIGVOLTLVL_ResetValue (0x00000000UL) /*!< Reset value of CONFIGVOLTLVL register.                           */

/* EN @Bit 0 : Enable 3.3V on analog input */
  #define LPCOMP_CONFIGVOLTLVL_EN_Pos (0UL)          /*!< Position of EN field.                                                */
  #define LPCOMP_CONFIGVOLTLVL_EN_Msk (0x1UL << LPCOMP_CONFIGVOLTLVL_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LPCOMP_CONFIGVOLTLVL_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_CONFIGVOLTLVL_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_CONFIGVOLTLVL_EN_Disable (0x0UL)    /*!< Disable                                                              */
  #define LPCOMP_CONFIGVOLTLVL_EN_Enable (0x1UL)     /*!< Enable                                                               */


/* LPCOMP_ANADETECT: Analog detect configuration */
  #define LPCOMP_ANADETECT_ResetValue (0x00000000UL) /*!< Reset value of ANADETECT register.                                   */

/* ANADETECT @Bits 0..1 : Analog detect configuration */
  #define LPCOMP_ANADETECT_ANADETECT_Pos (0UL)       /*!< Position of ANADETECT field.                                         */
  #define LPCOMP_ANADETECT_ANADETECT_Msk (0x3UL << LPCOMP_ANADETECT_ANADETECT_Pos) /*!< Bit mask of ANADETECT field.           */
  #define LPCOMP_ANADETECT_ANADETECT_Min (0x0UL)     /*!< Min enumerator value of ANADETECT field.                             */
  #define LPCOMP_ANADETECT_ANADETECT_Max (0x2UL)     /*!< Max enumerator value of ANADETECT field.                             */
  #define LPCOMP_ANADETECT_ANADETECT_Cross (0x0UL)   /*!< Generate ANADETECT on crossing, both upward crossing and downward
                                                          crossing*/
  #define LPCOMP_ANADETECT_ANADETECT_Up (0x1UL)      /*!< Generate ANADETECT on upward crossing only                           */
  #define LPCOMP_ANADETECT_ANADETECT_Down (0x2UL)    /*!< Generate ANADETECT on downward crossing only                         */


/* LPCOMP_HYST: Comparator hysteresis enable */
  #define LPCOMP_HYST_ResetValue (0x00000000UL)      /*!< Reset value of HYST register.                                        */

/* HYST @Bit 0 : Comparator hysteresis enable */
  #define LPCOMP_HYST_HYST_Pos (0UL)                 /*!< Position of HYST field.                                              */
  #define LPCOMP_HYST_HYST_Msk (0x1UL << LPCOMP_HYST_HYST_Pos) /*!< Bit mask of HYST field.                                    */
  #define LPCOMP_HYST_HYST_Min (0x0UL)               /*!< Min enumerator value of HYST field.                                  */
  #define LPCOMP_HYST_HYST_Max (0x1UL)               /*!< Max enumerator value of HYST field.                                  */
  #define LPCOMP_HYST_HYST_Disabled (0x0UL)          /*!< Comparator hysteresis disabled                                       */
  #define LPCOMP_HYST_HYST_Enabled (0x1UL)           /*!< Comparator hysteresis enabled                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LRCCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct LRCCONF_TASKS_CONSTLAT ============================================== */
/**
  * @brief TASKS_CONSTLAT [LRCCONF_TASKS_CONSTLAT] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable constant latency mode                          */
  __OM  uint32_t  DISABLE;                           /*!< (@ 0x00000004) Disable constant latency mode                         */
} NRF_LRCCONF_TASKS_CONSTLAT_Type;                   /*!< Size = 8 (0x008)                                                     */

/* LRCCONF_TASKS_CONSTLAT_ENABLE: Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                         */

/* ENABLE @Bit 0 : Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                        */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Min (0x1UL) /*!< Min enumerator value of ENABLE field.                          */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                          */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Trigger (0x1UL) /*!< Trigger task                                               */


/* LRCCONF_TASKS_CONSTLAT_DISABLE: Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of DISABLE register.                       */

/* DISABLE @Bit 0 : Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos (0UL) /*!< Position of DISABLE field.                                     */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos) /*!< Bit mask of
                                                                            DISABLE field.*/
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Min (0x1UL) /*!< Min enumerator value of DISABLE field.                       */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Max (0x1UL) /*!< Max enumerator value of DISABLE field.                       */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Trigger (0x1UL) /*!< Trigger task                                             */



