tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACTIVE2 @Bit 6 : Retain the active power domain[2] */
  #define LRCCONF_RETAIN_ACTIVE2_Pos (6UL)           /*!< Position of ACTIVE2 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE2_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE2_Pos) /*!< Bit mask of ACTIVE2 field.                     */
  #define LRCCONF_RETAIN_ACTIVE2_Min (0x0UL)         /*!< Min enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Max (0x1UL)         /*!< Max enumerator value of ACTIVE2 field.                               */
  #define LRCCONF_RETAIN_ACTIVE2_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE2_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE3 @Bit 7 : Retain the active power domain[3] */
  #define LRCCONF_RETAIN_ACTIVE3_Pos (7UL)           /*!< Position of ACTIVE3 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE3_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE3_Pos) /*!< Bit mask of ACTIVE3 field.                     */
  #define LRCCONF_RETAIN_ACTIVE3_Min (0x0UL)         /*!< Min enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Max (0x1UL)         /*!< Max enumerator value of ACTIVE3 field.                               */
  #define LRCCONF_RETAIN_ACTIVE3_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE3_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE4 @Bit 8 : Retain the active power domain[4] */
  #define LRCCONF_RETAIN_ACTIVE4_Pos (8UL)           /*!< Position of ACTIVE4 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE4_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE4_Pos) /*!< Bit mask of ACTIVE4 field.                     */
  #define LRCCONF_RETAIN_ACTIVE4_Min (0x0UL)         /*!< Min enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Max (0x1UL)         /*!< Max enumerator value of ACTIVE4 field.                               */
  #define LRCCONF_RETAIN_ACTIVE4_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE4_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE5 @Bit 9 : Retain the active power domain[5] */
  #define LRCCONF_RETAIN_ACTIVE5_Pos (9UL)           /*!< Position of ACTIVE5 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE5_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE5_Pos) /*!< Bit mask of ACTIVE5 field.                     */
  #define LRCCONF_RETAIN_ACTIVE5_Min (0x0UL)         /*!< Min enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Max (0x1UL)         /*!< Max enumerator value of ACTIVE5 field.                               */
  #define LRCCONF_RETAIN_ACTIVE5_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE5_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE6 @Bit 10 : Retain the active power domain[6] */
  #define LRCCONF_RETAIN_ACTIVE6_Pos (10UL)          /*!< Position of ACTIVE6 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE6_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE6_Pos) /*!< Bit mask of ACTIVE6 field.                     */
  #define LRCCONF_RETAIN_ACTIVE6_Min (0x0UL)         /*!< Min enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Max (0x1UL)         /*!< Max enumerator value of ACTIVE6 field.                               */
  #define LRCCONF_RETAIN_ACTIVE6_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE6_Enable (0x1UL)      /*!< Retain enabled                                                       */

/* ACTIVE7 @Bit 11 : Retain the active power domain[7] */
  #define LRCCONF_RETAIN_ACTIVE7_Pos (11UL)          /*!< Position of ACTIVE7 field.                                           */
  #define LRCCONF_RETAIN_ACTIVE7_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE7_Pos) /*!< Bit mask of ACTIVE7 field.                     */
  #define LRCCONF_RETAIN_ACTIVE7_Min (0x0UL)         /*!< Min enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Max (0x1UL)         /*!< Max enumerator value of ACTIVE7 field.                               */
  #define LRCCONF_RETAIN_ACTIVE7_Disable (0x0UL)     /*!< Retain disabled                                                      */
  #define LRCCONF_RETAIN_ACTIVE7_Enable (0x1UL)      /*!< Retain enabled                                                       */


/* LRCCONF_AX2XWAITSTATES: AX2X bridge waitstates for the domain [n], where n is the Domain ID. */
  #define LRCCONF_AX2XWAITSTATES_MaxCount (16UL)     /*!< Max size of AX2XWAITSTATES[16] array.                                */
  #define LRCCONF_AX2XWAITSTATES_MaxIndex (15UL)     /*!< Max index of AX2XWAITSTATES[16] array.                               */
  #define LRCCONF_AX2XWAITSTATES_MinIndex (0UL)      /*!< Min index of AX2XWAITSTATES[16] array.                               */
  #define LRCCONF_AX2XWAITSTATES_ResetValue (0x00000007UL) /*!< Reset value of AX2XWAITSTATES[16] register.                    */

/* WAITSTATES @Bits 0..2 : Number of waitstates */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos (0UL) /*!< Position of WAITSTATES field.                                       */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Msk (0x7UL << LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MCAN                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct MCAN ======================================================= */
/**
  * @brief MCAN
  */
  typedef struct {                                   /*!< MCAN Structure                                                       */
    __IM uint32_t RESERVED;
    __IM uint32_t ENDN;                              /*!< (@ 0x00000004) Endian Register                                       */
    __IM uint32_t RESERVED1;
    __IOM uint32_t DBTP;                             /*!< (@ 0x0000000C) Data Bit Timing and Prescaler Register                */
    __IOM uint32_t TEST;                             /*!< (@ 0x00000010) Test Register                                         */
    __IOM uint32_t RWD;                              /*!< (@ 0x00000014) RAM Watchdog                                          */
    __IOM uint32_t CCCR;                             /*!< (@ 0x00000018) CC Control Register                                   */
    __IOM uint32_t NBTP;                             /*!< (@ 0x0000001C) Nominal Bit Timing and Prescaler Register             */
    __IOM uint32_t TSCC;                             /*!< (@ 0x00000020) Timestamp Counter Configuration                       */
    __IOM uint32_t TSCV;                             /*!< (@ 0x00000024) Timestamp Counter Value                               */
    __IOM uint32_t TOCC;                             /*!< (@ 0x00000028) Timeout Counter Configuration                         */
    __IOM uint32_t TOCV;                             /*!< (@ 0x0000002C) Timeout Counter Value                                 */
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t ECR;                              /*!< (@ 0x00000040) Error Counter Register                                */
    __IOM uint32_t PSR;                              /*!< (@ 0x00000044) Protocol Status Register                              */
    __IOM uint32_t TDCR;                             /*!< (@ 0x00000048) Transmitter Delay Compensation Register               */
    __IM uint32_t RESERVED3;
    __IOM uint32_t IR;                               /*!< (@ 0x00000050) Interrupt Register                                    */
    __IOM uint32_t IE;                               /*!< (@ 0x00000054) Interrupt Enable                                      */
    __IOM uint32_t ILS;                              /*!< (@ 0x00000058) Interrupt Line Select                                 */
    __IOM uint32_t ILE;                              /*!< (@ 0x0000005C) Interrupt Line Enable                                 */
    __IM uint32_t RESERVED4[8];
    __IOM uint32_t GFC;                              /*!< (@ 0x00000080) Global Filter Configuration                           */
    __IOM uint32_t SIDFC;                            /*!< (@ 0x00000084) Standard ID Filter Configuration                      */
    __IOM uint32_t XIDFC;                            /*!< (@ 0x00000088) Extended ID Filter Configuration                      */
    __IM uint32_t RESERVED5;
    __IOM uint32_t XIDAM;                            /*!< (@ 0x00000090) Extended ID AND Mask                                  */
    __IM uint32_t HPMS;                              /*!< (@ 0x00000094) High Priority Message Status                          */
    __IOM uint32_t NDAT1;                            /*!< (@ 0x00000098) New Data 1                                            */
    __IOM uint32_t NDAT2;                            /*!< (@ 0x0000009C) New Data 2                                            */
    __IOM uint32_t RXF0C;                            /*!< (@ 0x000000A0) Rx FIFO 0 Configuration                               */
    __IM uint32_t RXF0S;                             /*!< (@ 0x000000A4) Rx FIFO 0 Status                                      */
    __IOM uint32_t RXF0A;                            /*!< (@ 0x000000A8) Rx FIFO 0 Acknowledge                                 */
    __IOM uint32_t RXBC;                             /*!< (@ 0x000000AC) Rx Buffer Configuration                               */
    __IOM uint32_t RXF1C;                            /*!< (@ 0x000000B0) Rx FIFO 1 Configuration                               */
    __IM uint32_t RXF1S;                             /*!< (@ 0x000000B4) Rx FIFO 1 Status                                      */
    __IOM uint32_t RXF1A;                            /*!< (@ 0x000000B8) Rx FIFO 1 Acknowledge                                 */
    __IOM uint32_t RXESC;                            /*!< (@ 0x000000BC) Rx Buffer / FIFO Element Size Configuration           */
    __IOM uint32_t TXBC;                             /*!< (@ 0x000000C0) Tx Buffer Configuration                               */
    __IM uint32_t TXFQS;                             /*!< (@ 0x000000C4) Tx FIFO/Queue Status                                  */
    __IOM uint32_t TXESC;                            /*!< (@ 0x000000C8) Tx Buffer Element Size Configuration                  */
    __IM uint32_t TXBRP;                             /*!< (@ 0x000000CC) Tx Buffer Request Pending                             */
    __IOM uint32_t TXBAR;                            /*!< (@ 0x000000D0) Tx Buffer Add Request                                 */
    __IOM uint32_t TXBCR;                            /*!< (@ 0x000000D4) Tx Buffer Cancellation Request                        */
    __IM uint32_t TXBTO;                             /*!< (@ 0x000000D8) Tx Buffer Transmission Occurred                       */
    __IM uint32_t TXBCF;                             /*!< (@ 0x000000DC) Tx Buffer Cancellation Finished                       */
    __IOM uint32_t TXBTIE;                           /*!< (@ 0x000000E0) Tx Buffer Transmission Interrupt Enable               */
    __IOM uint32_t TXBCIE;                           /*!< (@ 0x000000E4) Tx Buffer Cancellation Finished Interrupt Enable      */
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t TXEFC;                            /*!< (@ 0x000000F0) Tx Event FIFO Configuration                           */
    __IM uint32_t TXEFS;                             /*!< (@ 0x000000F4) Tx Event FIFO Status                                  */
    __IOM uint32_t TXEFA;                            /*!< (@ 0x000000F8) Tx Event FIFO Acknowledge                             */
  } NRF_MCAN_Type;                                   /*!< Size = 252 (0x0FC)                                                   */

/* MCAN_ENDN: Endian Register */
  #define MCAN_ENDN_ResetValue (0x00000000UL)        /*!< Reset value of ENDN register.                                        */

/* ETV @Bits 0..31 : Endianness Test Value */
  #define MCAN_ENDN_ETV_Pos (0UL)                    /*!< Position of ETV field.                                               */
  #define MCAN_ENDN_ETV_Msk (0xFFFFFFFFUL << MCAN_ENDN_ETV_Pos) /*!< Bit mask of ETV field.                                    */


/* MCAN_DBTP: Data Bit Timing and Prescaler Register */
  #define MCAN_DBTP_ResetValue (0x00000000UL)        /*!< Reset value of DBTP register.                                        */

/* DSJW @Bits 0..3 : Data (Re)Synchronization Jump Width */
  #define MCAN_DBTP_DSJW_Pos (0UL)                   /*!< Position of DSJW field.                                              */
  #define MCAN_DBTP_DSJW_Msk (0xFUL << MCAN_DBTP_DSJW_Pos) /*!< Bit mask of DSJW field.                                        */

/* DTSEG2 @Bits 4..7 : Data time segment after sample point */
  #define MCAN_DBTP_DTSEG2_Pos (4UL)                 /*!< Position of DTSEG2 field.                                            */
  #define MCAN_DBTP_DTSEG2_Msk (0xFUL << MCAN_DBTP_DTSEG2_Pos) /*!< Bit mask of DTSEG2 field.                                  */

/* DTSEG1 @Bits 8..12 : Data time segment before sample point */
  #define MCAN_DBTP_DTSEG1_Pos (8UL)                 /*!< Position of DTSEG1 field.                                            */
  #define MCAN_DBTP_DTSEG1_Msk (0x1FUL << MCAN_DBTP_DTSEG1_Pos) /*!< Bit mask of DTSEG1 field.                                 */

/* DBRP @Bits 16..20 : Data Bit Rate Prescaler */
  #define MCAN_DBTP_DBRP_Pos (16UL)                  /*!< Position of DBRP field.                                              */
  #define MCAN_DBTP_DBRP_Msk (0x1FUL << MCAN_DBTP_DBRP_Pos) /*!< Bit mask of DBRP field.                                       */

/* TDC @Bit 23 : Transmitter Delay Compensation */
  #define MCAN_DBTP_TDC_Pos (23UL)                   /*!< Position of TDC field.                                               */
  #define MCAN_DBTP_TDC_Msk (0x1UL << MCAN_DBTP_TDC_Pos) /*!< Bit mask of TDC field.                                           */
  #define MCAN_DBTP_TDC_Min (0x0UL)                  /*!< Min enumerator value of TDC field.                                   */
  #define MCAN_DBTP_TDC_Max (0x1UL)                  /*!< Max enumerator value of TDC field.                                   */
  #define MCAN_DBTP_TDC_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define MCAN_DBTP_TDC_Enabled (0x1UL)              /*!< (unspecified)                                                        */


/* MCAN_TEST: Test Register */
  #define MCAN_TEST_ResetValue (0x00000000UL)        /*!< Reset value of TEST register.                                        */

/* LBCK @Bit 4 : Loop Back Mode */
  #define MCAN_TEST_LBCK_Pos (4UL)                   /*!< Position of LBCK field.                                              */
  #define MCAN_TEST_LBCK_Msk (0x1UL << MCAN_TEST_LBCK_Pos) /*!< Bit mask of LBCK field.                                        */
  #define MCAN_TEST_LBCK_Min (0x0UL)                 /*!< Min enumerator value of LBCK field.                                  */
  #define MCAN_TEST_LBCK_Max (0x1UL)                 /*!< Max enumerator value of LBCK field.                                  */
  #define MCAN_TEST_LBCK_Disabled (0x0UL)            /*!< Loop Back Mode is disabled                                           */
  #define MCAN_TEST_LBCK_Enabled (0x1UL)             /*!< Loop Back Mode is enabled                                            */

/* TX @Bits 5..6 : Control of Transmit Pin */
  #define MCAN_TEST_TX_Pos (5UL)                     /*!< Position of TX field.                                                */
  #define MCAN_TEST_TX_Msk (0x3UL << MCAN_TEST_TX_Pos) /*!< Bit mask of TX field.                                              */
  #define MCAN_TEST_TX_Min (0x0UL)                   /*!< Min enumerator value of TX field.                                    */
  #define MCAN_TEST_TX_Max (0x3UL)                   /*!< Max enumerator value of TX field.                                    */
  #define MCAN_TEST_TX_CanCore (0x0UL)               /*!< controlled by the CAN Core, updated at the end of the CAN bit time   */
  #define MCAN_TEST_TX_Monitored (0x1UL)             /*!< Sample Point can be monitored at pin m_can_tx                        */
  #define MCAN_TEST_TX_Dominant (0x2UL)              /*!< Dominant (0) level at pin m_can_tx                                   */
  #define MCAN_TEST_TX_Recessive (0x3UL)             /*!< Recessive (1) at pin m_can_tx                                        */

/* RX @Bit 7 : Receive Pin */
  #define MCAN_TEST_RX_Pos (7UL)                     /*!< Position of RX field.                                                */
  #define MCAN_TEST_RX_Msk (0x1UL << MCAN_TEST_RX_Pos) /*!< Bit mask of RX field.                                              */
  #define MCAN_TEST_RX_Min (0x0UL)                   /*!< Min enumerator value of RX field.                                    */
  #define MCAN_TEST_RX_Max (0x1UL)                   /*!< Max enumerator value of RX field.                                    */
  #define MCAN_TEST_RX_Dominant (0x0UL)              /*!< The CAN bus is dominant (m_can_rx = 0)                               */
  #define MCAN_TEST_RX_Recessive (0x1UL)             /*!< The CAN bus is recessive (m_can_rx = '1')                            */

/* TXBNP @Bits 8..12 : Tx Buffer Number Prepared */
  #define MCAN_TEST_TXBNP_Pos (8UL)                  /*!< Position of TXBNP field.                                             */
  #define MCAN_TEST_TXBNP_Msk (0x1FUL << MCAN_TEST_TXBNP_Pos) /*!< Bit mask of TXBNP field.                                    */

