tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* WMM @Bit 11 : Wide Message Marker */
  #define MCAN_CCCR_WMM_Pos (11UL)                   /*!< Position of WMM field.                                               */
  #define MCAN_CCCR_WMM_Msk (0x1UL << MCAN_CCCR_WMM_Pos) /*!< Bit mask of WMM field.                                           */
  #define MCAN_CCCR_WMM_Min (0x0UL)                  /*!< Min enumerator value of WMM field.                                   */
  #define MCAN_CCCR_WMM_Max (0x1UL)                  /*!< Max enumerator value of WMM field.                                   */
  #define MCAN_CCCR_WMM_Disabled (0x0UL)             /*!< 8-bit Message Marker used                                            */
  #define MCAN_CCCR_WMM_Enabled (0x1UL)              /*!< 16-bit Message Marker used, replacing 16-bit timestamps in Tx Event
                                                          FIFO*/

/* PXHD @Bit 12 : Protocol Exception Handling Disable */
  #define MCAN_CCCR_PXHD_Pos (12UL)                  /*!< Position of PXHD field.                                              */
  #define MCAN_CCCR_PXHD_Msk (0x1UL << MCAN_CCCR_PXHD_Pos) /*!< Bit mask of PXHD field.                                        */
  #define MCAN_CCCR_PXHD_Min (0x0UL)                 /*!< Min enumerator value of PXHD field.                                  */
  #define MCAN_CCCR_PXHD_Max (0x1UL)                 /*!< Max enumerator value of PXHD field.                                  */
  #define MCAN_CCCR_PXHD_Enabled (0x0UL)             /*!< Protocol exception handling enabled                                  */
  #define MCAN_CCCR_PXHD_Disabled (0x1UL)            /*!< Protocol exception handling disabled                                 */

/* EFBI @Bit 13 : Edge Filtering during Bus Integration */
  #define MCAN_CCCR_EFBI_Pos (13UL)                  /*!< Position of EFBI field.                                              */
  #define MCAN_CCCR_EFBI_Msk (0x1UL << MCAN_CCCR_EFBI_Pos) /*!< Bit mask of EFBI field.                                        */
  #define MCAN_CCCR_EFBI_Min (0x0UL)                 /*!< Min enumerator value of EFBI field.                                  */
  #define MCAN_CCCR_EFBI_Max (0x1UL)                 /*!< Max enumerator value of EFBI field.                                  */
  #define MCAN_CCCR_EFBI_Disabled (0x0UL)            /*!< Edge filtering disabled                                              */
  #define MCAN_CCCR_EFBI_Enabled (0x1UL)             /*!< Two consecutive dominant tq required to detect an edge for hard
                                                          synchronization*/

/* TXP @Bit 14 : Transmit Pause */
  #define MCAN_CCCR_TXP_Pos (14UL)                   /*!< Position of TXP field.                                               */
  #define MCAN_CCCR_TXP_Msk (0x1UL << MCAN_CCCR_TXP_Pos) /*!< Bit mask of TXP field.                                           */
  #define MCAN_CCCR_TXP_Min (0x0UL)                  /*!< Min enumerator value of TXP field.                                   */
  #define MCAN_CCCR_TXP_Max (0x1UL)                  /*!< Max enumerator value of TXP field.                                   */
  #define MCAN_CCCR_TXP_Disabled (0x0UL)             /*!< Transmit pause disabled                                              */
  #define MCAN_CCCR_TXP_Enabled (0x1UL)              /*!< Transmit pause enabled                                               */

/* NISO @Bit 15 : Non ISO Operation */
  #define MCAN_CCCR_NISO_Pos (15UL)                  /*!< Position of NISO field.                                              */
  #define MCAN_CCCR_NISO_Msk (0x1UL << MCAN_CCCR_NISO_Pos) /*!< Bit mask of NISO field.                                        */
  #define MCAN_CCCR_NISO_Min (0x0UL)                 /*!< Min enumerator value of NISO field.                                  */
  #define MCAN_CCCR_NISO_Max (0x1UL)                 /*!< Max enumerator value of NISO field.                                  */
  #define MCAN_CCCR_NISO_Disabled (0x0UL)            /*!< CAN FD frame format according to ISO 11898-1:2015                    */
  #define MCAN_CCCR_NISO_Enabled (0x1UL)             /*!< CAN FD frame format according to Bosch CAN FD Specification V1.0     */


/* MCAN_NBTP: Nominal Bit Timing and Prescaler Register */
  #define MCAN_NBTP_ResetValue (0x00000000UL)        /*!< Reset value of NBTP register.                                        */

/* NTSEG2 @Bits 0..6 : Nominal Time segment after sample point */
  #define MCAN_NBTP_NTSEG2_Pos (0UL)                 /*!< Position of NTSEG2 field.                                            */
  #define MCAN_NBTP_NTSEG2_Msk (0x7FUL << MCAN_NBTP_NTSEG2_Pos) /*!< Bit mask of NTSEG2 field.                                 */

/* NTSEG1 @Bits 8..15 : Nominal Time segment before sample point */
  #define MCAN_NBTP_NTSEG1_Pos (8UL)                 /*!< Position of NTSEG1 field.                                            */
  #define MCAN_NBTP_NTSEG1_Msk (0xFFUL << MCAN_NBTP_NTSEG1_Pos) /*!< Bit mask of NTSEG1 field.                                 */

/* NBRP @Bits 16..24 : Nominal Bit Rate Prescaler */
  #define MCAN_NBTP_NBRP_Pos (16UL)                  /*!< Position of NBRP field.                                              */
  #define MCAN_NBTP_NBRP_Msk (0x1FFUL << MCAN_NBTP_NBRP_Pos) /*!< Bit mask of NBRP field.                                      */

/* NSJW @Bits 25..31 : Nominal (Re)Synchronization Jump Width */
  #define MCAN_NBTP_NSJW_Pos (25UL)                  /*!< Position of NSJW field.                                              */
  #define MCAN_NBTP_NSJW_Msk (0x7FUL << MCAN_NBTP_NSJW_Pos) /*!< Bit mask of NSJW field.                                       */


/* MCAN_TSCC: Timestamp Counter Configuration */
  #define MCAN_TSCC_ResetValue (0x00000000UL)        /*!< Reset value of TSCC register.                                        */

/* TSS @Bits 0..1 : Timestamp Select */
  #define MCAN_TSCC_TSS_Pos (0UL)                    /*!< Position of TSS field.                                               */
  #define MCAN_TSCC_TSS_Msk (0x3UL << MCAN_TSCC_TSS_Pos) /*!< Bit mask of TSS field.                                           */
  #define MCAN_TSCC_TSS_Min (0x0UL)                  /*!< Min enumerator value of TSS field.                                   */
  #define MCAN_TSCC_TSS_Max (0x3UL)                  /*!< Max enumerator value of TSS field.                                   */
  #define MCAN_TSCC_TSS_Zero (0x0UL)                 /*!< Timestamp counter value always 0x0000                                */
  #define MCAN_TSCC_TSS_Increment (0x1UL)            /*!< Timestamp counter value incremented according to TCP                 */
  #define MCAN_TSCC_TSS_External (0x2UL)             /*!< External timestamp counter value used                                */
  #define MCAN_TSCC_TSS_Zero0 (0x3UL)                /*!< Same as Zero                                                         */

