tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EW @Bit 6 : Warning Status */
  #define MCAN_PSR_EW_Pos (6UL)                      /*!< Position of EW field.                                                */
  #define MCAN_PSR_EW_Msk (0x1UL << MCAN_PSR_EW_Pos) /*!< Bit mask of EW field.                                                */
  #define MCAN_PSR_EW_Min (0x0UL)                    /*!< Min enumerator value of EW field.                                    */
  #define MCAN_PSR_EW_Max (0x1UL)                    /*!< Max enumerator value of EW field.                                    */
  #define MCAN_PSR_EW_Below (0x0UL)                  /*!< Both error counters are below the Error_Warning limit of 96          */
  #define MCAN_PSR_EW_Reached (0x1UL)                /*!< At least one of error counter has reached the Error_Warning limit of
                                                          96*/

/* BO @Bit 7 : Bus_Off Status */
  #define MCAN_PSR_BO_Pos (7UL)                      /*!< Position of BO field.                                                */
  #define MCAN_PSR_BO_Msk (0x1UL << MCAN_PSR_BO_Pos) /*!< Bit mask of BO field.                                                */
  #define MCAN_PSR_BO_Min (0x0UL)                    /*!< Min enumerator value of BO field.                                    */
  #define MCAN_PSR_BO_Max (0x1UL)                    /*!< Max enumerator value of BO field.                                    */
  #define MCAN_PSR_BO_On (0x0UL)                     /*!< The MCAN is not Bus_Off                                              */
  #define MCAN_PSR_BO_Off (0x1UL)                    /*!< The MCAN is in Bus_Off state                                         */

/* DLEC @Bits 8..10 : Data Phase Last Error Code */
  #define MCAN_PSR_DLEC_Pos (8UL)                    /*!< Position of DLEC field.                                              */
  #define MCAN_PSR_DLEC_Msk (0x7UL << MCAN_PSR_DLEC_Pos) /*!< Bit mask of DLEC field.                                          */

/* RESI @Bit 11 : ESI flag of last received CAN FD Message */
  #define MCAN_PSR_RESI_Pos (11UL)                   /*!< Position of RESI field.                                              */
  #define MCAN_PSR_RESI_Msk (0x1UL << MCAN_PSR_RESI_Pos) /*!< Bit mask of RESI field.                                          */
  #define MCAN_PSR_RESI_Min (0x0UL)                  /*!< Min enumerator value of RESI field.                                  */
  #define MCAN_PSR_RESI_Max (0x1UL)                  /*!< Max enumerator value of RESI field.                                  */
  #define MCAN_PSR_RESI_NotReceived (0x0UL)          /*!< Last received CAN FD message did not ha ve its ESI flag set          */
  #define MCAN_PSR_RESI_Received (0x1UL)             /*!< Last received CAN FD message had its ESI flag set                    */

/* RBRS @Bit 12 : BRS flag of last received CAN FD Message */
  #define MCAN_PSR_RBRS_Pos (12UL)                   /*!< Position of RBRS field.                                              */
  #define MCAN_PSR_RBRS_Msk (0x1UL << MCAN_PSR_RBRS_Pos) /*!< Bit mask of RBRS field.                                          */
  #define MCAN_PSR_RBRS_Min (0x0UL)                  /*!< Min enumerator value of RBRS field.                                  */
  #define MCAN_PSR_RBRS_Max (0x1UL)                  /*!< Max enumerator value of RBRS field.                                  */
  #define MCAN_PSR_RBRS_NotReceived (0x0UL)          /*!< Last received CAN FD message did not ha ve its BRS flag set          */
  #define MCAN_PSR_RBRS_Received (0x1UL)             /*!< Last received CAN FD message had its BRS flag set                    */

/* RFDF @Bit 13 : Received a CAN FD Message */
  #define MCAN_PSR_RFDF_Pos (13UL)                   /*!< Position of RFDF field.                                              */
  #define MCAN_PSR_RFDF_Msk (0x1UL << MCAN_PSR_RFDF_Pos) /*!< Bit mask of RFDF field.                                          */
  #define MCAN_PSR_RFDF_Min (0x0UL)                  /*!< Min enumerator value of RFDF field.                                  */
  #define MCAN_PSR_RFDF_Max (0x1UL)                  /*!< Max enumerator value of RFDF field.                                  */
  #define MCAN_PSR_RFDF_NotReceived (0x0UL)          /*!< Since this bit was reset by the CPU, no CAN FD message has been
                                                          received*/
  #define MCAN_PSR_RFDF_Received (0x1UL)             /*!< Message in CAN FD format with FDF flag set has been received         */

/* PXE @Bit 14 : Protocol Exception Event */
  #define MCAN_PSR_PXE_Pos (14UL)                    /*!< Position of PXE field.                                               */
  #define MCAN_PSR_PXE_Msk (0x1UL << MCAN_PSR_PXE_Pos) /*!< Bit mask of PXE field.                                             */
  #define MCAN_PSR_PXE_Min (0x0UL)                   /*!< Min enumerator value of PXE field.                                   */
  #define MCAN_PSR_PXE_Max (0x1UL)                   /*!< Max enumerator value of PXE field.                                   */
  #define MCAN_PSR_PXE_NotTriggered (0x0UL)          /*!< No protocol exception event occurred since last read access          */
  #define MCAN_PSR_PXE_Triggered (0x1UL)             /*!< Protocol exception event occurred                                    */

/* TDCV @Bits 16..22 : Transmitter Delay Compensation Value */
  #define MCAN_PSR_TDCV_Pos (16UL)                   /*!< Position of TDCV field.                                              */
  #define MCAN_PSR_TDCV_Msk (0x7FUL << MCAN_PSR_TDCV_Pos) /*!< Bit mask of TDCV field.                                         */


/* MCAN_TDCR: Transmitter Delay Compensation Register */
  #define MCAN_TDCR_ResetValue (0x00000000UL)        /*!< Reset value of TDCR register.                                        */

/* TDCF @Bits 0..6 : Transmitter Delay Compensation Filter Window Length */
  #define MCAN_TDCR_TDCF_Pos (0UL)                   /*!< Position of TDCF field.                                              */
  #define MCAN_TDCR_TDCF_Msk (0x7FUL << MCAN_TDCR_TDCF_Pos) /*!< Bit mask of TDCF field.                                       */

/* TDCO @Bits 8..14 : Transmitter Delay Compensation SSP Offset */
  #define MCAN_TDCR_TDCO_Pos (8UL)                   /*!< Position of TDCO field.                                              */
  #define MCAN_TDCR_TDCO_Msk (0x7FUL << MCAN_TDCR_TDCO_Pos) /*!< Bit mask of TDCO field.                                       */


/* MCAN_IR: Interrupt Register */
  #define MCAN_IR_ResetValue (0x00000000UL)          /*!< Reset value of IR register.                                          */

/* RF0N @Bit 0 : Rx FIFO 0 New Message */
  #define MCAN_IR_RF0N_Pos (0UL)                     /*!< Position of RF0N field.                                              */
  #define MCAN_IR_RF0N_Msk (0x1UL << MCAN_IR_RF0N_Pos) /*!< Bit mask of RF0N field.                                            */
  #define MCAN_IR_RF0N_Min (0x0UL)                   /*!< Min enumerator value of RF0N field.                                  */
  #define MCAN_IR_RF0N_Max (0x1UL)                   /*!< Max enumerator value of RF0N field.                                  */
  #define MCAN_IR_RF0N_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF0N_NotGenerated (0x0UL)          /*!< No new message written to Rx FIFO 0                                  */
  #define MCAN_IR_RF0N_Generated (0x1UL)             /*!< New message written to Rx FIFO 0                                     */

/* RF0W @Bit 1 : Rx FIFO 0 Watermark Reached */
  #define MCAN_IR_RF0W_Pos (1UL)                     /*!< Position of RF0W field.                                              */
  #define MCAN_IR_RF0W_Msk (0x1UL << MCAN_IR_RF0W_Pos) /*!< Bit mask of RF0W field.                                            */
  #define MCAN_IR_RF0W_Min (0x0UL)                   /*!< Min enumerator value of RF0W field.                                  */
  #define MCAN_IR_RF0W_Max (0x1UL)                   /*!< Max enumerator value of RF0W field.                                  */
  #define MCAN_IR_RF0W_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF0W_NotGenerated (0x0UL)          /*!< Rx FIFO 0 fill level below watermark                                 */
  #define MCAN_IR_RF0W_Generated (0x1UL)             /*!< Rx FIFO 0 fill level reached watermark                               */

/* RF0F @Bit 2 : Rx FIFO 0 Full */
  #define MCAN_IR_RF0F_Pos (2UL)                     /*!< Position of RF0F field.                                              */
  #define MCAN_IR_RF0F_Msk (0x1UL << MCAN_IR_RF0F_Pos) /*!< Bit mask of RF0F field.                                            */
  #define MCAN_IR_RF0F_Min (0x0UL)                   /*!< Min enumerator value of RF0F field.                                  */
  #define MCAN_IR_RF0F_Max (0x1UL)                   /*!< Max enumerator value of RF0F field.                                  */
  #define MCAN_IR_RF0F_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF0F_NotGenerated (0x0UL)          /*!< Rx FIFO 0 not full                                                   */
  #define MCAN_IR_RF0F_Generated (0x1UL)             /*!< Rx FIFO 0 full                                                       */

/* RF0L @Bit 3 : Rx FIFO 0 Message Lost */
  #define MCAN_IR_RF0L_Pos (3UL)                     /*!< Position of RF0L field.                                              */
  #define MCAN_IR_RF0L_Msk (0x1UL << MCAN_IR_RF0L_Pos) /*!< Bit mask of RF0L field.                                            */
  #define MCAN_IR_RF0L_Min (0x0UL)                   /*!< Min enumerator value of RF0L field.                                  */
  #define MCAN_IR_RF0L_Max (0x1UL)                   /*!< Max enumerator value of RF0L field.                                  */
  #define MCAN_IR_RF0L_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF0L_NotGenerated (0x0UL)          /*!< No Rx FIFO 0 message lost                                            */
  #define MCAN_IR_RF0L_Generated (0x1UL)             /*!< Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of
                                                          size zero*/

/* RF1N @Bit 4 : Rx FIFO 1 New Message */
  #define MCAN_IR_RF1N_Pos (4UL)                     /*!< Position of RF1N field.                                              */
  #define MCAN_IR_RF1N_Msk (0x1UL << MCAN_IR_RF1N_Pos) /*!< Bit mask of RF1N field.                                            */
  #define MCAN_IR_RF1N_Min (0x0UL)                   /*!< Min enumerator value of RF1N field.                                  */
  #define MCAN_IR_RF1N_Max (0x1UL)                   /*!< Max enumerator value of RF1N field.                                  */
  #define MCAN_IR_RF1N_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF1N_NotGenerated (0x0UL)          /*!< No new message written to Rx FIFO 1                                  */
  #define MCAN_IR_RF1N_Generated (0x1UL)             /*!< New message written to Rx FIFO 1                                     */

/* RF1W @Bit 5 : Rx FIFO 1 Watermark Reached */
  #define MCAN_IR_RF1W_Pos (5UL)                     /*!< Position of RF1W field.                                              */
  #define MCAN_IR_RF1W_Msk (0x1UL << MCAN_IR_RF1W_Pos) /*!< Bit mask of RF1W field.                                            */
  #define MCAN_IR_RF1W_Min (0x0UL)                   /*!< Min enumerator value of RF1W field.                                  */
  #define MCAN_IR_RF1W_Max (0x1UL)                   /*!< Max enumerator value of RF1W field.                                  */
  #define MCAN_IR_RF1W_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF1W_NotGenerated (0x0UL)          /*!< Rx FIFO 1 fill level below watermark                                 */
  #define MCAN_IR_RF1W_Generated (0x1UL)             /*!< Rx FIFO 1 fill level reached watermark                               */

/* RF1F @Bit 6 : Rx FIFO 1 Full */
  #define MCAN_IR_RF1F_Pos (6UL)                     /*!< Position of RF1F field.                                              */
  #define MCAN_IR_RF1F_Msk (0x1UL << MCAN_IR_RF1F_Pos) /*!< Bit mask of RF1F field.                                            */
  #define MCAN_IR_RF1F_Min (0x0UL)                   /*!< Min enumerator value of RF1F field.                                  */
  #define MCAN_IR_RF1F_Max (0x1UL)                   /*!< Max enumerator value of RF1F field.                                  */
  #define MCAN_IR_RF1F_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF1F_NotGenerated (0x0UL)          /*!< Rx FIFO 1 not full                                                   */
  #define MCAN_IR_RF1F_Generated (0x1UL)             /*!< Rx FIFO 1 full                                                       */

