tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* WDI @Bit 26 : Watchdog Interrupt */
  #define MCAN_IR_WDI_Pos (26UL)                     /*!< Position of WDI field.                                               */
  #define MCAN_IR_WDI_Msk (0x1UL << MCAN_IR_WDI_Pos) /*!< Bit mask of WDI field.                                               */
  #define MCAN_IR_WDI_Min (0x0UL)                    /*!< Min enumerator value of WDI field.                                   */
  #define MCAN_IR_WDI_Max (0x1UL)                    /*!< Max enumerator value of WDI field.                                   */
  #define MCAN_IR_WDI_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_WDI_NotGenerated (0x0UL)           /*!< No Message RAM Watchdog event occurred                               */
  #define MCAN_IR_WDI_Generated (0x1UL)              /*!< Message RAM Watchdog event due to missing READY                      */

/* PEA @Bit 27 : Protocol Error in Arbitration Phase (Nominal Bit Time is used) */
  #define MCAN_IR_PEA_Pos (27UL)                     /*!< Position of PEA field.                                               */
  #define MCAN_IR_PEA_Msk (0x1UL << MCAN_IR_PEA_Pos) /*!< Bit mask of PEA field.                                               */
  #define MCAN_IR_PEA_Min (0x0UL)                    /*!< Min enumerator value of PEA field.                                   */
  #define MCAN_IR_PEA_Max (0x1UL)                    /*!< Max enumerator value of PEA field.                                   */
  #define MCAN_IR_PEA_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_PEA_NotGenerated (0x0UL)           /*!< No protocol error in arbitration phase                               */
  #define MCAN_IR_PEA_Generated (0x1UL)              /*!< Protocol error in arbitration phase detected (PSR.LEC ≠ 0,7)         */

/* PED @Bit 28 : Protocol Error in Data Phase (Data Bit Time is used) */
  #define MCAN_IR_PED_Pos (28UL)                     /*!< Position of PED field.                                               */
  #define MCAN_IR_PED_Msk (0x1UL << MCAN_IR_PED_Pos) /*!< Bit mask of PED field.                                               */
  #define MCAN_IR_PED_Min (0x0UL)                    /*!< Min enumerator value of PED field.                                   */
  #define MCAN_IR_PED_Max (0x1UL)                    /*!< Max enumerator value of PED field.                                   */
  #define MCAN_IR_PED_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_PED_NotGenerated (0x0UL)           /*!< No protocol error in data phase                                      */
  #define MCAN_IR_PED_Generated (0x1UL)              /*!< Protocol error in data phase detected (PSR.DLEC ≠ 0,7)               */

/* ARA @Bit 29 : Access to Reserved Address */
  #define MCAN_IR_ARA_Pos (29UL)                     /*!< Position of ARA field.                                               */
  #define MCAN_IR_ARA_Msk (0x1UL << MCAN_IR_ARA_Pos) /*!< Bit mask of ARA field.                                               */
  #define MCAN_IR_ARA_Min (0x0UL)                    /*!< Min enumerator value of ARA field.                                   */
  #define MCAN_IR_ARA_Max (0x1UL)                    /*!< Max enumerator value of ARA field.                                   */
  #define MCAN_IR_ARA_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_ARA_NotGenerated (0x0UL)           /*!< No access to reserved address occurred                               */
  #define MCAN_IR_ARA_Generated (0x1UL)              /*!< Access to reserved address occurred                                  */


/* MCAN_IE: Interrupt Enable */
  #define MCAN_IE_ResetValue (0x00000000UL)          /*!< Reset value of IE register.                                          */

/* RF0NE @Bit 0 : Rx FIFO 0 New Message Interrupt Enable */
  #define MCAN_IE_RF0NE_Pos (0UL)                    /*!< Position of RF0NE field.                                             */
  #define MCAN_IE_RF0NE_Msk (0x1UL << MCAN_IE_RF0NE_Pos) /*!< Bit mask of RF0NE field.                                         */
  #define MCAN_IE_RF0NE_Min (0x0UL)                  /*!< Min enumerator value of RF0NE field.                                 */
  #define MCAN_IE_RF0NE_Max (0x1UL)                  /*!< Max enumerator value of RF0NE field.                                 */
  #define MCAN_IE_RF0NE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF0NE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF0WE @Bit 1 : Rx FIFO 0 Watermark Reached Interrupt Enable */
  #define MCAN_IE_RF0WE_Pos (1UL)                    /*!< Position of RF0WE field.                                             */
  #define MCAN_IE_RF0WE_Msk (0x1UL << MCAN_IE_RF0WE_Pos) /*!< Bit mask of RF0WE field.                                         */
  #define MCAN_IE_RF0WE_Min (0x0UL)                  /*!< Min enumerator value of RF0WE field.                                 */
  #define MCAN_IE_RF0WE_Max (0x1UL)                  /*!< Max enumerator value of RF0WE field.                                 */
  #define MCAN_IE_RF0WE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF0WE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF0FE @Bit 2 : Rx FIFO 0 Full Interrupt Enable */
  #define MCAN_IE_RF0FE_Pos (2UL)                    /*!< Position of RF0FE field.                                             */
  #define MCAN_IE_RF0FE_Msk (0x1UL << MCAN_IE_RF0FE_Pos) /*!< Bit mask of RF0FE field.                                         */
  #define MCAN_IE_RF0FE_Min (0x0UL)                  /*!< Min enumerator value of RF0FE field.                                 */
  #define MCAN_IE_RF0FE_Max (0x1UL)                  /*!< Max enumerator value of RF0FE field.                                 */
  #define MCAN_IE_RF0FE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF0FE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF0LE @Bit 3 : Rx FIFO 0 Message Lost Interrupt Enable */
  #define MCAN_IE_RF0LE_Pos (3UL)                    /*!< Position of RF0LE field.                                             */
  #define MCAN_IE_RF0LE_Msk (0x1UL << MCAN_IE_RF0LE_Pos) /*!< Bit mask of RF0LE field.                                         */
  #define MCAN_IE_RF0LE_Min (0x0UL)                  /*!< Min enumerator value of RF0LE field.                                 */
  #define MCAN_IE_RF0LE_Max (0x1UL)                  /*!< Max enumerator value of RF0LE field.                                 */
  #define MCAN_IE_RF0LE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF0LE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF1NE @Bit 4 : Rx FIFO 1 New Message Interrupt Enable */
  #define MCAN_IE_RF1NE_Pos (4UL)                    /*!< Position of RF1NE field.                                             */
  #define MCAN_IE_RF1NE_Msk (0x1UL << MCAN_IE_RF1NE_Pos) /*!< Bit mask of RF1NE field.                                         */
  #define MCAN_IE_RF1NE_Min (0x0UL)                  /*!< Min enumerator value of RF1NE field.                                 */
  #define MCAN_IE_RF1NE_Max (0x1UL)                  /*!< Max enumerator value of RF1NE field.                                 */
  #define MCAN_IE_RF1NE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF1NE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* RF1WE @Bit 5 : Rx FIFO 1 Watermark Reached Interrupt Enable */
  #define MCAN_IE_RF1WE_Pos (5UL)                    /*!< Position of RF1WE field.                                             */
  #define MCAN_IE_RF1WE_Msk (0x1UL << MCAN_IE_RF1WE_Pos) /*!< Bit mask of RF1WE field.                                         */
  #define MCAN_IE_RF1WE_Min (0x0UL)                  /*!< Min enumerator value of RF1WE field.                                 */
  #define MCAN_IE_RF1WE_Max (0x1UL)                  /*!< Max enumerator value of RF1WE field.                                 */
  #define MCAN_IE_RF1WE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_RF1WE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

