tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TSWE @Bit 16 : Timestamp Wraparound Interrupt Enable */
  #define MCAN_IE_TSWE_Pos (16UL)                    /*!< Position of TSWE field.                                              */
  #define MCAN_IE_TSWE_Msk (0x1UL << MCAN_IE_TSWE_Pos) /*!< Bit mask of TSWE field.                                            */
  #define MCAN_IE_TSWE_Min (0x0UL)                   /*!< Min enumerator value of TSWE field.                                  */
  #define MCAN_IE_TSWE_Max (0x1UL)                   /*!< Max enumerator value of TSWE field.                                  */
  #define MCAN_IE_TSWE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TSWE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* MRAFE @Bit 17 : Message RAM Access Failure Interrupt Enable */
  #define MCAN_IE_MRAFE_Pos (17UL)                   /*!< Position of MRAFE field.                                             */
  #define MCAN_IE_MRAFE_Msk (0x1UL << MCAN_IE_MRAFE_Pos) /*!< Bit mask of MRAFE field.                                         */
  #define MCAN_IE_MRAFE_Min (0x0UL)                  /*!< Min enumerator value of MRAFE field.                                 */
  #define MCAN_IE_MRAFE_Max (0x1UL)                  /*!< Max enumerator value of MRAFE field.                                 */
  #define MCAN_IE_MRAFE_Disable (0x0UL)              /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_MRAFE_Enable (0x1UL)               /*!< Interrupt enabled.                                                   */

/* TOOE @Bit 18 : Timeout Occurred Interrupt Enable */
  #define MCAN_IE_TOOE_Pos (18UL)                    /*!< Position of TOOE field.                                              */
  #define MCAN_IE_TOOE_Msk (0x1UL << MCAN_IE_TOOE_Pos) /*!< Bit mask of TOOE field.                                            */
  #define MCAN_IE_TOOE_Min (0x0UL)                   /*!< Min enumerator value of TOOE field.                                  */
  #define MCAN_IE_TOOE_Max (0x1UL)                   /*!< Max enumerator value of TOOE field.                                  */
  #define MCAN_IE_TOOE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_TOOE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* DRXE @Bit 19 : Message stored to Dedicated Rx Buffer Interrupt Enable */
  #define MCAN_IE_DRXE_Pos (19UL)                    /*!< Position of DRXE field.                                              */
  #define MCAN_IE_DRXE_Msk (0x1UL << MCAN_IE_DRXE_Pos) /*!< Bit mask of DRXE field.                                            */
  #define MCAN_IE_DRXE_Min (0x0UL)                   /*!< Min enumerator value of DRXE field.                                  */
  #define MCAN_IE_DRXE_Max (0x1UL)                   /*!< Max enumerator value of DRXE field.                                  */
  #define MCAN_IE_DRXE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_DRXE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* BEUE @Bit 21 : Bus Error Uncorrected Interrupt Enable */
  #define MCAN_IE_BEUE_Pos (21UL)                    /*!< Position of BEUE field.                                              */
  #define MCAN_IE_BEUE_Msk (0x1UL << MCAN_IE_BEUE_Pos) /*!< Bit mask of BEUE field.                                            */
  #define MCAN_IE_BEUE_Min (0x0UL)                   /*!< Min enumerator value of BEUE field.                                  */
  #define MCAN_IE_BEUE_Max (0x1UL)                   /*!< Max enumerator value of BEUE field.                                  */
  #define MCAN_IE_BEUE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_BEUE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* ELOE @Bit 22 : Error Logging Overflow Interrupt Enable */
  #define MCAN_IE_ELOE_Pos (22UL)                    /*!< Position of ELOE field.                                              */
  #define MCAN_IE_ELOE_Msk (0x1UL << MCAN_IE_ELOE_Pos) /*!< Bit mask of ELOE field.                                            */
  #define MCAN_IE_ELOE_Min (0x0UL)                   /*!< Min enumerator value of ELOE field.                                  */
  #define MCAN_IE_ELOE_Max (0x1UL)                   /*!< Max enumerator value of ELOE field.                                  */
  #define MCAN_IE_ELOE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_ELOE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* EPE @Bit 23 : Error Passive Interrupt Enable */
  #define MCAN_IE_EPE_Pos (23UL)                     /*!< Position of EPE field.                                               */
  #define MCAN_IE_EPE_Msk (0x1UL << MCAN_IE_EPE_Pos) /*!< Bit mask of EPE field.                                               */
  #define MCAN_IE_EPE_Min (0x0UL)                    /*!< Min enumerator value of EPE field.                                   */
  #define MCAN_IE_EPE_Max (0x1UL)                    /*!< Max enumerator value of EPE field.                                   */
  #define MCAN_IE_EPE_Disable (0x0UL)                /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_EPE_Enable (0x1UL)                 /*!< Interrupt enabled.                                                   */

/* EWE @Bit 24 : Warning Status Interrupt Enable */
  #define MCAN_IE_EWE_Pos (24UL)                     /*!< Position of EWE field.                                               */
  #define MCAN_IE_EWE_Msk (0x1UL << MCAN_IE_EWE_Pos) /*!< Bit mask of EWE field.                                               */
  #define MCAN_IE_EWE_Min (0x0UL)                    /*!< Min enumerator value of EWE field.                                   */
  #define MCAN_IE_EWE_Max (0x1UL)                    /*!< Max enumerator value of EWE field.                                   */
  #define MCAN_IE_EWE_Disable (0x0UL)                /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_EWE_Enable (0x1UL)                 /*!< Interrupt enabled.                                                   */

/* BOE @Bit 25 : Bus_Off Status Interrupt Enable */
  #define MCAN_IE_BOE_Pos (25UL)                     /*!< Position of BOE field.                                               */
  #define MCAN_IE_BOE_Msk (0x1UL << MCAN_IE_BOE_Pos) /*!< Bit mask of BOE field.                                               */
  #define MCAN_IE_BOE_Min (0x0UL)                    /*!< Min enumerator value of BOE field.                                   */
  #define MCAN_IE_BOE_Max (0x1UL)                    /*!< Max enumerator value of BOE field.                                   */
  #define MCAN_IE_BOE_Disable (0x0UL)                /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_BOE_Enable (0x1UL)                 /*!< Interrupt enabled.                                                   */

