tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* WDIE @Bit 26 : Watchdog Interrupt Enable */
  #define MCAN_IE_WDIE_Pos (26UL)                    /*!< Position of WDIE field.                                              */
  #define MCAN_IE_WDIE_Msk (0x1UL << MCAN_IE_WDIE_Pos) /*!< Bit mask of WDIE field.                                            */
  #define MCAN_IE_WDIE_Min (0x0UL)                   /*!< Min enumerator value of WDIE field.                                  */
  #define MCAN_IE_WDIE_Max (0x1UL)                   /*!< Max enumerator value of WDIE field.                                  */
  #define MCAN_IE_WDIE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_WDIE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* PEAE @Bit 27 : Protocol Error in Arbitration Phase Enable */
  #define MCAN_IE_PEAE_Pos (27UL)                    /*!< Position of PEAE field.                                              */
  #define MCAN_IE_PEAE_Msk (0x1UL << MCAN_IE_PEAE_Pos) /*!< Bit mask of PEAE field.                                            */
  #define MCAN_IE_PEAE_Min (0x0UL)                   /*!< Min enumerator value of PEAE field.                                  */
  #define MCAN_IE_PEAE_Max (0x1UL)                   /*!< Max enumerator value of PEAE field.                                  */
  #define MCAN_IE_PEAE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_PEAE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* PEDE @Bit 28 : Protocol Error in Data Phase Enable */
  #define MCAN_IE_PEDE_Pos (28UL)                    /*!< Position of PEDE field.                                              */
  #define MCAN_IE_PEDE_Msk (0x1UL << MCAN_IE_PEDE_Pos) /*!< Bit mask of PEDE field.                                            */
  #define MCAN_IE_PEDE_Min (0x0UL)                   /*!< Min enumerator value of PEDE field.                                  */
  #define MCAN_IE_PEDE_Max (0x1UL)                   /*!< Max enumerator value of PEDE field.                                  */
  #define MCAN_IE_PEDE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_PEDE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */

/* ARAE @Bit 29 : Access to Reserved Address Enable */
  #define MCAN_IE_ARAE_Pos (29UL)                    /*!< Position of ARAE field.                                              */
  #define MCAN_IE_ARAE_Msk (0x1UL << MCAN_IE_ARAE_Pos) /*!< Bit mask of ARAE field.                                            */
  #define MCAN_IE_ARAE_Min (0x0UL)                   /*!< Min enumerator value of ARAE field.                                  */
  #define MCAN_IE_ARAE_Max (0x1UL)                   /*!< Max enumerator value of ARAE field.                                  */
  #define MCAN_IE_ARAE_Disable (0x0UL)               /*!< Interrupt disabled.                                                  */
  #define MCAN_IE_ARAE_Enable (0x1UL)                /*!< Interrupt enabled.                                                   */


/* MCAN_ILS: Interrupt Line Select */
  #define MCAN_ILS_ResetValue (0x00000000UL)         /*!< Reset value of ILS register.                                         */

/* RF0NL @Bit 0 : Rx FIFO 0 New Message Interrupt Line */
  #define MCAN_ILS_RF0NL_Pos (0UL)                   /*!< Position of RF0NL field.                                             */
  #define MCAN_ILS_RF0NL_Msk (0x1UL << MCAN_ILS_RF0NL_Pos) /*!< Bit mask of RF0NL field.                                       */
  #define MCAN_ILS_RF0NL_Min (0x0UL)                 /*!< Min enumerator value of RF0NL field.                                 */
  #define MCAN_ILS_RF0NL_Max (0x1UL)                 /*!< Max enumerator value of RF0NL field.                                 */
  #define MCAN_ILS_RF0NL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF0NL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF0WL @Bit 1 : Rx FIFO 0 Watermark Reached Interrupt Line */
  #define MCAN_ILS_RF0WL_Pos (1UL)                   /*!< Position of RF0WL field.                                             */
  #define MCAN_ILS_RF0WL_Msk (0x1UL << MCAN_ILS_RF0WL_Pos) /*!< Bit mask of RF0WL field.                                       */
  #define MCAN_ILS_RF0WL_Min (0x0UL)                 /*!< Min enumerator value of RF0WL field.                                 */
  #define MCAN_ILS_RF0WL_Max (0x1UL)                 /*!< Max enumerator value of RF0WL field.                                 */
  #define MCAN_ILS_RF0WL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF0WL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF0FL @Bit 2 : Rx FIFO 0 Full Interrupt Line */
  #define MCAN_ILS_RF0FL_Pos (2UL)                   /*!< Position of RF0FL field.                                             */
  #define MCAN_ILS_RF0FL_Msk (0x1UL << MCAN_ILS_RF0FL_Pos) /*!< Bit mask of RF0FL field.                                       */
  #define MCAN_ILS_RF0FL_Min (0x0UL)                 /*!< Min enumerator value of RF0FL field.                                 */
  #define MCAN_ILS_RF0FL_Max (0x1UL)                 /*!< Max enumerator value of RF0FL field.                                 */
  #define MCAN_ILS_RF0FL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF0FL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF0LL @Bit 3 : Rx FIFO 0 Message Lost Interrupt Line */
  #define MCAN_ILS_RF0LL_Pos (3UL)                   /*!< Position of RF0LL field.                                             */
  #define MCAN_ILS_RF0LL_Msk (0x1UL << MCAN_ILS_RF0LL_Pos) /*!< Bit mask of RF0LL field.                                       */
  #define MCAN_ILS_RF0LL_Min (0x0UL)                 /*!< Min enumerator value of RF0LL field.                                 */
  #define MCAN_ILS_RF0LL_Max (0x1UL)                 /*!< Max enumerator value of RF0LL field.                                 */
  #define MCAN_ILS_RF0LL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF0LL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF1NL @Bit 4 : Rx FIFO 1 New Message Interrupt Line */
  #define MCAN_ILS_RF1NL_Pos (4UL)                   /*!< Position of RF1NL field.                                             */
  #define MCAN_ILS_RF1NL_Msk (0x1UL << MCAN_ILS_RF1NL_Pos) /*!< Bit mask of RF1NL field.                                       */
  #define MCAN_ILS_RF1NL_Min (0x0UL)                 /*!< Min enumerator value of RF1NL field.                                 */
  #define MCAN_ILS_RF1NL_Max (0x1UL)                 /*!< Max enumerator value of RF1NL field.                                 */
  #define MCAN_ILS_RF1NL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF1NL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

