tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EWL @Bit 24 : Warning Status Interrupt Line */
  #define MCAN_ILS_EWL_Pos (24UL)                    /*!< Position of EWL field.                                               */
  #define MCAN_ILS_EWL_Msk (0x1UL << MCAN_ILS_EWL_Pos) /*!< Bit mask of EWL field.                                             */
  #define MCAN_ILS_EWL_Min (0x0UL)                   /*!< Min enumerator value of EWL field.                                   */
  #define MCAN_ILS_EWL_Max (0x1UL)                   /*!< Max enumerator value of EWL field.                                   */
  #define MCAN_ILS_EWL_Assigned0 (0x0UL)             /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_EWL_Assigned1 (0x1UL)             /*!< Interrupt assigned to interrupt line CORE1.                          */

/* BOL @Bit 25 : Bus_Off Status Interrupt Line */
  #define MCAN_ILS_BOL_Pos (25UL)                    /*!< Position of BOL field.                                               */
  #define MCAN_ILS_BOL_Msk (0x1UL << MCAN_ILS_BOL_Pos) /*!< Bit mask of BOL field.                                             */
  #define MCAN_ILS_BOL_Min (0x0UL)                   /*!< Min enumerator value of BOL field.                                   */
  #define MCAN_ILS_BOL_Max (0x1UL)                   /*!< Max enumerator value of BOL field.                                   */
  #define MCAN_ILS_BOL_Assigned0 (0x0UL)             /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_BOL_Assigned1 (0x1UL)             /*!< Interrupt assigned to interrupt line CORE1.                          */

/* WDIL @Bit 26 : Watchdog Interrupt Line */
  #define MCAN_ILS_WDIL_Pos (26UL)                   /*!< Position of WDIL field.                                              */
  #define MCAN_ILS_WDIL_Msk (0x1UL << MCAN_ILS_WDIL_Pos) /*!< Bit mask of WDIL field.                                          */
  #define MCAN_ILS_WDIL_Min (0x0UL)                  /*!< Min enumerator value of WDIL field.                                  */
  #define MCAN_ILS_WDIL_Max (0x1UL)                  /*!< Max enumerator value of WDIL field.                                  */
  #define MCAN_ILS_WDIL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_WDIL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* PEAL @Bit 27 : Protocol Error in Arbitration Phase Line */
  #define MCAN_ILS_PEAL_Pos (27UL)                   /*!< Position of PEAL field.                                              */
  #define MCAN_ILS_PEAL_Msk (0x1UL << MCAN_ILS_PEAL_Pos) /*!< Bit mask of PEAL field.                                          */
  #define MCAN_ILS_PEAL_Min (0x0UL)                  /*!< Min enumerator value of PEAL field.                                  */
  #define MCAN_ILS_PEAL_Max (0x1UL)                  /*!< Max enumerator value of PEAL field.                                  */
  #define MCAN_ILS_PEAL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_PEAL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* PEDL @Bit 28 : Protocol Error in Data Phase Line */
  #define MCAN_ILS_PEDL_Pos (28UL)                   /*!< Position of PEDL field.                                              */
  #define MCAN_ILS_PEDL_Msk (0x1UL << MCAN_ILS_PEDL_Pos) /*!< Bit mask of PEDL field.                                          */
  #define MCAN_ILS_PEDL_Min (0x0UL)                  /*!< Min enumerator value of PEDL field.                                  */
  #define MCAN_ILS_PEDL_Max (0x1UL)                  /*!< Max enumerator value of PEDL field.                                  */
  #define MCAN_ILS_PEDL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_PEDL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* ARAL @Bit 29 : Access to Reserved Address Line */
  #define MCAN_ILS_ARAL_Pos (29UL)                   /*!< Position of ARAL field.                                              */
  #define MCAN_ILS_ARAL_Msk (0x1UL << MCAN_ILS_ARAL_Pos) /*!< Bit mask of ARAL field.                                          */
  #define MCAN_ILS_ARAL_Min (0x0UL)                  /*!< Min enumerator value of ARAL field.                                  */
  #define MCAN_ILS_ARAL_Max (0x1UL)                  /*!< Max enumerator value of ARAL field.                                  */
  #define MCAN_ILS_ARAL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_ARAL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */


/* MCAN_ILE: Interrupt Line Enable */
  #define MCAN_ILE_ResetValue (0x00000000UL)         /*!< Reset value of ILE register.                                         */

/* EINT0 @Bit 0 : Enable Interrupt Line 0 */
  #define MCAN_ILE_EINT0_Pos (0UL)                   /*!< Position of EINT0 field.                                             */
  #define MCAN_ILE_EINT0_Msk (0x1UL << MCAN_ILE_EINT0_Pos) /*!< Bit mask of EINT0 field.                                       */
  #define MCAN_ILE_EINT0_Min (0x0UL)                 /*!< Min enumerator value of EINT0 field.                                 */
  #define MCAN_ILE_EINT0_Max (0x1UL)                 /*!< Max enumerator value of EINT0 field.                                 */
  #define MCAN_ILE_EINT0_Disable (0x0UL)             /*!< Interrupt line CORE0 disabled.                                       */
  #define MCAN_ILE_EINT0_Enable (0x1UL)              /*!< Interrupt line CORE0 enabled.                                        */

/* EINT1 @Bit 1 : Enable Interrupt Line 1 */
  #define MCAN_ILE_EINT1_Pos (1UL)                   /*!< Position of EINT1 field.                                             */
  #define MCAN_ILE_EINT1_Msk (0x1UL << MCAN_ILE_EINT1_Pos) /*!< Bit mask of EINT1 field.                                       */
  #define MCAN_ILE_EINT1_Min (0x0UL)                 /*!< Min enumerator value of EINT1 field.                                 */
  #define MCAN_ILE_EINT1_Max (0x1UL)                 /*!< Max enumerator value of EINT1 field.                                 */
  #define MCAN_ILE_EINT1_Disable (0x0UL)             /*!< Interrupt line CORE1 disabled.                                       */
  #define MCAN_ILE_EINT1_Enable (0x1UL)              /*!< Interrupt line CORE1 enabled.                                        */


/* MCAN_GFC: Global Filter Configuration */
  #define MCAN_GFC_ResetValue (0x00000000UL)         /*!< Reset value of GFC register.                                         */

/* RRFE @Bit 0 : Reject Remote Frames Extended */
  #define MCAN_GFC_RRFE_Pos (0UL)                    /*!< Position of RRFE field.                                              */
  #define MCAN_GFC_RRFE_Msk (0x1UL << MCAN_GFC_RRFE_Pos) /*!< Bit mask of RRFE field.                                          */
  #define MCAN_GFC_RRFE_Min (0x0UL)                  /*!< Min enumerator value of RRFE field.                                  */
  #define MCAN_GFC_RRFE_Max (0x1UL)                  /*!< Max enumerator value of RRFE field.                                  */
  #define MCAN_GFC_RRFE_Filter (0x0UL)               /*!< Filter remote frames with 29-bit extended IDs.                       */
  #define MCAN_GFC_RRFE_Reject (0x1UL)               /*!< Reject all remote frames with 29-bit extended IDs.                   */

/* RRFS @Bit 1 : Reject Remote Frames Standard */
  #define MCAN_GFC_RRFS_Pos (1UL)                    /*!< Position of RRFS field.                                              */
  #define MCAN_GFC_RRFS_Msk (0x1UL << MCAN_GFC_RRFS_Pos) /*!< Bit mask of RRFS field.                                          */
  #define MCAN_GFC_RRFS_Min (0x0UL)                  /*!< Min enumerator value of RRFS field.                                  */
  #define MCAN_GFC_RRFS_Max (0x1UL)                  /*!< Max enumerator value of RRFS field.                                  */
  #define MCAN_GFC_RRFS_Filter (0x0UL)               /*!< Filter remote frames with 11-bit standard IDs.                       */
  #define MCAN_GFC_RRFS_Reject (0x1UL)               /*!< Reject all remote frames with 11-bit standard IDs.                   */

