tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MCAN_RXBC: Rx Buffer Configuration */
  #define MCAN_RXBC_ResetValue (0x00000000UL)        /*!< Reset value of RXBC register.                                        */

/* RBSA @Bits 2..15 : Rx Buffer Start Address */
  #define MCAN_RXBC_RBSA_Pos (2UL)                   /*!< Position of RBSA field.                                              */
  #define MCAN_RXBC_RBSA_Msk (0x3FFFUL << MCAN_RXBC_RBSA_Pos) /*!< Bit mask of RBSA field.                                     */


/* MCAN_RXF1C: Rx FIFO 1 Configuration */
  #define MCAN_RXF1C_ResetValue (0x00000000UL)       /*!< Reset value of RXF1C register.                                       */

/* F1SA @Bits 2..15 : Rx FIFO 1 Start Address */
  #define MCAN_RXF1C_F1SA_Pos (2UL)                  /*!< Position of F1SA field.                                              */
  #define MCAN_RXF1C_F1SA_Msk (0x3FFFUL << MCAN_RXF1C_F1SA_Pos) /*!< Bit mask of F1SA field.                                   */

/* F1S @Bits 16..22 : Rx FIFO 1 Size */
  #define MCAN_RXF1C_F1S_Pos (16UL)                  /*!< Position of F1S field.                                               */
  #define MCAN_RXF1C_F1S_Msk (0x7FUL << MCAN_RXF1C_F1S_Pos) /*!< Bit mask of F1S field.                                        */

/* F1WM @Bits 24..30 : Rx FIFO 1 Watermark */
  #define MCAN_RXF1C_F1WM_Pos (24UL)                 /*!< Position of F1WM field.                                              */
  #define MCAN_RXF1C_F1WM_Msk (0x7FUL << MCAN_RXF1C_F1WM_Pos) /*!< Bit mask of F1WM field.                                     */

/* F1OM @Bit 31 : FIFO 1 Operation Mode */
  #define MCAN_RXF1C_F1OM_Pos (31UL)                 /*!< Position of F1OM field.                                              */
  #define MCAN_RXF1C_F1OM_Msk (0x1UL << MCAN_RXF1C_F1OM_Pos) /*!< Bit mask of F1OM field.                                      */
  #define MCAN_RXF1C_F1OM_Min (0x0UL)                /*!< Min enumerator value of F1OM field.                                  */
  #define MCAN_RXF1C_F1OM_Max (0x1UL)                /*!< Max enumerator value of F1OM field.                                  */
  #define MCAN_RXF1C_F1OM_BlockingMode (0x0UL)       /*!< FIFO 1 blocking mode                                                 */
  #define MCAN_RXF1C_F1OM_OwerwriteMode (0x1UL)      /*!< FIFO 1 overwrite mode                                                */


/* MCAN_RXF1S: Rx FIFO 1 Status */
  #define MCAN_RXF1S_ResetValue (0x00000000UL)       /*!< Reset value of RXF1S register.                                       */

/* F1FL @Bits 0..6 : Rx FIFO 1 Fill Level */
  #define MCAN_RXF1S_F1FL_Pos (0UL)                  /*!< Position of F1FL field.                                              */
  #define MCAN_RXF1S_F1FL_Msk (0x7FUL << MCAN_RXF1S_F1FL_Pos) /*!< Bit mask of F1FL field.                                     */

/* F1GI @Bits 8..13 : Rx FIFO 1 Get Index */
  #define MCAN_RXF1S_F1GI_Pos (8UL)                  /*!< Position of F1GI field.                                              */
  #define MCAN_RXF1S_F1GI_Msk (0x3FUL << MCAN_RXF1S_F1GI_Pos) /*!< Bit mask of F1GI field.                                     */

/* F1PI @Bits 16..21 : Rx FIFO 1 Put Index */
  #define MCAN_RXF1S_F1PI_Pos (16UL)                 /*!< Position of F1PI field.                                              */
  #define MCAN_RXF1S_F1PI_Msk (0x3FUL << MCAN_RXF1S_F1PI_Pos) /*!< Bit mask of F1PI field.                                     */

/* F1F @Bit 24 : Rx FIFO 1 Full */
  #define MCAN_RXF1S_F1F_Pos (24UL)                  /*!< Position of F1F field.                                               */
  #define MCAN_RXF1S_F1F_Msk (0x1UL << MCAN_RXF1S_F1F_Pos) /*!< Bit mask of F1F field.                                         */
  #define MCAN_RXF1S_F1F_Min (0x0UL)                 /*!< Min enumerator value of F1F field.                                   */
  #define MCAN_RXF1S_F1F_Max (0x1UL)                 /*!< Max enumerator value of F1F field.                                   */
  #define MCAN_RXF1S_F1F_NotFull (0x0UL)             /*!< Rx FIFO 1 not full                                                   */
  #define MCAN_RXF1S_F1F_Full (0x1UL)                /*!< Rx FIFO 1 full                                                       */

/* RF1L @Bit 25 : Rx FIFO 1 Message Lost */
  #define MCAN_RXF1S_RF1L_Pos (25UL)                 /*!< Position of RF1L field.                                              */
  #define MCAN_RXF1S_RF1L_Msk (0x1UL << MCAN_RXF1S_RF1L_Pos) /*!< Bit mask of RF1L field.                                      */
  #define MCAN_RXF1S_RF1L_Min (0x0UL)                /*!< Min enumerator value of RF1L field.                                  */
  #define MCAN_RXF1S_RF1L_Max (0x1UL)                /*!< Max enumerator value of RF1L field.                                  */
  #define MCAN_RXF1S_RF1L_NoMessageLost (0x0UL)      /*!< No Rx FIFO 1 message lost                                            */
  #define MCAN_RXF1S_RF1L_MessageLost (0x1UL)        /*!< Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of
                                                          size zero*/

/* DMS @Bits 30..31 : Debug Message Status */
  #define MCAN_RXF1S_DMS_Pos (30UL)                  /*!< Position of DMS field.                                               */
  #define MCAN_RXF1S_DMS_Msk (0x3UL << MCAN_RXF1S_DMS_Pos) /*!< Bit mask of DMS field.                                         */
  #define MCAN_RXF1S_DMS_Min (0x0UL)                 /*!< Min enumerator value of DMS field.                                   */
  #define MCAN_RXF1S_DMS_Max (0x3UL)                 /*!< Max enumerator value of DMS field.                                   */
  #define MCAN_RXF1S_DMS_Idle (0x0UL)                /*!< Idle state, wait for reception of debug messages, DMA request is
                                                          cleared*/
  #define MCAN_RXF1S_DMS_ReceivedMesA (0x1UL)        /*!< Debug message A received                                             */
  #define MCAN_RXF1S_DMS_ReceivedMesAB (0x2UL)       /*!< Debug messages A, B received                                         */
  #define MCAN_RXF1S_DMS_ReceivedMesABC (0x3UL)      /*!< Debug messages A, B, C received, DMA request is set                  */


/* MCAN_RXF1A: Rx FIFO 1 Acknowledge */
  #define MCAN_RXF1A_ResetValue (0x00000000UL)       /*!< Reset value of RXF1A register.                                       */

/* F1AI @Bits 0..5 : Rx FIFO 1 Acknowledge Index */
  #define MCAN_RXF1A_F1AI_Pos (0UL)                  /*!< Position of F1AI field.                                              */
  #define MCAN_RXF1A_F1AI_Msk (0x3FUL << MCAN_RXF1A_F1AI_Pos) /*!< Bit mask of F1AI field.                                     */


/* MCAN_RXESC: Rx Buffer / FIFO Element Size Configuration */
  #define MCAN_RXESC_ResetValue (0x00000000UL)       /*!< Reset value of RXESC register.                                       */

/* F0DS @Bits 0..2 : Rx FIFO 0 Data Field Size */
  #define MCAN_RXESC_F0DS_Pos (0UL)                  /*!< Position of F0DS field.                                              */
  #define MCAN_RXESC_F0DS_Msk (0x7UL << MCAN_RXESC_F0DS_Pos) /*!< Bit mask of F0DS field.                                      */
  #define MCAN_RXESC_F0DS_Min (0x0UL)                /*!< Min enumerator value of F0DS field.                                  */
  #define MCAN_RXESC_F0DS_Max (0x7UL)                /*!< Max enumerator value of F0DS field.                                  */
  #define MCAN_RXESC_F0DS_DataField8B (0x0UL)        /*!< 8 byte data field                                                    */
  #define MCAN_RXESC_F0DS_DataField12B (0x1UL)       /*!< 12 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField16B (0x2UL)       /*!< 16 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField20B (0x3UL)       /*!< 20 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField24B (0x4UL)       /*!< 24 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField32B (0x5UL)       /*!< 32 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField48B (0x6UL)       /*!< 48 byte data field                                                   */
  #define MCAN_RXESC_F0DS_DataField64B (0x7UL)       /*!< 64 byte data field                                                   */

