tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* F1DS @Bits 4..6 : Rx FIFO 1 Data Field Size */
  #define MCAN_RXESC_F1DS_Pos (4UL)                  /*!< Position of F1DS field.                                              */
  #define MCAN_RXESC_F1DS_Msk (0x7UL << MCAN_RXESC_F1DS_Pos) /*!< Bit mask of F1DS field.                                      */
  #define MCAN_RXESC_F1DS_Min (0x0UL)                /*!< Min enumerator value of F1DS field.                                  */
  #define MCAN_RXESC_F1DS_Max (0x7UL)                /*!< Max enumerator value of F1DS field.                                  */
  #define MCAN_RXESC_F1DS_DataField8B (0x0UL)        /*!< 8 byte data field                                                    */
  #define MCAN_RXESC_F1DS_DataField12B (0x1UL)       /*!< 12 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField16B (0x2UL)       /*!< 16 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField20B (0x3UL)       /*!< 20 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField24B (0x4UL)       /*!< 24 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField32B (0x5UL)       /*!< 32 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField48B (0x6UL)       /*!< 48 byte data field                                                   */
  #define MCAN_RXESC_F1DS_DataField64B (0x7UL)       /*!< 64 byte data field                                                   */

/* RBDS @Bits 8..10 : Rx Buffer Data Field Size */
  #define MCAN_RXESC_RBDS_Pos (8UL)                  /*!< Position of RBDS field.                                              */
  #define MCAN_RXESC_RBDS_Msk (0x7UL << MCAN_RXESC_RBDS_Pos) /*!< Bit mask of RBDS field.                                      */
  #define MCAN_RXESC_RBDS_Min (0x0UL)                /*!< Min enumerator value of RBDS field.                                  */
  #define MCAN_RXESC_RBDS_Max (0x7UL)                /*!< Max enumerator value of RBDS field.                                  */
  #define MCAN_RXESC_RBDS_DataField8B (0x0UL)        /*!< 8 byte data field                                                    */
  #define MCAN_RXESC_RBDS_DataField12B (0x1UL)       /*!< 12 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField16B (0x2UL)       /*!< 16 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField20B (0x3UL)       /*!< 20 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField24B (0x4UL)       /*!< 24 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField32B (0x5UL)       /*!< 32 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField48B (0x6UL)       /*!< 48 byte data field                                                   */
  #define MCAN_RXESC_RBDS_DataField64B (0x7UL)       /*!< 64 byte data field                                                   */


/* MCAN_TXBC: Tx Buffer Configuration */
  #define MCAN_TXBC_ResetValue (0x00000000UL)        /*!< Reset value of TXBC register.                                        */

/* TBSA @Bits 2..15 : Tx Buffers Start Address */
  #define MCAN_TXBC_TBSA_Pos (2UL)                   /*!< Position of TBSA field.                                              */
  #define MCAN_TXBC_TBSA_Msk (0x3FFFUL << MCAN_TXBC_TBSA_Pos) /*!< Bit mask of TBSA field.                                     */

/* NDTB @Bits 16..21 : Number of Dedicated Transmit Buffers */
  #define MCAN_TXBC_NDTB_Pos (16UL)                  /*!< Position of NDTB field.                                              */
  #define MCAN_TXBC_NDTB_Msk (0x3FUL << MCAN_TXBC_NDTB_Pos) /*!< Bit mask of NDTB field.                                       */

/* TFQS @Bits 24..29 : Transmit FIFO/Queue Size */
  #define MCAN_TXBC_TFQS_Pos (24UL)                  /*!< Position of TFQS field.                                              */
  #define MCAN_TXBC_TFQS_Msk (0x3FUL << MCAN_TXBC_TFQS_Pos) /*!< Bit mask of TFQS field.                                       */

/* TFQM @Bit 30 : Tx FIFO/Queue Mode */
  #define MCAN_TXBC_TFQM_Pos (30UL)                  /*!< Position of TFQM field.                                              */
  #define MCAN_TXBC_TFQM_Msk (0x1UL << MCAN_TXBC_TFQM_Pos) /*!< Bit mask of TFQM field.                                        */
  #define MCAN_TXBC_TFQM_Min (0x0UL)                 /*!< Min enumerator value of TFQM field.                                  */
  #define MCAN_TXBC_TFQM_Max (0x1UL)                 /*!< Max enumerator value of TFQM field.                                  */
  #define MCAN_TXBC_TFQM_TxFIFO (0x0UL)              /*!< Tx FIFO operation                                                    */
  #define MCAN_TXBC_TFQM_TxQueue (0x1UL)             /*!< Tx Queue operation                                                   */


/* MCAN_TXFQS: Tx FIFO/Queue Status */
  #define MCAN_TXFQS_ResetValue (0x00000000UL)       /*!< Reset value of TXFQS register.                                       */

/* TFFL @Bits 0..5 : Tx FIFO Free Level */
  #define MCAN_TXFQS_TFFL_Pos (0UL)                  /*!< Position of TFFL field.                                              */
  #define MCAN_TXFQS_TFFL_Msk (0x3FUL << MCAN_TXFQS_TFFL_Pos) /*!< Bit mask of TFFL field.                                     */

/* TFGI @Bits 8..12 : Tx FIFO Get Index */
  #define MCAN_TXFQS_TFGI_Pos (8UL)                  /*!< Position of TFGI field.                                              */
  #define MCAN_TXFQS_TFGI_Msk (0x1FUL << MCAN_TXFQS_TFGI_Pos) /*!< Bit mask of TFGI field.                                     */

/* TFQPI @Bits 16..20 : Tx FIFO/Queue Put Index */
  #define MCAN_TXFQS_TFQPI_Pos (16UL)                /*!< Position of TFQPI field.                                             */
  #define MCAN_TXFQS_TFQPI_Msk (0x1FUL << MCAN_TXFQS_TFQPI_Pos) /*!< Bit mask of TFQPI field.                                  */

