tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MCAN_TXBTIE: Tx Buffer Transmission Interrupt Enable */
  #define MCAN_TXBTIE_ResetValue (0x00000000UL)      /*!< Reset value of TXBTIE register.                                      */

/* TIE @Bits 0..31 : Transmission Interrupt Enable */
  #define MCAN_TXBTIE_TIE_Pos (0UL)                  /*!< Position of TIE field.                                               */
  #define MCAN_TXBTIE_TIE_Msk (0xFFFFFFFFUL << MCAN_TXBTIE_TIE_Pos) /*!< Bit mask of TIE field.                                */
  #define MCAN_TXBTIE_TIE_Min (0x0UL)                /*!< Min enumerator value of TIE field.                                   */
  #define MCAN_TXBTIE_TIE_Max (0x1UL)                /*!< Max enumerator value of TIE field.                                   */
  #define MCAN_TXBTIE_TIE_Disable (0x00000000UL)     /*!< Transmission interrupt disabled                                      */
  #define MCAN_TXBTIE_TIE_Enable (0x00000001UL)      /*!< Transmission interrupt enable                                        */


/* MCAN_TXBCIE: Tx Buffer Cancellation Finished Interrupt Enable */
  #define MCAN_TXBCIE_ResetValue (0x00000000UL)      /*!< Reset value of TXBCIE register.                                      */

/* CFIE @Bits 0..31 : Cancellation Finished Interrupt Enable */
  #define MCAN_TXBCIE_CFIE_Pos (0UL)                 /*!< Position of CFIE field.                                              */
  #define MCAN_TXBCIE_CFIE_Msk (0xFFFFFFFFUL << MCAN_TXBCIE_CFIE_Pos) /*!< Bit mask of CFIE field.                             */
  #define MCAN_TXBCIE_CFIE_Min (0x0UL)               /*!< Min enumerator value of CFIE field.                                  */
  #define MCAN_TXBCIE_CFIE_Max (0x1UL)               /*!< Max enumerator value of CFIE field.                                  */
  #define MCAN_TXBCIE_CFIE_Disable (0x00000000UL)    /*!< Cancellation finished interrupt disabled                             */
  #define MCAN_TXBCIE_CFIE_Enable (0x00000001UL)     /*!< Cancellation finished interrupt enabled                              */


/* MCAN_TXEFC: Tx Event FIFO Configuration */
  #define MCAN_TXEFC_ResetValue (0x00000000UL)       /*!< Reset value of TXEFC register.                                       */

/* EFSA @Bits 2..15 : Event FIFO Start Address */
  #define MCAN_TXEFC_EFSA_Pos (2UL)                  /*!< Position of EFSA field.                                              */
  #define MCAN_TXEFC_EFSA_Msk (0x3FFFUL << MCAN_TXEFC_EFSA_Pos) /*!< Bit mask of EFSA field.                                   */

/* EFS @Bits 16..21 : Event FIFO Size */
  #define MCAN_TXEFC_EFS_Pos (16UL)                  /*!< Position of EFS field.                                               */
  #define MCAN_TXEFC_EFS_Msk (0x3FUL << MCAN_TXEFC_EFS_Pos) /*!< Bit mask of EFS field.                                        */

/* EFWM @Bits 24..29 : Event FIFO Watermark */
  #define MCAN_TXEFC_EFWM_Pos (24UL)                 /*!< Position of EFWM field.                                              */
  #define MCAN_TXEFC_EFWM_Msk (0x3FUL << MCAN_TXEFC_EFWM_Pos) /*!< Bit mask of EFWM field.                                     */


/* MCAN_TXEFS: Tx Event FIFO Status */
  #define MCAN_TXEFS_ResetValue (0x00000000UL)       /*!< Reset value of TXEFS register.                                       */

/* EFFL @Bits 0..5 : Event FIFO Fill Level */
  #define MCAN_TXEFS_EFFL_Pos (0UL)                  /*!< Position of EFFL field.                                              */
  #define MCAN_TXEFS_EFFL_Msk (0x3FUL << MCAN_TXEFS_EFFL_Pos) /*!< Bit mask of EFFL field.                                     */

/* EFGI @Bits 8..12 : Event FIFO Get Index */
  #define MCAN_TXEFS_EFGI_Pos (8UL)                  /*!< Position of EFGI field.                                              */
  #define MCAN_TXEFS_EFGI_Msk (0x1FUL << MCAN_TXEFS_EFGI_Pos) /*!< Bit mask of EFGI field.                                     */

/* EFPI @Bits 16..20 : Event FIFO Put Index */
  #define MCAN_TXEFS_EFPI_Pos (16UL)                 /*!< Position of EFPI field.                                              */
  #define MCAN_TXEFS_EFPI_Msk (0x1FUL << MCAN_TXEFS_EFPI_Pos) /*!< Bit mask of EFPI field.                                     */

/* EFF @Bit 24 : Event FIFO Full */
  #define MCAN_TXEFS_EFF_Pos (24UL)                  /*!< Position of EFF field.                                               */
  #define MCAN_TXEFS_EFF_Msk (0x1UL << MCAN_TXEFS_EFF_Pos) /*!< Bit mask of EFF field.                                         */
  #define MCAN_TXEFS_EFF_Min (0x0UL)                 /*!< Min enumerator value of EFF field.                                   */
  #define MCAN_TXEFS_EFF_Max (0x1UL)                 /*!< Max enumerator value of EFF field.                                   */
  #define MCAN_TXEFS_EFF_NotFull (0x0UL)             /*!< Tx Event FIFO not full                                               */
  #define MCAN_TXEFS_EFF_Full (0x1UL)                /*!< Tx Event FIFO full                                                   */

/* TEFL @Bit 25 : Tx Event FIFO Element Lost */
  #define MCAN_TXEFS_TEFL_Pos (25UL)                 /*!< Position of TEFL field.                                              */
  #define MCAN_TXEFS_TEFL_Msk (0x1UL << MCAN_TXEFS_TEFL_Pos) /*!< Bit mask of TEFL field.                                      */
  #define MCAN_TXEFS_TEFL_Min (0x0UL)                /*!< Min enumerator value of TEFL field.                                  */
  #define MCAN_TXEFS_TEFL_Max (0x1UL)                /*!< Max enumerator value of TEFL field.                                  */
  #define MCAN_TXEFS_TEFL_NotLost (0x0UL)            /*!< No Tx Event FIFO element lost                                        */
  #define MCAN_TXEFS_TEFL_Lost (0x1UL)               /*!< Tx Event FIFO element lost, also set after wr ite attempt to Tx Event
                                                          FIFO of siz e zero.*/


/* MCAN_TXEFA: Tx Event FIFO Acknowledge */
  #define MCAN_TXEFA_ResetValue (0x00000000UL)       /*!< Reset value of TXEFA register.                                       */

/* EFAI @Bits 0..4 : Event FIFO Acknowledge Index */
  #define MCAN_TXEFA_EFAI_Pos (0UL)                  /*!< Position of EFAI field.                                              */
  #define MCAN_TXEFA_EFAI_Msk (0x1FUL << MCAN_TXEFA_EFAI_Pos) /*!< Bit mask of EFAI field.                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          MEMCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

