tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MEM19 @Bit 19 : Keep the RAM block MEM[19] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM19_Pos (19UL)         /*!< Position of MEM19 field.                                             */
  #define MEMCONF_POWER_RET_MEM19_Msk (0x1UL << MEMCONF_POWER_RET_MEM19_Pos) /*!< Bit mask of MEM19 field.                     */
  #define MEMCONF_POWER_RET_MEM19_Min (0x0UL)        /*!< Min enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Max (0x1UL)        /*!< Max enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM19_On (0x1UL)         /*!< Retention on                                                         */

/* MEM20 @Bit 20 : Keep the RAM block MEM[20] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM20_Pos (20UL)         /*!< Position of MEM20 field.                                             */
  #define MEMCONF_POWER_RET_MEM20_Msk (0x1UL << MEMCONF_POWER_RET_MEM20_Pos) /*!< Bit mask of MEM20 field.                     */
  #define MEMCONF_POWER_RET_MEM20_Min (0x0UL)        /*!< Min enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Max (0x1UL)        /*!< Max enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM20_On (0x1UL)         /*!< Retention on                                                         */

/* MEM21 @Bit 21 : Keep the RAM block MEM[21] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM21_Pos (21UL)         /*!< Position of MEM21 field.                                             */
  #define MEMCONF_POWER_RET_MEM21_Msk (0x1UL << MEMCONF_POWER_RET_MEM21_Pos) /*!< Bit mask of MEM21 field.                     */
  #define MEMCONF_POWER_RET_MEM21_Min (0x0UL)        /*!< Min enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Max (0x1UL)        /*!< Max enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM21_On (0x1UL)         /*!< Retention on                                                         */

/* MEM22 @Bit 22 : Keep the RAM block MEM[22] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM22_Pos (22UL)         /*!< Position of MEM22 field.                                             */
  #define MEMCONF_POWER_RET_MEM22_Msk (0x1UL << MEMCONF_POWER_RET_MEM22_Pos) /*!< Bit mask of MEM22 field.                     */
  #define MEMCONF_POWER_RET_MEM22_Min (0x0UL)        /*!< Min enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Max (0x1UL)        /*!< Max enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM22_On (0x1UL)         /*!< Retention on                                                         */

/* MEM23 @Bit 23 : Keep the RAM block MEM[23] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM23_Pos (23UL)         /*!< Position of MEM23 field.                                             */
  #define MEMCONF_POWER_RET_MEM23_Msk (0x1UL << MEMCONF_POWER_RET_MEM23_Pos) /*!< Bit mask of MEM23 field.                     */
  #define MEMCONF_POWER_RET_MEM23_Min (0x0UL)        /*!< Min enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Max (0x1UL)        /*!< Max enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM23_On (0x1UL)         /*!< Retention on                                                         */

/* MEM24 @Bit 24 : Keep the RAM block MEM[24] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM24_Pos (24UL)         /*!< Position of MEM24 field.                                             */
  #define MEMCONF_POWER_RET_MEM24_Msk (0x1UL << MEMCONF_POWER_RET_MEM24_Pos) /*!< Bit mask of MEM24 field.                     */
  #define MEMCONF_POWER_RET_MEM24_Min (0x0UL)        /*!< Min enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Max (0x1UL)        /*!< Max enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM24_On (0x1UL)         /*!< Retention on                                                         */

/* MEM25 @Bit 25 : Keep the RAM block MEM[25] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM25_Pos (25UL)         /*!< Position of MEM25 field.                                             */
  #define MEMCONF_POWER_RET_MEM25_Msk (0x1UL << MEMCONF_POWER_RET_MEM25_Pos) /*!< Bit mask of MEM25 field.                     */
  #define MEMCONF_POWER_RET_MEM25_Min (0x0UL)        /*!< Min enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Max (0x1UL)        /*!< Max enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM25_On (0x1UL)         /*!< Retention on                                                         */

/* MEM26 @Bit 26 : Keep the RAM block MEM[26] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM26_Pos (26UL)         /*!< Position of MEM26 field.                                             */
  #define MEMCONF_POWER_RET_MEM26_Msk (0x1UL << MEMCONF_POWER_RET_MEM26_Pos) /*!< Bit mask of MEM26 field.                     */
  #define MEMCONF_POWER_RET_MEM26_Min (0x0UL)        /*!< Min enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Max (0x1UL)        /*!< Max enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM26_On (0x1UL)         /*!< Retention on                                                         */

/* MEM27 @Bit 27 : Keep the RAM block MEM[27] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM27_Pos (27UL)         /*!< Position of MEM27 field.                                             */
  #define MEMCONF_POWER_RET_MEM27_Msk (0x1UL << MEMCONF_POWER_RET_MEM27_Pos) /*!< Bit mask of MEM27 field.                     */
  #define MEMCONF_POWER_RET_MEM27_Min (0x0UL)        /*!< Min enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Max (0x1UL)        /*!< Max enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM27_On (0x1UL)         /*!< Retention on                                                         */

/* MEM28 @Bit 28 : Keep the RAM block MEM[28] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM28_Pos (28UL)         /*!< Position of MEM28 field.                                             */
  #define MEMCONF_POWER_RET_MEM28_Msk (0x1UL << MEMCONF_POWER_RET_MEM28_Pos) /*!< Bit mask of MEM28 field.                     */
  #define MEMCONF_POWER_RET_MEM28_Min (0x0UL)        /*!< Min enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Max (0x1UL)        /*!< Max enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM28_On (0x1UL)         /*!< Retention on                                                         */

/* MEM29 @Bit 29 : Keep the RAM block MEM[29] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM29_Pos (29UL)         /*!< Position of MEM29 field.                                             */
  #define MEMCONF_POWER_RET_MEM29_Msk (0x1UL << MEMCONF_POWER_RET_MEM29_Pos) /*!< Bit mask of MEM29 field.                     */
  #define MEMCONF_POWER_RET_MEM29_Min (0x0UL)        /*!< Min enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Max (0x1UL)        /*!< Max enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM29_On (0x1UL)         /*!< Retention on                                                         */

/* MEM30 @Bit 30 : Keep the RAM block MEM[30] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM30_Pos (30UL)         /*!< Position of MEM30 field.                                             */
  #define MEMCONF_POWER_RET_MEM30_Msk (0x1UL << MEMCONF_POWER_RET_MEM30_Pos) /*!< Bit mask of MEM30 field.                     */
  #define MEMCONF_POWER_RET_MEM30_Min (0x0UL)        /*!< Min enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Max (0x1UL)        /*!< Max enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM30_On (0x1UL)         /*!< Retention on                                                         */

/* MEM31 @Bit 31 : Keep the RAM block MEM[31] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM31_Pos (31UL)         /*!< Position of MEM31 field.                                             */
  #define MEMCONF_POWER_RET_MEM31_Msk (0x1UL << MEMCONF_POWER_RET_MEM31_Pos) /*!< Bit mask of MEM31 field.                     */
  #define MEMCONF_POWER_RET_MEM31_Min (0x0UL)        /*!< Min enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Max (0x1UL)        /*!< Max enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM31_On (0x1UL)         /*!< Retention on                                                         */


/* MEMCONF_POWER_RET2: RAM retention for the second bank in the RAM block */
  #define MEMCONF_POWER_RET2_ResetValue (0x00000000UL) /*!< Reset value of RET2 register.                                      */

/* MEM0 @Bit 0 : Keep the second bank in RAM block MEM[0] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM0_Pos (0UL)          /*!< Position of MEM0 field.                                              */
  #define MEMCONF_POWER_RET2_MEM0_Msk (0x1UL << MEMCONF_POWER_RET2_MEM0_Pos) /*!< Bit mask of MEM0 field.                      */
  #define MEMCONF_POWER_RET2_MEM0_Min (0x0UL)        /*!< Min enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET2_MEM0_Max (0x1UL)        /*!< Max enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET2_MEM0_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM0_On (0x1UL)         /*!< Retention on                                                         */

/* MEM1 @Bit 1 : Keep the second bank in RAM block MEM[1] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM1_Pos (1UL)          /*!< Position of MEM1 field.                                              */
  #define MEMCONF_POWER_RET2_MEM1_Msk (0x1UL << MEMCONF_POWER_RET2_MEM1_Pos) /*!< Bit mask of MEM1 field.                      */
  #define MEMCONF_POWER_RET2_MEM1_Min (0x0UL)        /*!< Min enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET2_MEM1_Max (0x1UL)        /*!< Max enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET2_MEM1_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM1_On (0x1UL)         /*!< Retention on                                                         */

/* MEM2 @Bit 2 : Keep the second bank in RAM block MEM[2] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM2_Pos (2UL)          /*!< Position of MEM2 field.                                              */
  #define MEMCONF_POWER_RET2_MEM2_Msk (0x1UL << MEMCONF_POWER_RET2_MEM2_Pos) /*!< Bit mask of MEM2 field.                      */
  #define MEMCONF_POWER_RET2_MEM2_Min (0x0UL)        /*!< Min enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET2_MEM2_Max (0x1UL)        /*!< Max enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET2_MEM2_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM2_On (0x1UL)         /*!< Retention on                                                         */

/* MEM3 @Bit 3 : Keep the second bank in RAM block MEM[3] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM3_Pos (3UL)          /*!< Position of MEM3 field.                                              */
  #define MEMCONF_POWER_RET2_MEM3_Msk (0x1UL << MEMCONF_POWER_RET2_MEM3_Pos) /*!< Bit mask of MEM3 field.                      */
  #define MEMCONF_POWER_RET2_MEM3_Min (0x0UL)        /*!< Min enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET2_MEM3_Max (0x1UL)        /*!< Max enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET2_MEM3_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM3_On (0x1UL)         /*!< Retention on                                                         */

