tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MEM29 @Bit 29 : Keep the second bank in RAM block MEM[29] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM29_Pos (29UL)        /*!< Position of MEM29 field.                                             */
  #define MEMCONF_POWER_RET2_MEM29_Msk (0x1UL << MEMCONF_POWER_RET2_MEM29_Pos) /*!< Bit mask of MEM29 field.                   */
  #define MEMCONF_POWER_RET2_MEM29_Min (0x0UL)       /*!< Min enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET2_MEM29_Max (0x1UL)       /*!< Max enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET2_MEM29_Off (0x0UL)       /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM29_On (0x1UL)        /*!< Retention on                                                         */

/* MEM30 @Bit 30 : Keep the second bank in RAM block MEM[30] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM30_Pos (30UL)        /*!< Position of MEM30 field.                                             */
  #define MEMCONF_POWER_RET2_MEM30_Msk (0x1UL << MEMCONF_POWER_RET2_MEM30_Pos) /*!< Bit mask of MEM30 field.                   */
  #define MEMCONF_POWER_RET2_MEM30_Min (0x0UL)       /*!< Min enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET2_MEM30_Max (0x1UL)       /*!< Max enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET2_MEM30_Off (0x0UL)       /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM30_On (0x1UL)        /*!< Retention on                                                         */

/* MEM31 @Bit 31 : Keep the second bank in RAM block MEM[31] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM31_Pos (31UL)        /*!< Position of MEM31 field.                                             */
  #define MEMCONF_POWER_RET2_MEM31_Msk (0x1UL << MEMCONF_POWER_RET2_MEM31_Pos) /*!< Bit mask of MEM31 field.                   */
  #define MEMCONF_POWER_RET2_MEM31_Min (0x0UL)       /*!< Min enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET2_MEM31_Max (0x1UL)       /*!< Max enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET2_MEM31_Off (0x0UL)       /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET2_MEM31_On (0x1UL)        /*!< Retention on                                                         */



/* ================================================== Struct MEMCONF_REPAIR ================================================== */
/**
  * @brief REPAIR [MEMCONF_REPAIR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BITLINE;                           /*!< (@ 0x00000000) Repair configuration for RAM blocks.                  */
} NRF_MEMCONF_REPAIR_Type;                           /*!< Size = 4 (0x004)                                                     */
  #define MEMCONF_REPAIR_MaxCount (192UL)            /*!< Size of REPAIR[192] array.                                           */
  #define MEMCONF_REPAIR_MaxIndex (191UL)            /*!< Max index of REPAIR[192] array.                                      */
  #define MEMCONF_REPAIR_MinIndex (0UL)              /*!< Min index of REPAIR[192] array.                                      */

/* MEMCONF_REPAIR_BITLINE: Repair configuration for RAM blocks. */
  #define MEMCONF_REPAIR_BITLINE_ResetValue (0x00000000UL) /*!< Reset value of BITLINE register.                               */

/* ADDR @Bits 0..6 : Repair address of the bitline */
  #define MEMCONF_REPAIR_BITLINE_ADDR_Pos (0UL)      /*!< Position of ADDR field.                                              */
  #define MEMCONF_REPAIR_BITLINE_ADDR_Msk (0x7FUL << MEMCONF_REPAIR_BITLINE_ADDR_Pos) /*!< Bit mask of ADDR field.             */

/* EN @Bit 31 : Enable bitline repair */
  #define MEMCONF_REPAIR_BITLINE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define MEMCONF_REPAIR_BITLINE_EN_Msk (0x1UL << MEMCONF_REPAIR_BITLINE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define MEMCONF_REPAIR_BITLINE_EN_Disabled (0x0UL) /*!< Repair disabled.                                                     */
  #define MEMCONF_REPAIR_BITLINE_EN_Enabled (0x1UL)  /*!< Repair enabled.                                                      */



/* ================================================ Struct MEMCONF_BLOCKTYPE ================================================= */
/**
  * @brief BLOCKTYPE [MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim configuration for the memory block types.        */
} NRF_MEMCONF_BLOCKTYPE_Type;                        /*!< Size = 4 (0x004)                                                     */
  #define MEMCONF_BLOCKTYPE_MaxCount (64UL)          /*!< Size of BLOCKTYPE[64] array.                                         */
  #define MEMCONF_BLOCKTYPE_MaxIndex (63UL)          /*!< Max index of BLOCKTYPE[64] array.                                    */
  #define MEMCONF_BLOCKTYPE_MinIndex (0UL)           /*!< Min index of BLOCKTYPE[64] array.                                    */

/* MEMCONF_BLOCKTYPE_TRIM: Trim configuration for the memory block types. */
  #define MEMCONF_BLOCKTYPE_TRIM_ResetValue (0x00000000UL) /*!< Reset value of TRIM register.                                  */

/* MEMTRIM0 @Bit 0 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos (0UL)  /*!< Position of MEMTRIM0 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos) /*!< Bit mask of MEMTRIM0 field.  */

