tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MEMTRIM1 @Bit 1 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos (1UL)  /*!< Position of MEMTRIM1 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos) /*!< Bit mask of MEMTRIM1 field.  */

/* MEMTRIM2 @Bit 2 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos (2UL)  /*!< Position of MEMTRIM2 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos) /*!< Bit mask of MEMTRIM2 field.  */

/* MEMTRIM3 @Bit 3 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos (3UL)  /*!< Position of MEMTRIM3 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos) /*!< Bit mask of MEMTRIM3 field.  */

/* MEMTRIM4 @Bit 4 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos (4UL)  /*!< Position of MEMTRIM4 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos) /*!< Bit mask of MEMTRIM4 field.  */

/* MEMTRIM5 @Bit 5 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos (5UL)  /*!< Position of MEMTRIM5 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos) /*!< Bit mask of MEMTRIM5 field.  */

/* MEMTRIM6 @Bit 6 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos (6UL)  /*!< Position of MEMTRIM6 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos) /*!< Bit mask of MEMTRIM6 field.  */

/* MEMTRIM7 @Bit 7 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos (7UL)  /*!< Position of MEMTRIM7 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos) /*!< Bit mask of MEMTRIM7 field.  */

/* MEMTRIM8 @Bit 8 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos (8UL)  /*!< Position of MEMTRIM8 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos) /*!< Bit mask of MEMTRIM8 field.  */

/* MEMTRIM9 @Bit 9 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos (9UL)  /*!< Position of MEMTRIM9 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos) /*!< Bit mask of MEMTRIM9 field.  */

/* MEMTRIM10 @Bit 10 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos (10UL) /*!< Position of MEMTRIM10 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos) /*!< Bit mask of MEMTRIM10
                                                                            field.*/

/* MEMTRIM11 @Bit 11 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos (11UL) /*!< Position of MEMTRIM11 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos) /*!< Bit mask of MEMTRIM11
                                                                            field.*/

/* MEMTRIM12 @Bit 12 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos (12UL) /*!< Position of MEMTRIM12 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos) /*!< Bit mask of MEMTRIM12
                                                                            field.*/

/* MEMTRIM13 @Bit 13 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos (13UL) /*!< Position of MEMTRIM13 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos) /*!< Bit mask of MEMTRIM13
                                                                            field.*/

/* MEMTRIM14 @Bit 14 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos (14UL) /*!< Position of MEMTRIM14 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos) /*!< Bit mask of MEMTRIM14
                                                                            field.*/

/* MEMTRIM15 @Bit 15 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos (15UL) /*!< Position of MEMTRIM15 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos) /*!< Bit mask of MEMTRIM15
                                                                            field.*/

/* MEMRETTRIM0 @Bit 16 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos (16UL) /*!< Position of MEMRETTRIM0 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos) /*!< Bit mask of MEMRETTRIM0
                                                                            field.*/

/* MEMRETTRIM1 @Bit 17 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos (17UL) /*!< Position of MEMRETTRIM1 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos) /*!< Bit mask of MEMRETTRIM1
                                                                            field.*/

/* MEMRETTRIM2 @Bit 18 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos (18UL) /*!< Position of MEMRETTRIM2 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos) /*!< Bit mask of MEMRETTRIM2
                                                                            field.*/

