tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MEMRETTRIM3 @Bit 19 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos (19UL) /*!< Position of MEMRETTRIM3 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos) /*!< Bit mask of MEMRETTRIM3
                                                                            field.*/

/* MEMRETTRIM4 @Bit 20 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos (20UL) /*!< Position of MEMRETTRIM4 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos) /*!< Bit mask of MEMRETTRIM4
                                                                            field.*/

/* MEMRETTRIM5 @Bit 21 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos (21UL) /*!< Position of MEMRETTRIM5 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos) /*!< Bit mask of MEMRETTRIM5
                                                                            field.*/

/* MEMRETTRIM6 @Bit 22 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos (22UL) /*!< Position of MEMRETTRIM6 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos) /*!< Bit mask of MEMRETTRIM6
                                                                            field.*/

/* MEMRETTRIM7 @Bit 23 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos (23UL) /*!< Position of MEMRETTRIM7 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos) /*!< Bit mask of MEMRETTRIM7
                                                                            field.*/

/* MEMRETTRIM8 @Bit 24 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos (24UL) /*!< Position of MEMRETTRIM8 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos) /*!< Bit mask of MEMRETTRIM8
                                                                            field.*/

/* MEMRETTRIM9 @Bit 25 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos (25UL) /*!< Position of MEMRETTRIM9 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos) /*!< Bit mask of MEMRETTRIM9
                                                                            field.*/

/* MEMRETTRIM10 @Bit 26 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos (26UL) /*!< Position of MEMRETTRIM10 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM10 field.*/

/* MEMRETTRIM11 @Bit 27 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos (27UL) /*!< Position of MEMRETTRIM11 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM11 field.*/

/* MEMRETTRIM12 @Bit 28 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos (28UL) /*!< Position of MEMRETTRIM12 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM12 field.*/

/* MEMRETTRIM13 @Bit 29 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos (29UL) /*!< Position of MEMRETTRIM13 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM13 field.*/

/* MEMRETTRIM14 @Bit 30 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos (30UL) /*!< Position of MEMRETTRIM14 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM14 field.*/

/* MEMRETTRIM15 @Bit 31 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos (31UL) /*!< Position of MEMRETTRIM15 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM15 field.*/


/* ===================================================== Struct MEMCONF ====================================================== */
/**
  * @brief Memory configuration
  */
  typedef struct {                                   /*!< MEMCONF Structure                                                    */
    __IM uint32_t RESERVED[320];
    __IOM NRF_MEMCONF_POWER_Type POWER[2];           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED1[56];
    __IOM NRF_MEMCONF_REPAIR_Type REPAIR[192];       /*!< (@ 0x00000600) (unspecified)                                         */
    __IOM NRF_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[64];  /*!< (@ 0x00000900) (unspecified)                                         */
  } NRF_MEMCONF_Type;                                /*!< Size = 2560 (0xA00)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            MPC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

