tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ENABLE4 @Bit 4 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Pos (4UL)   /*!< Position of ENABLE4 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Min (0x0UL) /*!< Min enumerator value of ENABLE4 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Max (0x1UL) /*!< Max enumerator value of ENABLE4 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 4 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 4 Read Address Channel */

/* ENABLE5 @Bit 5 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Pos (5UL)   /*!< Position of ENABLE5 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Min (0x0UL) /*!< Min enumerator value of ENABLE5 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Max (0x1UL) /*!< Max enumerator value of ENABLE5 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 5 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 5 Read Address Channel */

/* ENABLE6 @Bit 6 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Pos (6UL)   /*!< Position of ENABLE6 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Min (0x0UL) /*!< Min enumerator value of ENABLE6 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Max (0x1UL) /*!< Max enumerator value of ENABLE6 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 6 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 6 Read Address Channel */

/* ENABLE7 @Bit 7 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Pos (7UL)   /*!< Position of ENABLE7 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Min (0x0UL) /*!< Min enumerator value of ENABLE7 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Max (0x1UL) /*!< Max enumerator value of ENABLE7 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 7 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 7 Read Address Channel */

/* ENABLE8 @Bit 8 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Pos (8UL)   /*!< Position of ENABLE8 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Min (0x0UL) /*!< Min enumerator value of ENABLE8 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Max (0x1UL) /*!< Max enumerator value of ENABLE8 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 8 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 8 Read Address Channel */

/* ENABLE9 @Bit 9 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Pos (9UL)   /*!< Position of ENABLE9 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Min (0x0UL) /*!< Min enumerator value of ENABLE9 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Max (0x1UL) /*!< Max enumerator value of ENABLE9 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 9 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 9 Read Address Channel */

/* ENABLE10 @Bit 10 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Pos (10UL) /*!< Position of ENABLE10 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Min (0x0UL) /*!< Min enumerator value of ENABLE10 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Max (0x1UL) /*!< Max enumerator value of ENABLE10 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 10 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 10 Read Address
                                                              Channel*/

/* ENABLE11 @Bit 11 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Pos (11UL) /*!< Position of ENABLE11 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Min (0x0UL) /*!< Min enumerator value of ENABLE11 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Max (0x1UL) /*!< Max enumerator value of ENABLE11 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 11 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 11 Read Address
                                                              Channel*/

/* ENABLE12 @Bit 12 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Pos (12UL) /*!< Position of ENABLE12 field.                                          */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE12_Pos) /*!< Bit mask of ENABLE12 field.  */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Min (0x0UL) /*!< Min enumerator value of ENABLE12 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Max (0x1UL) /*!< Max enumerator value of ENABLE12 field.                             */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 12 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 12 Read Address
                                                              Channel*/

