tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* STARTADDR @Bits 0..31 : Start address for memory region n */
  #define MPC_REGION_STARTADDR_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define MPC_REGION_STARTADDR_STARTADDR_Msk (0xFFFFFFFFUL << MPC_REGION_STARTADDR_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MPC_REGION_ADDRMASK: Select which bits of the incoming address are compared against the STARTADDR */
  #define MPC_REGION_ADDRMASK_ResetValue (0x00000000UL) /*!< Reset value of ADDRMASK register.                                 */

/* ADDRMASK @Bits 0..31 : Address mask for memory region n */
  #define MPC_REGION_ADDRMASK_ADDRMASK_Pos (0UL)     /*!< Position of ADDRMASK field.                                          */
  #define MPC_REGION_ADDRMASK_ADDRMASK_Msk (0xFFFFFFFFUL << MPC_REGION_ADDRMASK_ADDRMASK_Pos) /*!< Bit mask of ADDRMASK field. */


/* MPC_REGION_MASTERPORT: Region n local master enable */
  #define MPC_REGION_MASTERPORT_ResetValue (0x00000000UL) /*!< Reset value of MASTERPORT register.                             */

/* ENABLE0 @Bit 0 : Enable region n for master port 0 */
  #define MPC_REGION_MASTERPORT_ENABLE0_Pos (0UL)    /*!< Position of ENABLE0 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE0_Min (0x0UL)  /*!< Min enumerator value of ENABLE0 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE0_Max (0x1UL)  /*!< Max enumerator value of ENABLE0 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE0_Disable (0x0UL) /*!< Region n is disabled for master port 0                            */
  #define MPC_REGION_MASTERPORT_ENABLE0_Enable (0x1UL) /*!< Region n is enabled for master port 0                              */

/* ENABLE1 @Bit 1 : Enable region n for master port 1 */
  #define MPC_REGION_MASTERPORT_ENABLE1_Pos (1UL)    /*!< Position of ENABLE1 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE1_Min (0x0UL)  /*!< Min enumerator value of ENABLE1 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE1_Max (0x1UL)  /*!< Max enumerator value of ENABLE1 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE1_Disable (0x0UL) /*!< Region n is disabled for master port 1                            */
  #define MPC_REGION_MASTERPORT_ENABLE1_Enable (0x1UL) /*!< Region n is enabled for master port 1                              */

/* ENABLE2 @Bit 2 : Enable region n for master port 2 */
  #define MPC_REGION_MASTERPORT_ENABLE2_Pos (2UL)    /*!< Position of ENABLE2 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE2_Min (0x0UL)  /*!< Min enumerator value of ENABLE2 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE2_Max (0x1UL)  /*!< Max enumerator value of ENABLE2 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE2_Disable (0x0UL) /*!< Region n is disabled for master port 2                            */
  #define MPC_REGION_MASTERPORT_ENABLE2_Enable (0x1UL) /*!< Region n is enabled for master port 2                              */

/* ENABLE3 @Bit 3 : Enable region n for master port 3 */
  #define MPC_REGION_MASTERPORT_ENABLE3_Pos (3UL)    /*!< Position of ENABLE3 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE3_Min (0x0UL)  /*!< Min enumerator value of ENABLE3 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE3_Max (0x1UL)  /*!< Max enumerator value of ENABLE3 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE3_Disable (0x0UL) /*!< Region n is disabled for master port 3                            */
  #define MPC_REGION_MASTERPORT_ENABLE3_Enable (0x1UL) /*!< Region n is enabled for master port 3                              */

/* ENABLE4 @Bit 4 : Enable region n for master port 4 */
  #define MPC_REGION_MASTERPORT_ENABLE4_Pos (4UL)    /*!< Position of ENABLE4 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE4_Min (0x0UL)  /*!< Min enumerator value of ENABLE4 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE4_Max (0x1UL)  /*!< Max enumerator value of ENABLE4 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE4_Disable (0x0UL) /*!< Region n is disabled for master port 4                            */
  #define MPC_REGION_MASTERPORT_ENABLE4_Enable (0x1UL) /*!< Region n is enabled for master port 4                              */

/* ENABLE5 @Bit 5 : Enable region n for master port 5 */
  #define MPC_REGION_MASTERPORT_ENABLE5_Pos (5UL)    /*!< Position of ENABLE5 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE5_Min (0x0UL)  /*!< Min enumerator value of ENABLE5 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE5_Max (0x1UL)  /*!< Max enumerator value of ENABLE5 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE5_Disable (0x0UL) /*!< Region n is disabled for master port 5                            */
  #define MPC_REGION_MASTERPORT_ENABLE5_Enable (0x1UL) /*!< Region n is enabled for master port 5                              */

/* ENABLE6 @Bit 6 : Enable region n for master port 6 */
  #define MPC_REGION_MASTERPORT_ENABLE6_Pos (6UL)    /*!< Position of ENABLE6 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE6_Min (0x0UL)  /*!< Min enumerator value of ENABLE6 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE6_Max (0x1UL)  /*!< Max enumerator value of ENABLE6 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE6_Disable (0x0UL) /*!< Region n is disabled for master port 6                            */
  #define MPC_REGION_MASTERPORT_ENABLE6_Enable (0x1UL) /*!< Region n is enabled for master port 6                              */

/* ENABLE7 @Bit 7 : Enable region n for master port 7 */
  #define MPC_REGION_MASTERPORT_ENABLE7_Pos (7UL)    /*!< Position of ENABLE7 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE7_Min (0x0UL)  /*!< Min enumerator value of ENABLE7 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE7_Max (0x1UL)  /*!< Max enumerator value of ENABLE7 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE7_Disable (0x0UL) /*!< Region n is disabled for master port 7                            */
  #define MPC_REGION_MASTERPORT_ENABLE7_Enable (0x1UL) /*!< Region n is enabled for master port 7                              */

/* ENABLE8 @Bit 8 : Enable region n for master port 8 */
  #define MPC_REGION_MASTERPORT_ENABLE8_Pos (8UL)    /*!< Position of ENABLE8 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE8_Min (0x0UL)  /*!< Min enumerator value of ENABLE8 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE8_Max (0x1UL)  /*!< Max enumerator value of ENABLE8 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE8_Disable (0x0UL) /*!< Region n is disabled for master port 8                            */
  #define MPC_REGION_MASTERPORT_ENABLE8_Enable (0x1UL) /*!< Region n is enabled for master port 8                              */

