tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ENABLE9 @Bit 9 : Enable region n for master port 9 */
  #define MPC_REGION_MASTERPORT_ENABLE9_Pos (9UL)    /*!< Position of ENABLE9 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE9_Min (0x0UL)  /*!< Min enumerator value of ENABLE9 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE9_Max (0x1UL)  /*!< Max enumerator value of ENABLE9 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE9_Disable (0x0UL) /*!< Region n is disabled for master port 9                            */
  #define MPC_REGION_MASTERPORT_ENABLE9_Enable (0x1UL) /*!< Region n is enabled for master port 9                              */

/* ENABLE10 @Bit 10 : Enable region n for master port 10 */
  #define MPC_REGION_MASTERPORT_ENABLE10_Pos (10UL)  /*!< Position of ENABLE10 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE10_Min (0x0UL) /*!< Min enumerator value of ENABLE10 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE10_Max (0x1UL) /*!< Max enumerator value of ENABLE10 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE10_Disable (0x0UL) /*!< Region n is disabled for master port 10                          */
  #define MPC_REGION_MASTERPORT_ENABLE10_Enable (0x1UL) /*!< Region n is enabled for master port 10                            */

/* ENABLE11 @Bit 11 : Enable region n for master port 11 */
  #define MPC_REGION_MASTERPORT_ENABLE11_Pos (11UL)  /*!< Position of ENABLE11 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE11_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE11_Min (0x0UL) /*!< Min enumerator value of ENABLE11 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE11_Max (0x1UL) /*!< Max enumerator value of ENABLE11 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE11_Disable (0x0UL) /*!< Region n is disabled for master port 11                          */
  #define MPC_REGION_MASTERPORT_ENABLE11_Enable (0x1UL) /*!< Region n is enabled for master port 11                            */

/* ENABLE12 @Bit 12 : Enable region n for master port 12 */
  #define MPC_REGION_MASTERPORT_ENABLE12_Pos (12UL)  /*!< Position of ENABLE12 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE12_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE12_Pos) /*!< Bit mask of ENABLE12 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE12_Min (0x0UL) /*!< Min enumerator value of ENABLE12 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE12_Max (0x1UL) /*!< Max enumerator value of ENABLE12 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE12_Disable (0x0UL) /*!< Region n is disabled for master port 12                          */
  #define MPC_REGION_MASTERPORT_ENABLE12_Enable (0x1UL) /*!< Region n is enabled for master port 12                            */

/* ENABLE13 @Bit 13 : Enable region n for master port 13 */
  #define MPC_REGION_MASTERPORT_ENABLE13_Pos (13UL)  /*!< Position of ENABLE13 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE13_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE13_Pos) /*!< Bit mask of ENABLE13 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE13_Min (0x0UL) /*!< Min enumerator value of ENABLE13 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE13_Max (0x1UL) /*!< Max enumerator value of ENABLE13 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE13_Disable (0x0UL) /*!< Region n is disabled for master port 13                          */
  #define MPC_REGION_MASTERPORT_ENABLE13_Enable (0x1UL) /*!< Region n is enabled for master port 13                            */

/* ENABLE14 @Bit 14 : Enable region n for master port 14 */
  #define MPC_REGION_MASTERPORT_ENABLE14_Pos (14UL)  /*!< Position of ENABLE14 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE14_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE14_Pos) /*!< Bit mask of ENABLE14 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE14_Min (0x0UL) /*!< Min enumerator value of ENABLE14 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE14_Max (0x1UL) /*!< Max enumerator value of ENABLE14 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE14_Disable (0x0UL) /*!< Region n is disabled for master port 14                          */
  #define MPC_REGION_MASTERPORT_ENABLE14_Enable (0x1UL) /*!< Region n is enabled for master port 14                            */

/* ENABLE15 @Bit 15 : Enable region n for master port 15 */
  #define MPC_REGION_MASTERPORT_ENABLE15_Pos (15UL)  /*!< Position of ENABLE15 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE15_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE15_Pos) /*!< Bit mask of ENABLE15 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE15_Min (0x0UL) /*!< Min enumerator value of ENABLE15 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE15_Max (0x1UL) /*!< Max enumerator value of ENABLE15 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE15_Disable (0x0UL) /*!< Region n is disabled for master port 15                          */
  #define MPC_REGION_MASTERPORT_ENABLE15_Enable (0x1UL) /*!< Region n is enabled for master port 15                            */

/* ENABLE16 @Bit 16 : Enable region n for master port 16 */
  #define MPC_REGION_MASTERPORT_ENABLE16_Pos (16UL)  /*!< Position of ENABLE16 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE16_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE16_Pos) /*!< Bit mask of ENABLE16 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE16_Min (0x0UL) /*!< Min enumerator value of ENABLE16 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE16_Max (0x1UL) /*!< Max enumerator value of ENABLE16 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE16_Disable (0x0UL) /*!< Region n is disabled for master port 16                          */
  #define MPC_REGION_MASTERPORT_ENABLE16_Enable (0x1UL) /*!< Region n is enabled for master port 16                            */

/* ENABLE17 @Bit 17 : Enable region n for master port 17 */
  #define MPC_REGION_MASTERPORT_ENABLE17_Pos (17UL)  /*!< Position of ENABLE17 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE17_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE17_Pos) /*!< Bit mask of ENABLE17 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE17_Min (0x0UL) /*!< Min enumerator value of ENABLE17 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE17_Max (0x1UL) /*!< Max enumerator value of ENABLE17 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE17_Disable (0x0UL) /*!< Region n is disabled for master port 17                          */
  #define MPC_REGION_MASTERPORT_ENABLE17_Enable (0x1UL) /*!< Region n is enabled for master port 17                            */

/* ENABLE18 @Bit 18 : Enable region n for master port 18 */
  #define MPC_REGION_MASTERPORT_ENABLE18_Pos (18UL)  /*!< Position of ENABLE18 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE18_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE18_Pos) /*!< Bit mask of ENABLE18 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE18_Min (0x0UL) /*!< Min enumerator value of ENABLE18 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE18_Max (0x1UL) /*!< Max enumerator value of ENABLE18 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE18_Disable (0x0UL) /*!< Region n is disabled for master port 18                          */
  #define MPC_REGION_MASTERPORT_ENABLE18_Enable (0x1UL) /*!< Region n is enabled for master port 18                            */

/* ENABLE19 @Bit 19 : Enable region n for master port 19 */
  #define MPC_REGION_MASTERPORT_ENABLE19_Pos (19UL)  /*!< Position of ENABLE19 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE19_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE19_Pos) /*!< Bit mask of ENABLE19 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE19_Min (0x0UL) /*!< Min enumerator value of ENABLE19 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE19_Max (0x1UL) /*!< Max enumerator value of ENABLE19 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE19_Disable (0x0UL) /*!< Region n is disabled for master port 19                          */
  #define MPC_REGION_MASTERPORT_ENABLE19_Enable (0x1UL) /*!< Region n is enabled for master port 19                            */

/* ENABLE20 @Bit 20 : Enable region n for master port 20 */
  #define MPC_REGION_MASTERPORT_ENABLE20_Pos (20UL)  /*!< Position of ENABLE20 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE20_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE20_Pos) /*!< Bit mask of ENABLE20 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE20_Min (0x0UL) /*!< Min enumerator value of ENABLE20 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE20_Max (0x1UL) /*!< Max enumerator value of ENABLE20 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE20_Disable (0x0UL) /*!< Region n is disabled for master port 20                          */
  #define MPC_REGION_MASTERPORT_ENABLE20_Enable (0x1UL) /*!< Region n is enabled for master port 20                            */

/* ENABLE21 @Bit 21 : Enable region n for master port 21 */
  #define MPC_REGION_MASTERPORT_ENABLE21_Pos (21UL)  /*!< Position of ENABLE21 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE21_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE21_Pos) /*!< Bit mask of ENABLE21 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE21_Min (0x0UL) /*!< Min enumerator value of ENABLE21 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE21_Max (0x1UL) /*!< Max enumerator value of ENABLE21 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE21_Disable (0x0UL) /*!< Region n is disabled for master port 21                          */
  #define MPC_REGION_MASTERPORT_ENABLE21_Enable (0x1UL) /*!< Region n is enabled for master port 21                            */

/* ENABLE22 @Bit 22 : Enable region n for master port 22 */
  #define MPC_REGION_MASTERPORT_ENABLE22_Pos (22UL)  /*!< Position of ENABLE22 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE22_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE22_Pos) /*!< Bit mask of ENABLE22 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE22_Min (0x0UL) /*!< Min enumerator value of ENABLE22 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE22_Max (0x1UL) /*!< Max enumerator value of ENABLE22 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE22_Disable (0x0UL) /*!< Region n is disabled for master port 22                          */
  #define MPC_REGION_MASTERPORT_ENABLE22_Enable (0x1UL) /*!< Region n is enabled for master port 22                            */

/* ENABLE23 @Bit 23 : Enable region n for master port 23 */
  #define MPC_REGION_MASTERPORT_ENABLE23_Pos (23UL)  /*!< Position of ENABLE23 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE23_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE23_Pos) /*!< Bit mask of ENABLE23 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE23_Min (0x0UL) /*!< Min enumerator value of ENABLE23 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE23_Max (0x1UL) /*!< Max enumerator value of ENABLE23 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE23_Disable (0x0UL) /*!< Region n is disabled for master port 23                          */
  #define MPC_REGION_MASTERPORT_ENABLE23_Enable (0x1UL) /*!< Region n is enabled for master port 23                            */

