tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ENABLE24 @Bit 24 : Enable region n for master port 24 */
  #define MPC_REGION_MASTERPORT_ENABLE24_Pos (24UL)  /*!< Position of ENABLE24 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE24_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE24_Pos) /*!< Bit mask of ENABLE24 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE24_Min (0x0UL) /*!< Min enumerator value of ENABLE24 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE24_Max (0x1UL) /*!< Max enumerator value of ENABLE24 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE24_Disable (0x0UL) /*!< Region n is disabled for master port 24                          */
  #define MPC_REGION_MASTERPORT_ENABLE24_Enable (0x1UL) /*!< Region n is enabled for master port 24                            */

/* ENABLE25 @Bit 25 : Enable region n for master port 25 */
  #define MPC_REGION_MASTERPORT_ENABLE25_Pos (25UL)  /*!< Position of ENABLE25 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE25_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE25_Pos) /*!< Bit mask of ENABLE25 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE25_Min (0x0UL) /*!< Min enumerator value of ENABLE25 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE25_Max (0x1UL) /*!< Max enumerator value of ENABLE25 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE25_Disable (0x0UL) /*!< Region n is disabled for master port 25                          */
  #define MPC_REGION_MASTERPORT_ENABLE25_Enable (0x1UL) /*!< Region n is enabled for master port 25                            */

/* ENABLE26 @Bit 26 : Enable region n for master port 26 */
  #define MPC_REGION_MASTERPORT_ENABLE26_Pos (26UL)  /*!< Position of ENABLE26 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE26_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE26_Pos) /*!< Bit mask of ENABLE26 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE26_Min (0x0UL) /*!< Min enumerator value of ENABLE26 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE26_Max (0x1UL) /*!< Max enumerator value of ENABLE26 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE26_Disable (0x0UL) /*!< Region n is disabled for master port 26                          */
  #define MPC_REGION_MASTERPORT_ENABLE26_Enable (0x1UL) /*!< Region n is enabled for master port 26                            */

/* ENABLE27 @Bit 27 : Enable region n for master port 27 */
  #define MPC_REGION_MASTERPORT_ENABLE27_Pos (27UL)  /*!< Position of ENABLE27 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE27_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE27_Pos) /*!< Bit mask of ENABLE27 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE27_Min (0x0UL) /*!< Min enumerator value of ENABLE27 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE27_Max (0x1UL) /*!< Max enumerator value of ENABLE27 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE27_Disable (0x0UL) /*!< Region n is disabled for master port 27                          */
  #define MPC_REGION_MASTERPORT_ENABLE27_Enable (0x1UL) /*!< Region n is enabled for master port 27                            */

/* ENABLE28 @Bit 28 : Enable region n for master port 28 */
  #define MPC_REGION_MASTERPORT_ENABLE28_Pos (28UL)  /*!< Position of ENABLE28 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE28_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE28_Pos) /*!< Bit mask of ENABLE28 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE28_Min (0x0UL) /*!< Min enumerator value of ENABLE28 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE28_Max (0x1UL) /*!< Max enumerator value of ENABLE28 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE28_Disable (0x0UL) /*!< Region n is disabled for master port 28                          */
  #define MPC_REGION_MASTERPORT_ENABLE28_Enable (0x1UL) /*!< Region n is enabled for master port 28                            */

/* ENABLE29 @Bit 29 : Enable region n for master port 29 */
  #define MPC_REGION_MASTERPORT_ENABLE29_Pos (29UL)  /*!< Position of ENABLE29 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE29_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE29_Pos) /*!< Bit mask of ENABLE29 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE29_Min (0x0UL) /*!< Min enumerator value of ENABLE29 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE29_Max (0x1UL) /*!< Max enumerator value of ENABLE29 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE29_Disable (0x0UL) /*!< Region n is disabled for master port 29                          */
  #define MPC_REGION_MASTERPORT_ENABLE29_Enable (0x1UL) /*!< Region n is enabled for master port 29                            */

/* ENABLE30 @Bit 30 : Enable region n for master port 30 */
  #define MPC_REGION_MASTERPORT_ENABLE30_Pos (30UL)  /*!< Position of ENABLE30 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE30_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE30_Pos) /*!< Bit mask of ENABLE30 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE30_Min (0x0UL) /*!< Min enumerator value of ENABLE30 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE30_Max (0x1UL) /*!< Max enumerator value of ENABLE30 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE30_Disable (0x0UL) /*!< Region n is disabled for master port 30                          */
  #define MPC_REGION_MASTERPORT_ENABLE30_Enable (0x1UL) /*!< Region n is enabled for master port 30                            */

/* ENABLE31 @Bit 31 : Enable region n for master port 31 */
  #define MPC_REGION_MASTERPORT_ENABLE31_Pos (31UL)  /*!< Position of ENABLE31 field.                                          */
  #define MPC_REGION_MASTERPORT_ENABLE31_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE31_Pos) /*!< Bit mask of ENABLE31 field.    */
  #define MPC_REGION_MASTERPORT_ENABLE31_Min (0x0UL) /*!< Min enumerator value of ENABLE31 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE31_Max (0x1UL) /*!< Max enumerator value of ENABLE31 field.                              */
  #define MPC_REGION_MASTERPORT_ENABLE31_Disable (0x0UL) /*!< Region n is disabled for master port 31                          */
  #define MPC_REGION_MASTERPORT_ENABLE31_Enable (0x1UL) /*!< Region n is enabled for master port 31                            */



/* =================================================== Struct MPC_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [MPC_OVERRIDE] Special privilege tables
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Override region n Configuration register              */
  __IOM uint32_t  STARTADDR;                         /*!< (@ 0x00000004) Override region n Start Address                       */
  __IOM uint32_t  ENDADDR;                           /*!< (@ 0x00000008) Override region n End Address                         */
  __IOM int32_t   OFFSET;                            /*!< (@ 0x0000000C) Address offset value divided by 2 for override region n
                                                                         address re-map*/
  __IOM uint32_t  PERM;                              /*!< (@ 0x00000010) Permission settings for override region n             */
  __IOM uint32_t  PERMMASK;                          /*!< (@ 0x00000014) Masks permission setting fields from register
                                                                         OVERRIDE.PERM*/
  __IOM uint32_t  OWNER;                             /*!< (@ 0x00000018) Owner for override region                             */
  __IOM uint32_t  MASTERPORT;                        /*!< (@ 0x0000001C) Override region n local master enable                 */
} NRF_MPC_OVERRIDE_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define MPC_OVERRIDE_MaxCount (40UL)               /*!< Size of OVERRIDE[40] array.                                          */
  #define MPC_OVERRIDE_MaxIndex (39UL)               /*!< Max index of OVERRIDE[40] array.                                     */
  #define MPC_OVERRIDE_MinIndex (0UL)                /*!< Min index of OVERRIDE[40] array.                                     */

