tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MPC_OVERRIDE_CONFIG: Override region n Configuration register */
  #define MPC_OVERRIDE_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                   */

/* SLAVENUMBER @Bits 0..4 : Target slave number for override region n accesses. Slave number 0 is reserved for default slave */
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos (0UL)  /*!< Position of SLAVENUMBER field.                                       */
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Msk (0x1FUL << MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos) /*!< Bit mask of SLAVENUMBER
                                                                            field.*/
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Min (0x00UL) /*!< Min value of SLAVENUMBER field.                                    */
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Max (0x1FUL) /*!< Max size of SLAVENUMBER field.                                     */

/* LOCK @Bit 8 : Lock Override region n */
  #define MPC_OVERRIDE_CONFIG_LOCK_Pos (8UL)         /*!< Position of LOCK field.                                              */
  #define MPC_OVERRIDE_CONFIG_LOCK_Msk (0x1UL << MPC_OVERRIDE_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define MPC_OVERRIDE_CONFIG_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define MPC_OVERRIDE_CONFIG_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define MPC_OVERRIDE_CONFIG_LOCK_Unlocked (0x0UL)  /*!< Override region n settings can be updated                            */
  #define MPC_OVERRIDE_CONFIG_LOCK_Locked (0x1UL)    /*!< Override region n settings can't be updated until next reset         */

/* ENABLE @Bit 9 : Enable Override region n */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Pos (9UL)       /*!< Position of ENABLE field.                                            */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Msk (0x1UL << MPC_OVERRIDE_CONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Disabled (0x0UL) /*!< Override region n is not used                                       */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Enabled (0x1UL) /*!< Override region n is used                                            */

/* SECDOMENABLE @Bit 10 : Secure domain access enable for Override region n */
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos (10UL) /*!< Position of SECDOMENABLE field.                                     */
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Msk (0x1UL << MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos) /*!< Bit mask of SECDOMENABLE
                                                                            field.*/
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Min (0x0UL) /*!< Min enumerator value of SECDOMENABLE field.                        */
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Max (0x1UL) /*!< Max enumerator value of SECDOMENABLE field.                        */
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Disabled (0x0UL) /*!< Overriding of secure domain permissions is disabled for
                                                                 override region n*/
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Enabled (0x1UL) /*!< Overriding of secure domain permissions is enabled for override
                                                                region n*/

/* SECUREMASK @Bit 12 : Secure mask enable for Override region n */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Pos (12UL)  /*!< Position of SECUREMASK field.                                        */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Msk (0x1UL << MPC_OVERRIDE_CONFIG_SECUREMASK_Pos) /*!< Bit mask of SECUREMASK field.  */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Min (0x0UL) /*!< Min enumerator value of SECUREMASK field.                            */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Max (0x1UL) /*!< Max enumerator value of SECUREMASK field.                            */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Disabled (0x0UL) /*!< Mask is disabled for override region n                          */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Enabled (0x1UL) /*!< Mask is enabled for override region n                            */


/* MPC_OVERRIDE_STARTADDR: Override region n Start Address */
  #define MPC_OVERRIDE_STARTADDR_ResetValue (0x00000000UL) /*!< Reset value of STARTADDR register.                             */

/* STARTADDR @Bits 0..31 : Start address for override region n */
  #define MPC_OVERRIDE_STARTADDR_STARTADDR_Pos (0UL) /*!< Position of STARTADDR field.                                         */
  #define MPC_OVERRIDE_STARTADDR_STARTADDR_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_STARTADDR_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MPC_OVERRIDE_ENDADDR: Override region n End Address */
  #define MPC_OVERRIDE_ENDADDR_ResetValue (0x00000000UL) /*!< Reset value of ENDADDR register.                                 */

/* ENDADDR @Bits 0..31 : End address for override region n */
  #define MPC_OVERRIDE_ENDADDR_ENDADDR_Pos (0UL)     /*!< Position of ENDADDR field.                                           */
  #define MPC_OVERRIDE_ENDADDR_ENDADDR_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_ENDADDR_ENDADDR_Pos) /*!< Bit mask of ENDADDR field.  */


/* MPC_OVERRIDE_OFFSET: Address offset value divided by 2 for override region n address re-map */
  #define MPC_OVERRIDE_OFFSET_ResetValue (0x00000000UL) /*!< Reset value of OFFSET register.                                   */

/* OFFSET @Bits 0..31 : Offset value */
  #define MPC_OVERRIDE_OFFSET_OFFSET_Pos (0UL)       /*!< Position of OFFSET field.                                            */
  #define MPC_OVERRIDE_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_OFFSET_OFFSET_Pos) /*!< Bit mask of OFFSET field.       */


/* MPC_OVERRIDE_PERM: Permission settings for override region n */
  #define MPC_OVERRIDE_PERM_ResetValue (0x00000000UL) /*!< Reset value of PERM register.                                       */

/* READ @Bit 0 : Read access */
  #define MPC_OVERRIDE_PERM_READ_Pos (0UL)           /*!< Position of READ field.                                              */
  #define MPC_OVERRIDE_PERM_READ_Msk (0x1UL << MPC_OVERRIDE_PERM_READ_Pos) /*!< Bit mask of READ field.                        */
  #define MPC_OVERRIDE_PERM_READ_Min (0x0UL)         /*!< Min enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERM_READ_Max (0x1UL)         /*!< Max enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERM_READ_NotAllowed (0x0UL)  /*!< Read access to override region n is not allowed                      */
  #define MPC_OVERRIDE_PERM_READ_Allowed (0x1UL)     /*!< Read access to override region n is allowed                          */

