tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* WRITE @Bit 1 : Write access */
  #define MPC_OVERRIDE_PERM_WRITE_Pos (1UL)          /*!< Position of WRITE field.                                             */
  #define MPC_OVERRIDE_PERM_WRITE_Msk (0x1UL << MPC_OVERRIDE_PERM_WRITE_Pos) /*!< Bit mask of WRITE field.                     */
  #define MPC_OVERRIDE_PERM_WRITE_Min (0x0UL)        /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERM_WRITE_Max (0x1UL)        /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERM_WRITE_NotAllowed (0x0UL) /*!< Write access to override region n is not allowed                     */
  #define MPC_OVERRIDE_PERM_WRITE_Allowed (0x1UL)    /*!< Write access to override region n is allowed                         */

/* EXECUTE @Bit 2 : Software execute */
  #define MPC_OVERRIDE_PERM_EXECUTE_Pos (2UL)        /*!< Position of EXECUTE field.                                           */
  #define MPC_OVERRIDE_PERM_EXECUTE_Msk (0x1UL << MPC_OVERRIDE_PERM_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.               */
  #define MPC_OVERRIDE_PERM_EXECUTE_Min (0x0UL)      /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERM_EXECUTE_Max (0x1UL)      /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERM_EXECUTE_NotAllowed (0x0UL) /*!< Software execution from override region n is not allowed           */
  #define MPC_OVERRIDE_PERM_EXECUTE_Allowed (0x1UL)  /*!< Software execution from override region n is allowed                 */

/* SECATTR @Bit 3 : Security mapping */
  #define MPC_OVERRIDE_PERM_SECATTR_Pos (3UL)        /*!< Position of SECATTR field.                                           */
  #define MPC_OVERRIDE_PERM_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERM_SECATTR_Pos) /*!< Bit mask of SECATTR field.               */
  #define MPC_OVERRIDE_PERM_SECATTR_Min (0x0UL)      /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERM_SECATTR_Max (0x1UL)      /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERM_SECATTR_Secure (0x1UL)   /*!< Override region n is mapped in secure memory address space           */
  #define MPC_OVERRIDE_PERM_SECATTR_NonSecure (0x0UL) /*!< Override region n is mapped in non-secure memory address space      */


/* MPC_OVERRIDE_PERMMASK: Masks permission setting fields from register OVERRIDE.PERM */
  #define MPC_OVERRIDE_PERMMASK_ResetValue (0x00000000UL) /*!< Reset value of PERMMASK register.                               */

/* READ @Bit 0 : Read mask */
  #define MPC_OVERRIDE_PERMMASK_READ_Pos (0UL)       /*!< Position of READ field.                                              */
  #define MPC_OVERRIDE_PERMMASK_READ_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_READ_Pos) /*!< Bit mask of READ field.                */
  #define MPC_OVERRIDE_PERMMASK_READ_Min (0x0UL)     /*!< Min enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERMMASK_READ_Max (0x1UL)     /*!< Max enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERMMASK_READ_Masked (0x0UL)  /*!< Permission setting READ in OVERRIDE register will not be applied     */
  #define MPC_OVERRIDE_PERMMASK_READ_UnMasked (0x1UL) /*!< Permission setting READ in OVERRIDE register will be applied        */

/* WRITE @Bit 1 : Write mask */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Pos (1UL)      /*!< Position of WRITE field.                                             */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_WRITE_Pos) /*!< Bit mask of WRITE field.             */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Min (0x0UL)    /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Max (0x1UL)    /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Masked (0x0UL) /*!< Permission setting WRITE in OVERRIDE register will not be applied    */
  #define MPC_OVERRIDE_PERMMASK_WRITE_UnMasked (0x1UL) /*!< Permission setting WRITE in OVERRIDE register will be applied      */

/* EXECUTE @Bit 2 : Execute mask */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Pos (2UL)    /*!< Position of EXECUTE field.                                           */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.       */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Min (0x0UL)  /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Max (0x1UL)  /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Masked (0x0UL) /*!< Permission setting EXECUTE in OVERRIDE register will not be applied*/
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_UnMasked (0x1UL) /*!< Permission setting EXECUTE in OVERRIDE register will be applied  */

/* SECATTR @Bit 3 : Security mapping mask */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Pos (3UL)    /*!< Position of SECATTR field.                                           */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Masked (0x0UL) /*!< Permission setting SECATTR in OVERRIDE register will not be applied*/
  #define MPC_OVERRIDE_PERMMASK_SECATTR_UnMasked (0x1UL) /*!< Permission setting SECATTR in OVERRIDE register will be applied  */


/* MPC_OVERRIDE_OWNER: Owner for override region */
  #define MPC_OVERRIDE_OWNER_ResetValue (0x00000000UL) /*!< Reset value of OWNER register.                                     */

/* OWNERID @Bits 0..3 : owner identifier for override region n */
  #define MPC_OVERRIDE_OWNER_OWNERID_Pos (0UL)       /*!< Position of OWNERID field.                                           */
  #define MPC_OVERRIDE_OWNER_OWNERID_Msk (0xFUL << MPC_OVERRIDE_OWNER_OWNERID_Pos) /*!< Bit mask of OWNERID field.             */
  #define MPC_OVERRIDE_OWNER_OWNERID_Min (0x0UL)     /*!< Min value of OWNERID field.                                          */
  #define MPC_OVERRIDE_OWNER_OWNERID_Max (0xFUL)     /*!< Max size of OWNERID field.                                           */


