tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MPC_OVERRIDE_MASTERPORT: Override region n local master enable */
  #define MPC_OVERRIDE_MASTERPORT_ResetValue (0x00000000UL) /*!< Reset value of MASTERPORT register.                           */

/* ENABLE0 @Bit 0 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos (0UL)  /*!< Position of ENABLE0 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Min (0x0UL) /*!< Min enumerator value of ENABLE0 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Max (0x1UL) /*!< Max enumerator value of ENABLE0 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Disable (0x0UL) /*!< Override region n is disabled for master port 0                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Enable (0x1UL) /*!< Override region n is enabled for master port 0                   */

/* ENABLE1 @Bit 1 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos (1UL)  /*!< Position of ENABLE1 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Min (0x0UL) /*!< Min enumerator value of ENABLE1 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Max (0x1UL) /*!< Max enumerator value of ENABLE1 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Disable (0x0UL) /*!< Override region n is disabled for master port 1                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Enable (0x1UL) /*!< Override region n is enabled for master port 1                   */

/* ENABLE2 @Bit 2 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos (2UL)  /*!< Position of ENABLE2 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Min (0x0UL) /*!< Min enumerator value of ENABLE2 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Max (0x1UL) /*!< Max enumerator value of ENABLE2 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Disable (0x0UL) /*!< Override region n is disabled for master port 2                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Enable (0x1UL) /*!< Override region n is enabled for master port 2                   */

/* ENABLE3 @Bit 3 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos (3UL)  /*!< Position of ENABLE3 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Min (0x0UL) /*!< Min enumerator value of ENABLE3 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Max (0x1UL) /*!< Max enumerator value of ENABLE3 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Disable (0x0UL) /*!< Override region n is disabled for master port 3                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Enable (0x1UL) /*!< Override region n is enabled for master port 3                   */

/* ENABLE4 @Bit 4 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos (4UL)  /*!< Position of ENABLE4 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Min (0x0UL) /*!< Min enumerator value of ENABLE4 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Max (0x1UL) /*!< Max enumerator value of ENABLE4 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Disable (0x0UL) /*!< Override region n is disabled for master port 4                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Enable (0x1UL) /*!< Override region n is enabled for master port 4                   */

/* ENABLE5 @Bit 5 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos (5UL)  /*!< Position of ENABLE5 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Min (0x0UL) /*!< Min enumerator value of ENABLE5 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Max (0x1UL) /*!< Max enumerator value of ENABLE5 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Disable (0x0UL) /*!< Override region n is disabled for master port 5                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Enable (0x1UL) /*!< Override region n is enabled for master port 5                   */

/* ENABLE6 @Bit 6 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos (6UL)  /*!< Position of ENABLE6 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Min (0x0UL) /*!< Min enumerator value of ENABLE6 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Max (0x1UL) /*!< Max enumerator value of ENABLE6 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Disable (0x0UL) /*!< Override region n is disabled for master port 6                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Enable (0x1UL) /*!< Override region n is enabled for master port 6                   */

/* ENABLE7 @Bit 7 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos (7UL)  /*!< Position of ENABLE7 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Min (0x0UL) /*!< Min enumerator value of ENABLE7 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Max (0x1UL) /*!< Max enumerator value of ENABLE7 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Disable (0x0UL) /*!< Override region n is disabled for master port 7                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Enable (0x1UL) /*!< Override region n is enabled for master port 7                   */

/* ENABLE8 @Bit 8 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos (8UL)  /*!< Position of ENABLE8 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Min (0x0UL) /*!< Min enumerator value of ENABLE8 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Max (0x1UL) /*!< Max enumerator value of ENABLE8 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Disable (0x0UL) /*!< Override region n is disabled for master port 8                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Enable (0x1UL) /*!< Override region n is enabled for master port 8                   */

/* ENABLE9 @Bit 9 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos (9UL)  /*!< Position of ENABLE9 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Min (0x0UL) /*!< Min enumerator value of ENABLE9 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Max (0x1UL) /*!< Max enumerator value of ENABLE9 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Disable (0x0UL) /*!< Override region n is disabled for master port 9                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Enable (0x1UL) /*!< Override region n is enabled for master port 9                   */

/* ENABLE10 @Bit 10 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos (10UL) /*!< Position of ENABLE10 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Min (0x0UL) /*!< Min enumerator value of ENABLE10 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Max (0x1UL) /*!< Max enumerator value of ENABLE10 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Disable (0x0UL) /*!< Override region n is disabled for master port 10               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Enable (0x1UL) /*!< Override region n is enabled for master port 10                 */

/* ENABLE11 @Bit 11 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos (11UL) /*!< Position of ENABLE11 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Min (0x0UL) /*!< Min enumerator value of ENABLE11 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Max (0x1UL) /*!< Max enumerator value of ENABLE11 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Disable (0x0UL) /*!< Override region n is disabled for master port 11               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Enable (0x1UL) /*!< Override region n is enabled for master port 11                 */

/* ENABLE12 @Bit 12 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos (12UL) /*!< Position of ENABLE12 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos) /*!< Bit mask of ENABLE12 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Min (0x0UL) /*!< Min enumerator value of ENABLE12 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Max (0x1UL) /*!< Max enumerator value of ENABLE12 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Disable (0x0UL) /*!< Override region n is disabled for master port 12               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Enable (0x1UL) /*!< Override region n is enabled for master port 12                 */

/* ENABLE13 @Bit 13 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos (13UL) /*!< Position of ENABLE13 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos) /*!< Bit mask of ENABLE13 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Min (0x0UL) /*!< Min enumerator value of ENABLE13 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Max (0x1UL) /*!< Max enumerator value of ENABLE13 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Disable (0x0UL) /*!< Override region n is disabled for master port 13               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Enable (0x1UL) /*!< Override region n is enabled for master port 13                 */

/* ENABLE14 @Bit 14 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos (14UL) /*!< Position of ENABLE14 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos) /*!< Bit mask of ENABLE14 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Min (0x0UL) /*!< Min enumerator value of ENABLE14 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Max (0x1UL) /*!< Max enumerator value of ENABLE14 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Disable (0x0UL) /*!< Override region n is disabled for master port 14               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Enable (0x1UL) /*!< Override region n is enabled for master port 14                 */

/* ENABLE15 @Bit 15 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Pos (15UL) /*!< Position of ENABLE15 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE15_Pos) /*!< Bit mask of ENABLE15 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Min (0x0UL) /*!< Min enumerator value of ENABLE15 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Max (0x1UL) /*!< Max enumerator value of ENABLE15 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Disable (0x0UL) /*!< Override region n is disabled for master port 15               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Enable (0x1UL) /*!< Override region n is enabled for master port 15                 */

/* ENABLE16 @Bit 16 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Pos (16UL) /*!< Position of ENABLE16 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE16_Pos) /*!< Bit mask of ENABLE16 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Min (0x0UL) /*!< Min enumerator value of ENABLE16 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Max (0x1UL) /*!< Max enumerator value of ENABLE16 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Disable (0x0UL) /*!< Override region n is disabled for master port 16               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Enable (0x1UL) /*!< Override region n is enabled for master port 16                 */

/* ENABLE17 @Bit 17 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Pos (17UL) /*!< Position of ENABLE17 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE17_Pos) /*!< Bit mask of ENABLE17 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Min (0x0UL) /*!< Min enumerator value of ENABLE17 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Max (0x1UL) /*!< Max enumerator value of ENABLE17 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Disable (0x0UL) /*!< Override region n is disabled for master port 17               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Enable (0x1UL) /*!< Override region n is enabled for master port 17                 */

/* ENABLE18 @Bit 18 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Pos (18UL) /*!< Position of ENABLE18 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE18_Pos) /*!< Bit mask of ENABLE18 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Min (0x0UL) /*!< Min enumerator value of ENABLE18 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Max (0x1UL) /*!< Max enumerator value of ENABLE18 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Disable (0x0UL) /*!< Override region n is disabled for master port 18               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Enable (0x1UL) /*!< Override region n is enabled for master port 18                 */

/* ENABLE19 @Bit 19 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Pos (19UL) /*!< Position of ENABLE19 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE19_Pos) /*!< Bit mask of ENABLE19 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Min (0x0UL) /*!< Min enumerator value of ENABLE19 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Max (0x1UL) /*!< Max enumerator value of ENABLE19 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Disable (0x0UL) /*!< Override region n is disabled for master port 19               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Enable (0x1UL) /*!< Override region n is enabled for master port 19                 */

