tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MUTEX_MUTEX: Mutex register */
  #define MUTEX_MUTEX_MaxCount (32UL)                /*!< Max size of MUTEX[32] array.                                         */
  #define MUTEX_MUTEX_MaxIndex (31UL)                /*!< Max index of MUTEX[32] array.                                        */
  #define MUTEX_MUTEX_MinIndex (0UL)                 /*!< Min index of MUTEX[32] array.                                        */
  #define MUTEX_MUTEX_ResetValue (0x00000000UL)      /*!< Reset value of MUTEX[32] register.                                   */

/* MUTEX @Bit 0 : Mutex register n */
  #define MUTEX_MUTEX_MUTEX_Pos (0UL)                /*!< Position of MUTEX field.                                             */
  #define MUTEX_MUTEX_MUTEX_Msk (0x1UL << MUTEX_MUTEX_MUTEX_Pos) /*!< Bit mask of MUTEX field.                                 */
  #define MUTEX_MUTEX_MUTEX_Min (0x0UL)              /*!< Min enumerator value of MUTEX field.                                 */
  #define MUTEX_MUTEX_MUTEX_Max (0x1UL)              /*!< Max enumerator value of MUTEX field.                                 */
  #define MUTEX_MUTEX_MUTEX_Unlocked (0x0UL)         /*!< Mutex n is in unlocked state                                         */
  #define MUTEX_MUTEX_MUTEX_Locked (0x1UL)           /*!< Mutex n is in locked state                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MVDMA                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct MVDMA_STATUS =================================================== */
/**
  * @brief STATUS [MVDMA_STATUS] MVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  CRCRESULT;                         /*!< (@ 0x00000000) CRC checksum calculation result                       */
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000004) Status of intermediate fifo: empty, not empty and full
                                                                         information available.*/
  __IM  uint32_t  ACTIVE;                            /*!< (@ 0x00000008) Status of DMA transfer.                               */
  __IM  uint32_t  SOURCEBUSERROR;                    /*!< (@ 0x0000000C) Source bus error status.                              */
  __IM  uint32_t  SINKBUSERROR;                      /*!< (@ 0x00000010) Sink bus error status.                                */
  __IM  uint32_t  SOURCEADDRESS;                     /*!< (@ 0x00000014) Latest address being accessed on the Source channel.  */
  __IM  uint32_t  SINKADDRESS;                       /*!< (@ 0x00000018) Latest address being accessed on the Sink channel.    */
  __IM  uint32_t  SOURCEJOBCOUNT;                    /*!< (@ 0x0000001C) Number of completed jobs in the current Source
                                                                         descriptor list.*/
  __IM  uint32_t  SINKJOBCOUNT;                      /*!< (@ 0x00000020) Number of completed jobs in the current Sink descriptor
                                                                         list.*/
} NRF_MVDMA_STATUS_Type;                             /*!< Size = 36 (0x024)                                                    */

/* MVDMA_STATUS_CRCRESULT: CRC checksum calculation result */
  #define MVDMA_STATUS_CRCRESULT_ResetValue (0x00000000UL) /*!< Reset value of CRCRESULT register.                             */

/* CRC @Bits 0..31 : Result */
  #define MVDMA_STATUS_CRCRESULT_CRC_Pos (0UL)       /*!< Position of CRC field.                                               */
  #define MVDMA_STATUS_CRCRESULT_CRC_Msk (0xFFFFFFFFUL << MVDMA_STATUS_CRCRESULT_CRC_Pos) /*!< Bit mask of CRC field.          */


/* MVDMA_STATUS_FIFO: Status of intermediate fifo: empty, not empty and full information available. */
  #define MVDMA_STATUS_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO register.                                       */

/* FIFOSTATUS @Bits 0..1 : Result */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Pos (0UL)     /*!< Position of FIFOSTATUS field.                                        */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Msk (0x3UL << MVDMA_STATUS_FIFO_FIFOSTATUS_Pos) /*!< Bit mask of FIFOSTATUS field.      */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Min (0x0UL)   /*!< Min enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Max (0x3UL)   /*!< Max enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Empty (0x0UL) /*!< Fifo is empty.                                                       */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_AlmostFull (0x2UL) /*!< Fifo contains data.                                             */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Full (0x3UL)  /*!< Fifo is full.                                                        */


/* MVDMA_STATUS_ACTIVE: Status of DMA transfer. */
  #define MVDMA_STATUS_ACTIVE_ResetValue (0x00000000UL) /*!< Reset value of ACTIVE register.                                   */

/* ACTIVE @Bit 0 : DMA activity */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Msk (0x1UL << MVDMA_STATUS_ACTIVE_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Idle (0x0UL)    /*!< DMA is in IDLE state.                                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Active (0x1UL)  /*!< Data being transferred.                                              */


/* MVDMA_STATUS_SOURCEBUSERROR: Source bus error status. */
  #define MVDMA_STATUS_SOURCEBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of SOURCEBUSERROR register.                   */

/* BUSERROR @Bits 0..2 : Bus error type */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                      */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_Msk (0x7UL << MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                        */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_Max (0x2UL) /*!< Max enumerator value of BUSERROR field.                        */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                       */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_SlaveError (0x1UL) /*!< Error generated by slave.                               */
  #define MVDMA_STATUS_SOURCEBUSERROR_BUSERROR_DecodeError (0x2UL) /*!< Error generated by interconnect.                       */


