tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_STATUS_SINKBUSERROR: Sink bus error status. */
  #define MVDMA_STATUS_SINKBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of SINKBUSERROR register.                       */

/* BUSERROR @Bits 0..2 : Bus error type */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                        */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_Msk (0x7UL << MVDMA_STATUS_SINKBUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                          */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_Max (0x4UL) /*!< Max enumerator value of BUSERROR field.                          */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_NoError (0x0UL) /*!< There are no errors.                                         */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_ReadSlaveError (0x1UL) /*!< Read error generated by slave.                        */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Read error generated by interconnect.                */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_WriteSlaveError (0x3UL) /*!< Write error generated by slave.                      */
  #define MVDMA_STATUS_SINKBUSERROR_BUSERROR_WriteDecodeError (0x4UL) /*!< Write error generated by interconnect.              */


/* MVDMA_STATUS_SOURCEADDRESS: Latest address being accessed on the Source channel. */
  #define MVDMA_STATUS_SOURCEADDRESS_ResetValue (0x00000000UL) /*!< Reset value of SOURCEADDRESS register.                     */

/* ADDRESS @Bits 0..31 : Source address */
  #define MVDMA_STATUS_SOURCEADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define MVDMA_STATUS_SOURCEADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_STATUS_SOURCEADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* MVDMA_STATUS_SINKADDRESS: Latest address being accessed on the Sink channel. */
  #define MVDMA_STATUS_SINKADDRESS_ResetValue (0x00000000UL) /*!< Reset value of SINKADDRESS register.                         */

/* ADDRESS @Bits 0..31 : Sink address */
  #define MVDMA_STATUS_SINKADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define MVDMA_STATUS_SINKADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_STATUS_SINKADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* MVDMA_STATUS_SOURCEJOBCOUNT: Number of completed jobs in the current Source descriptor list. */
  #define MVDMA_STATUS_SOURCEJOBCOUNT_ResetValue (0x00000000UL) /*!< Reset value of SOURCEJOBCOUNT register.                   */

/* COUNT @Bits 0..31 : Source job count */
  #define MVDMA_STATUS_SOURCEJOBCOUNT_COUNT_Pos (0UL) /*!< Position of COUNT field.                                            */
  #define MVDMA_STATUS_SOURCEJOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_STATUS_SOURCEJOBCOUNT_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/


/* MVDMA_STATUS_SINKJOBCOUNT: Number of completed jobs in the current Sink descriptor list. */
  #define MVDMA_STATUS_SINKJOBCOUNT_ResetValue (0x00000000UL) /*!< Reset value of SINKJOBCOUNT register.                       */

/* COUNT @Bits 0..31 : Sink job count */
  #define MVDMA_STATUS_SINKJOBCOUNT_COUNT_Pos (0UL)  /*!< Position of COUNT field.                                             */
  #define MVDMA_STATUS_SINKJOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_STATUS_SINKJOBCOUNT_COUNT_Pos) /*!< Bit mask of COUNT
                                                                            field.*/



/* =================================================== Struct MVDMA_CONFIG =================================================== */
/**
  * @brief CONFIG [MVDMA_CONFIG] MVDMA configuration registers.
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Mode that defines where the job list pointers are
                                                                         located.*/
  __IOM uint32_t  SOURCELISTPTR;                     /*!< (@ 0x00000004) Start address of Source job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IOM uint32_t  SINKLISTPTR;                       /*!< (@ 0x00000008) Start address of Sink job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  RESERVED;
} NRF_MVDMA_CONFIG_Type;                             /*!< Size = 16 (0x010)                                                    */

/* MVDMA_CONFIG_MODE: Mode that defines where the job list pointers are located. */
  #define MVDMA_CONFIG_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                       */

/* MODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_MODE_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define MVDMA_CONFIG_MODE_MODE_Msk (0x1UL << MVDMA_CONFIG_MODE_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define MVDMA_CONFIG_MODE_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_Max (0x1UL)         /*!< Max enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_SingleMode (0x0UL)  /*!< Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start
                                                          address of a single job list.*/
  #define MVDMA_CONFIG_MODE_MODE_MultiMode (0x1UL)   /*!< Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start
                                                          address of a list of job list pointers in memory.*/


