tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_CONFIG_SOURCELISTPTR: Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE.
                                */

  #define MVDMA_CONFIG_SOURCELISTPTR_ResetValue (0x00000000UL) /*!< Reset value of SOURCELISTPTR register.                     */

/* ADDRESS @Bits 0..31 : Source job descriptor list address. */
  #define MVDMA_CONFIG_SOURCELISTPTR_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                         */
  #define MVDMA_CONFIG_SOURCELISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_CONFIG_SOURCELISTPTR_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* MVDMA_CONFIG_SINKLISTPTR: Start address of Sink job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_CONFIG_SINKLISTPTR_ResetValue (0x00000000UL) /*!< Reset value of SINKLISTPTR register.                         */

/* ADDRESS @Bits 0..31 : Sink descriptor list address. */
  #define MVDMA_CONFIG_SINKLISTPTR_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                           */
  #define MVDMA_CONFIG_SINKLISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_CONFIG_SINKLISTPTR_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* ====================================================== Struct MVDMA ======================================================= */
/**
  * @brief MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each
            transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and
            they contain data buffer information, address pointers, buffer sizes and data type attributes.

  */
  typedef struct {                                   /*!< MVDMA Structure                                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000000) Stop operation.                                       */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000004) Reset operation.                                      */
    __OM uint32_t TASKS_START[8];                    /*!< (@ 0x00000008) Start operation.                                      */
    __IM uint32_t RESERVED[22];
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000080) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_RESET;                  /*!< (@ 0x00000084) Subscribe configuration for task RESET                */
    __IOM uint32_t SUBSCRIBE_START[8];               /*!< (@ 0x00000088) Subscribe configuration for task START[n]             */
    __IM uint32_t RESERVED1[22];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000100) Event indicating that Sink data descriptor list has
                                                                         been completed.*/
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000104) Event indicating that the data transfer has started.  */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) Event indicating that the data transfer has been
                                                                         stopped.*/
    __IOM uint32_t EVENTS_RESET;                     /*!< (@ 0x0000010C) Event indicating that the peripheral has been reset.  */
    __IOM uint32_t EVENTS_SOURCEBUSERROR;            /*!< (@ 0x00000110) Event indicating that a bus error has been received on
                                                                         the Source channel.*/
    __IOM uint32_t EVENTS_SINKBUSERROR;              /*!< (@ 0x00000114) Event indicating that a bus error has been received on
                                                                         the Sink channel.*/
    __IOM uint32_t EVENTS_SOURCESELECTJOBDONE;       /*!< (@ 0x00000118) Event indicating that a job on the Source channel with
                                                                         interrupt enable attribute bit active has been
                                                                         processed.*/
    __IOM uint32_t EVENTS_SINKSELECTJOBDONE;         /*!< (@ 0x0000011C) Event indicating that a job on the Sink channel with
                                                                         interrupt enable attribute bit active has been
                                                                         processed.*/
    __IM uint32_t RESERVED2[24];
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000180) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x00000184) Publish configuration for event STARTED               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_RESET;                    /*!< (@ 0x0000018C) Publish configuration for event RESET                 */
    __IOM uint32_t PUBLISH_SOURCEBUSERROR;           /*!< (@ 0x00000190) Publish configuration for event SOURCEBUSERROR        */
    __IOM uint32_t PUBLISH_SINKBUSERROR;             /*!< (@ 0x00000194) Publish configuration for event SINKBUSERROR          */
    __IOM uint32_t PUBLISH_SOURCESELECTJOBDONE;      /*!< (@ 0x00000198) Publish configuration for event SOURCESELECTJOBDONE   */
    __IOM uint32_t PUBLISH_SINKSELECTJOBDONE;        /*!< (@ 0x0000019C) Publish configuration for event SINKSELECTJOBDONE     */
    __IM uint32_t RESERVED3[88];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[60];
    __IOM NRF_MVDMA_STATUS_Type STATUS;              /*!< (@ 0x00000400) MVDMA status registers.                               */
    __IM uint32_t RESERVED5[56];
    __IOM NRF_MVDMA_CONFIG_Type CONFIG;              /*!< (@ 0x00000504) MVDMA configuration registers.                        */
  } NRF_MVDMA_Type;                                  /*!< Size = 1300 (0x514)                                                  */

/* MVDMA_TASKS_STOP: Stop operation. */
  #define MVDMA_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop operation. */
  #define MVDMA_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define MVDMA_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MVDMA_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define MVDMA_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define MVDMA_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define MVDMA_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* MVDMA_TASKS_RESET: Reset operation. */
  #define MVDMA_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                                */

