tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_EVENTS_STOPPED: Event indicating that the data transfer has been stopped. */
  #define MVDMA_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                          */

/* EVENTS_STOPPED @Bit 0 : Event indicating that the data transfer has been stopped. */
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                 */
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                   */
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                   */
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MVDMA_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                           */


/* MVDMA_EVENTS_RESET: Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RESET register.                              */

/* EVENTS_RESET @Bit 0 : Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Pos (0UL)  /*!< Position of EVENTS_RESET field.                                      */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << MVDMA_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET
                                                                            field.*/
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Min (0x0UL) /*!< Min enumerator value of EVENTS_RESET field.                         */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Max (0x1UL) /*!< Max enumerator value of EVENTS_RESET field.                         */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Generated (0x1UL) /*!< Event generated                                               */


/* MVDMA_EVENTS_SOURCEBUSERROR: Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCEBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SOURCEBUSERROR register.            */

/* EVENTS_SOURCEBUSERROR @Bit 0 : Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Pos (0UL) /*!< Position of EVENTS_SOURCEBUSERROR field.            */
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Msk (0x1UL << MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Pos)
                                                                            /*!< Bit mask of EVENTS_SOURCEBUSERROR field.*/
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_SOURCEBUSERROR
                                                                            field.*/
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_SOURCEBUSERROR
                                                                            field.*/
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define MVDMA_EVENTS_SOURCEBUSERROR_EVENTS_SOURCEBUSERROR_Generated (0x1UL) /*!< Event generated                             */


/* MVDMA_EVENTS_SINKBUSERROR: Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINKBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SINKBUSERROR register.                */

/* EVENTS_SINKBUSERROR @Bit 0 : Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Pos (0UL) /*!< Position of EVENTS_SINKBUSERROR field.                  */
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Msk (0x1UL << MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Pos) /*!<
                                                                            Bit mask of EVENTS_SINKBUSERROR field.*/
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_SINKBUSERROR field.    */
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_SINKBUSERROR field.    */
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define MVDMA_EVENTS_SINKBUSERROR_EVENTS_SINKBUSERROR_Generated (0x1UL) /*!< Event generated                                 */


/* MVDMA_EVENTS_SOURCESELECTJOBDONE: Event indicating that a job on the Source channel with interrupt enable attribute bit
                                      active has been processed. */

  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SOURCESELECTJOBDONE register.  */

/* EVENTS_SOURCESELECTJOBDONE @Bit 0 : Event indicating that a job on the Source channel with interrupt enable attribute bit
                                       active has been processed. */

  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Pos (0UL) /*!< Position of EVENTS_SOURCESELECTJOBDONE
                                                                            field.*/
  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of EVENTS_SOURCESELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_SOURCESELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_SOURCESELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated            */
  #define MVDMA_EVENTS_SOURCESELECTJOBDONE_EVENTS_SOURCESELECTJOBDONE_Generated (0x1UL) /*!< Event generated                   */


