tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_EVENTS_SINKSELECTJOBDONE: Event indicating that a job on the Sink channel with interrupt enable attribute bit active
                                    has been processed. */

  #define MVDMA_EVENTS_SINKSELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SINKSELECTJOBDONE register.      */

/* EVENTS_SINKSELECTJOBDONE @Bit 0 : Event indicating that a job on the Sink channel with interrupt enable attribute bit active
                                     has been processed. */

  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Pos (0UL) /*!< Position of EVENTS_SINKSELECTJOBDONE field.   */
  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of EVENTS_SINKSELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of
                                                                            EVENTS_SINKSELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of
                                                                            EVENTS_SINKSELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                */
  #define MVDMA_EVENTS_SINKSELECTJOBDONE_EVENTS_SINKSELECTJOBDONE_Generated (0x1UL) /*!< Event generated                       */


/* MVDMA_PUBLISH_END: Publish configuration for event END */
  #define MVDMA_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define MVDMA_PUBLISH_END_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_END_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define MVDMA_PUBLISH_END_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_END_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_END_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_END_EN_Msk (0x1UL << MVDMA_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                              */
  #define MVDMA_PUBLISH_END_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_END_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_END_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define MVDMA_PUBLISH_END_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* MVDMA_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define MVDMA_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define MVDMA_PUBLISH_STARTED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define MVDMA_PUBLISH_STARTED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_STARTED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_STARTED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_STARTED_EN_Msk (0x1UL << MVDMA_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MVDMA_PUBLISH_STARTED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_STARTED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_STARTED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define MVDMA_PUBLISH_STARTED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* MVDMA_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define MVDMA_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define MVDMA_PUBLISH_STOPPED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define MVDMA_PUBLISH_STOPPED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_STOPPED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_STOPPED_EN_Msk (0x1UL << MVDMA_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define MVDMA_PUBLISH_STOPPED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_STOPPED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_STOPPED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define MVDMA_PUBLISH_STOPPED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


