tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_PUBLISH_RESET: Publish configuration for event RESET */
  #define MVDMA_PUBLISH_RESET_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RESET register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event RESET will publish to */
  #define MVDMA_PUBLISH_RESET_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_RESET_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_RESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define MVDMA_PUBLISH_RESET_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define MVDMA_PUBLISH_RESET_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_RESET_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_RESET_EN_Msk (0x1UL << MVDMA_PUBLISH_RESET_EN_Pos) /*!< Bit mask of EN field.                          */
  #define MVDMA_PUBLISH_RESET_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_RESET_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_RESET_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define MVDMA_PUBLISH_RESET_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* MVDMA_PUBLISH_SOURCEBUSERROR: Publish configuration for event SOURCEBUSERROR */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SOURCEBUSERROR register.          */

/* CHIDX @Bits 0..7 : DPPI channel that event SOURCEBUSERROR will publish to */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SOURCEBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define MVDMA_PUBLISH_SOURCEBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Msk (0x1UL << MVDMA_PUBLISH_SOURCEBUSERROR_EN_Pos) /*!< Bit mask of EN field.        */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define MVDMA_PUBLISH_SOURCEBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                               */


/* MVDMA_PUBLISH_SINKBUSERROR: Publish configuration for event SINKBUSERROR */
  #define MVDMA_PUBLISH_SINKBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SINKBUSERROR register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event SINKBUSERROR will publish to */
  #define MVDMA_PUBLISH_SINKBUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define MVDMA_PUBLISH_SINKBUSERROR_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SINKBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define MVDMA_PUBLISH_SINKBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define MVDMA_PUBLISH_SINKBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Msk (0x1UL << MVDMA_PUBLISH_SINKBUSERROR_EN_Pos) /*!< Bit mask of EN field.            */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define MVDMA_PUBLISH_SINKBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* MVDMA_PUBLISH_SOURCESELECTJOBDONE: Publish configuration for event SOURCESELECTJOBDONE */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SOURCESELECTJOBDONE register.*/

/* CHIDX @Bits 0..7 : DPPI channel that event SOURCESELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                      */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SOURCESELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                  */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                   */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                           */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                              */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                              */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                        */
  #define MVDMA_PUBLISH_SOURCESELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                          */


