tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_PUBLISH_SINKSELECTJOBDONE: Publish configuration for event SINKSELECTJOBDONE */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SINKSELECTJOBDONE register.    */

/* CHIDX @Bits 0..7 : DPPI channel that event SINKSELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                        */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SINKSELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                    */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                     */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                             */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Pos) /*!< Bit mask of EN field.  */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                          */
  #define MVDMA_PUBLISH_SINKSELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                            */


/* MVDMA_INTEN: Enable or disable interrupt */
  #define MVDMA_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* END @Bit 0 : Enable or disable interrupt for event END */
  #define MVDMA_INTEN_END_Pos (0UL)                  /*!< Position of END field.                                               */
  #define MVDMA_INTEN_END_Msk (0x1UL << MVDMA_INTEN_END_Pos) /*!< Bit mask of END field.                                       */
  #define MVDMA_INTEN_END_Min (0x0UL)                /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTEN_END_Max (0x1UL)                /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTEN_END_Disabled (0x0UL)           /*!< Disable                                                              */
  #define MVDMA_INTEN_END_Enabled (0x1UL)            /*!< Enable                                                               */

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define MVDMA_INTEN_STARTED_Pos (1UL)              /*!< Position of STARTED field.                                           */
  #define MVDMA_INTEN_STARTED_Msk (0x1UL << MVDMA_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define MVDMA_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MVDMA_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define MVDMA_INTEN_STOPPED_Pos (2UL)              /*!< Position of STOPPED field.                                           */
  #define MVDMA_INTEN_STOPPED_Msk (0x1UL << MVDMA_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define MVDMA_INTEN_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define MVDMA_INTEN_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define MVDMA_INTEN_STOPPED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MVDMA_INTEN_STOPPED_Enabled (0x1UL)        /*!< Enable                                                               */

/* RESET @Bit 3 : Enable or disable interrupt for event RESET */
  #define MVDMA_INTEN_RESET_Pos (3UL)                /*!< Position of RESET field.                                             */
  #define MVDMA_INTEN_RESET_Msk (0x1UL << MVDMA_INTEN_RESET_Pos) /*!< Bit mask of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Min (0x0UL)              /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Max (0x1UL)              /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTEN_RESET_Disabled (0x0UL)         /*!< Disable                                                              */
  #define MVDMA_INTEN_RESET_Enabled (0x1UL)          /*!< Enable                                                               */

/* SOURCEBUSERROR @Bit 4 : Enable or disable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTEN_SOURCEBUSERROR_Pos (4UL)       /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTEN_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTEN_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.      */
  #define MVDMA_INTEN_SOURCEBUSERROR_Min (0x0UL)     /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTEN_SOURCEBUSERROR_Max (0x1UL)     /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTEN_SOURCEBUSERROR_Disabled (0x0UL) /*!< Disable                                                             */
  #define MVDMA_INTEN_SOURCEBUSERROR_Enabled (0x1UL) /*!< Enable                                                               */

/* SINKBUSERROR @Bit 5 : Enable or disable interrupt for event SINKBUSERROR */
  #define MVDMA_INTEN_SINKBUSERROR_Pos (5UL)         /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTEN_SINKBUSERROR_Msk (0x1UL << MVDMA_INTEN_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.            */
  #define MVDMA_INTEN_SINKBUSERROR_Min (0x0UL)       /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTEN_SINKBUSERROR_Max (0x1UL)       /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTEN_SINKBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define MVDMA_INTEN_SINKBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* SOURCESELECTJOBDONE @Bit 6 : Enable or disable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Pos (6UL)  /*!< Position of SOURCESELECTJOBDONE field.                               */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.                  */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.                  */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                        */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                          */

/* SINKSELECTJOBDONE @Bit 7 : Enable or disable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Pos (7UL)    /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Min (0x0UL)  /*!< Min enumerator value of SINKSELECTJOBDONE field.                     */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Max (0x1UL)  /*!< Max enumerator value of SINKSELECTJOBDONE field.                     */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Disable                                                          */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Enable                                                            */


/* MVDMA_INTENSET: Enable interrupt */
  #define MVDMA_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define MVDMA_INTENSET_END_Pos (0UL)               /*!< Position of END field.                                               */
  #define MVDMA_INTENSET_END_Msk (0x1UL << MVDMA_INTENSET_END_Pos) /*!< Bit mask of END field.                                 */
  #define MVDMA_INTENSET_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTENSET_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTENSET_END_Set (0x1UL)             /*!< Enable                                                               */
  #define MVDMA_INTENSET_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

