tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define MVDMA_INTENSET_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define MVDMA_INTENSET_STARTED_Msk (0x1UL << MVDMA_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MVDMA_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define MVDMA_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define MVDMA_INTENSET_STOPPED_Pos (2UL)           /*!< Position of STOPPED field.                                           */
  #define MVDMA_INTENSET_STOPPED_Msk (0x1UL << MVDMA_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define MVDMA_INTENSET_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define MVDMA_INTENSET_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define MVDMA_INTENSET_STOPPED_Set (0x1UL)         /*!< Enable                                                               */
  #define MVDMA_INTENSET_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RESET @Bit 3 : Write '1' to enable interrupt for event RESET */
  #define MVDMA_INTENSET_RESET_Pos (3UL)             /*!< Position of RESET field.                                             */
  #define MVDMA_INTENSET_RESET_Msk (0x1UL << MVDMA_INTENSET_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define MVDMA_INTENSET_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTENSET_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTENSET_RESET_Set (0x1UL)           /*!< Enable                                                               */
  #define MVDMA_INTENSET_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SOURCEBUSERROR @Bit 4 : Write '1' to enable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Pos (4UL)    /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.*/
  #define MVDMA_INTENSET_SOURCEBUSERROR_Min (0x0UL)  /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Max (0x1UL)  /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Set (0x1UL)  /*!< Enable                                                               */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SINKBUSERROR @Bit 5 : Write '1' to enable interrupt for event SINKBUSERROR */
  #define MVDMA_INTENSET_SINKBUSERROR_Pos (5UL)      /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTENSET_SINKBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.      */
  #define MVDMA_INTENSET_SINKBUSERROR_Min (0x0UL)    /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENSET_SINKBUSERROR_Max (0x1UL)    /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENSET_SINKBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define MVDMA_INTENSET_SINKBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MVDMA_INTENSET_SINKBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* SOURCESELECTJOBDONE @Bit 6 : Write '1' to enable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos (6UL) /*!< Position of SOURCESELECTJOBDONE field.                             */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Set (0x1UL) /*!< Enable                                                           */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* SINKSELECTJOBDONE @Bit 7 : Write '1' to enable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Pos (7UL) /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SINKSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SINKSELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Set (0x1UL) /*!< Enable                                                             */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                  */


