tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MVDMA_INTENCLR: Disable interrupt */
  #define MVDMA_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define MVDMA_INTENCLR_END_Pos (0UL)               /*!< Position of END field.                                               */
  #define MVDMA_INTENCLR_END_Msk (0x1UL << MVDMA_INTENCLR_END_Pos) /*!< Bit mask of END field.                                 */
  #define MVDMA_INTENCLR_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTENCLR_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTENCLR_END_Clear (0x1UL)           /*!< Disable                                                              */
  #define MVDMA_INTENCLR_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* STARTED @Bit 1 : Write '1' to disable interrupt for event STARTED */
  #define MVDMA_INTENCLR_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define MVDMA_INTENCLR_STARTED_Msk (0x1UL << MVDMA_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MVDMA_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MVDMA_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define MVDMA_INTENCLR_STOPPED_Pos (2UL)           /*!< Position of STOPPED field.                                           */
  #define MVDMA_INTENCLR_STOPPED_Msk (0x1UL << MVDMA_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define MVDMA_INTENCLR_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define MVDMA_INTENCLR_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define MVDMA_INTENCLR_STOPPED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MVDMA_INTENCLR_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RESET @Bit 3 : Write '1' to disable interrupt for event RESET */
  #define MVDMA_INTENCLR_RESET_Pos (3UL)             /*!< Position of RESET field.                                             */
  #define MVDMA_INTENCLR_RESET_Msk (0x1UL << MVDMA_INTENCLR_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define MVDMA_INTENCLR_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTENCLR_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTENCLR_RESET_Clear (0x1UL)         /*!< Disable                                                              */
  #define MVDMA_INTENCLR_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SOURCEBUSERROR @Bit 4 : Write '1' to disable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Pos (4UL)    /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTENCLR_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.*/
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Min (0x0UL)  /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Max (0x1UL)  /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Clear (0x1UL) /*!< Disable                                                             */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MVDMA_INTENCLR_SOURCEBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SINKBUSERROR @Bit 5 : Write '1' to disable interrupt for event SINKBUSERROR */
  #define MVDMA_INTENCLR_SINKBUSERROR_Pos (5UL)      /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTENCLR_SINKBUSERROR_Msk (0x1UL << MVDMA_INTENCLR_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.      */
  #define MVDMA_INTENCLR_SINKBUSERROR_Min (0x0UL)    /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENCLR_SINKBUSERROR_Max (0x1UL)    /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENCLR_SINKBUSERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define MVDMA_INTENCLR_SINKBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MVDMA_INTENCLR_SINKBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* SOURCESELECTJOBDONE @Bit 6 : Write '1' to disable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Pos (6UL) /*!< Position of SOURCESELECTJOBDONE field.                             */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTENCLR_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                        */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define MVDMA_INTENCLR_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

