tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SINKSELECTJOBDONE @Bit 7 : Write '1' to disable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Pos (7UL) /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTENCLR_SINKSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SINKSELECTJOBDONE field.*/
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Clear (0x1UL) /*!< Disable                                                          */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define MVDMA_INTENCLR_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                  */


/* MVDMA_INTPEND: Pending interrupts */
  #define MVDMA_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* END @Bit 0 : Read pending status of interrupt for event END */
  #define MVDMA_INTPEND_END_Pos (0UL)                /*!< Position of END field.                                               */
  #define MVDMA_INTPEND_END_Msk (0x1UL << MVDMA_INTPEND_END_Pos) /*!< Bit mask of END field.                                   */
  #define MVDMA_INTPEND_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTPEND_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTPEND_END_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_END_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define MVDMA_INTPEND_STARTED_Pos (1UL)            /*!< Position of STARTED field.                                           */
  #define MVDMA_INTPEND_STARTED_Msk (0x1UL << MVDMA_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define MVDMA_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* STOPPED @Bit 2 : Read pending status of interrupt for event STOPPED */
  #define MVDMA_INTPEND_STOPPED_Pos (2UL)            /*!< Position of STOPPED field.                                           */
  #define MVDMA_INTPEND_STOPPED_Msk (0x1UL << MVDMA_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define MVDMA_INTPEND_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define MVDMA_INTPEND_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define MVDMA_INTPEND_STOPPED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_STOPPED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* RESET @Bit 3 : Read pending status of interrupt for event RESET */
  #define MVDMA_INTPEND_RESET_Pos (3UL)              /*!< Position of RESET field.                                             */
  #define MVDMA_INTPEND_RESET_Msk (0x1UL << MVDMA_INTPEND_RESET_Pos) /*!< Bit mask of RESET field.                             */
  #define MVDMA_INTPEND_RESET_Min (0x0UL)            /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTPEND_RESET_Max (0x1UL)            /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTPEND_RESET_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_RESET_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* SOURCEBUSERROR @Bit 4 : Read pending status of interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pos (4UL)     /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.  */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Min (0x0UL)   /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Max (0x1UL)   /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTPEND_SOURCEBUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pending (0x1UL) /*!< Read: Pending                                                      */

/* SINKBUSERROR @Bit 5 : Read pending status of interrupt for event SINKBUSERROR */
  #define MVDMA_INTPEND_SINKBUSERROR_Pos (5UL)       /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTPEND_SINKBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.        */
  #define MVDMA_INTPEND_SINKBUSERROR_Min (0x0UL)     /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTPEND_SINKBUSERROR_Max (0x1UL)     /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTPEND_SINKBUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define MVDMA_INTPEND_SINKBUSERROR_Pending (0x1UL) /*!< Read: Pending                                                        */

/* SOURCESELECTJOBDONE @Bit 6 : Read pending status of interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos (6UL) /*!< Position of SOURCESELECTJOBDONE field.                              */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.                */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.                */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_NotPending (0x0UL) /*!< Read: Not pending                                          */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pending (0x1UL) /*!< Read: Pending                                                 */

/* SINKSELECTJOBDONE @Bit 7 : Read pending status of interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pos (7UL)  /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                    */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                    */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_NotPending (0x0UL) /*!< Read: Not pending                                            */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pending (0x1UL) /*!< Read: Pending                                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           NFCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct NFCT_FRAMESTATUS ================================================= */
/**
  * @brief FRAMESTATUS [NFCT_FRAMESTATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RX;                                /*!< (@ 0x00000000) Result of last incoming frame                         */
} NRF_NFCT_FRAMESTATUS_Type;                         /*!< Size = 4 (0x004)                                                     */

/* NFCT_FRAMESTATUS_RX: Result of last incoming frame */
  #define NFCT_FRAMESTATUS_RX_ResetValue (0x00000000UL) /*!< Reset value of RX register.                                       */

/* CRCERROR @Bit 0 : No valid end of frame (EoF) detected */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Pos (0UL)     /*!< Position of CRCERROR field.                                          */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Msk (0x1UL << NFCT_FRAMESTATUS_RX_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.        */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Min (0x0UL)   /*!< Min enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Max (0x1UL)   /*!< Max enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCCorrect (0x0UL) /*!< Valid CRC detected                                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCError (0x1UL) /*!< CRC received does not match local check                           */

/* PARITYSTATUS @Bit 2 : Parity status of received frame */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos (2UL) /*!< Position of PARITYSTATUS field.                                      */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Msk (0x1UL << NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos) /*!< Bit mask of PARITYSTATUS
                                                                            field.*/
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Min (0x0UL) /*!< Min enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Max (0x1UL) /*!< Max enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityOK (0x0UL) /*!< Frame received with parity OK                                 */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityError (0x1UL) /*!< Frame received with parity error                           */

/* OVERRUN @Bit 3 : Overrun detected */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Pos (3UL)      /*!< Position of OVERRUN field.                                           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Msk (0x1UL << NFCT_FRAMESTATUS_RX_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Min (0x0UL)    /*!< Min enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Max (0x1UL)    /*!< Max enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_NoOverrun (0x0UL) /*!< No overrun detected                                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Overrun (0x1UL) /*!< Overrun error                                                       */



