tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NFCT_MODULATIONPSEL: Pin select for Modulation control */
  #define NFCT_MODULATIONPSEL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MODULATIONPSEL register.                           */

/* PIN @Bits 0..4 : Pin number */
  #define NFCT_MODULATIONPSEL_PIN_Pos (0UL)          /*!< Position of PIN field.                                               */
  #define NFCT_MODULATIONPSEL_PIN_Msk (0x1FUL << NFCT_MODULATIONPSEL_PIN_Pos) /*!< Bit mask of PIN field.                      */
  #define NFCT_MODULATIONPSEL_PIN_Min (0x00UL)       /*!< Min value of PIN field.                                              */
  #define NFCT_MODULATIONPSEL_PIN_Max (0x1FUL)       /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define NFCT_MODULATIONPSEL_PORT_Pos (5UL)         /*!< Position of PORT field.                                              */
  #define NFCT_MODULATIONPSEL_PORT_Msk (0xFUL << NFCT_MODULATIONPSEL_PORT_Pos) /*!< Bit mask of PORT field.                    */
  #define NFCT_MODULATIONPSEL_PORT_Min (0x0UL)       /*!< Min value of PORT field.                                             */
  #define NFCT_MODULATIONPSEL_PORT_Max (0xFUL)       /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define NFCT_MODULATIONPSEL_CONNECT_Pos (31UL)     /*!< Position of CONNECT field.                                           */
  #define NFCT_MODULATIONPSEL_CONNECT_Msk (0x1UL << NFCT_MODULATIONPSEL_CONNECT_Pos) /*!< Bit mask of CONNECT field.           */
  #define NFCT_MODULATIONPSEL_CONNECT_Min (0x0UL)    /*!< Min enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Max (0x1UL)    /*!< Max enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                     */
  #define NFCT_MODULATIONPSEL_CONNECT_Connected (0x0UL) /*!< Connect                                                           */


/* NFCT_MODE: Configure EasyDMA mode */
  #define NFCT_MODE_ResetValue (0x00000001UL)        /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define NFCT_MODE_LPOP_Pos (0UL)                   /*!< Position of LPOP field.                                              */
  #define NFCT_MODE_LPOP_Msk (0x3UL << NFCT_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                        */
  #define NFCT_MODE_LPOP_Min (0x0UL)                 /*!< Min enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_Max (0x3UL)                 /*!< Max enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_LowLat (0x0UL)              /*!< Low-latency operation                                                */
  #define NFCT_MODE_LPOP_LowPower (0x1UL)            /*!< Low-power operation                                                  */
  #define NFCT_MODE_LPOP_FullLowPower (0x3UL)        /*!< Full Low-power operation                                             */


/* NFCT_NFCID1_LAST: Last NFCID1 part (4, 7 or 10 bytes ID) */
  #define NFCT_NFCID1_LAST_ResetValue (0x00006363UL) /*!< Reset value of NFCID1_LAST register.                                 */

/* NFCID1_Z @Bits 0..7 : NFCID1 byte Z (very last byte sent) */
  #define NFCT_NFCID1_LAST_NFCID1_Z_Pos (0UL)        /*!< Position of NFCID1_Z field.                                          */
  #define NFCT_NFCID1_LAST_NFCID1_Z_Msk (0xFFUL << NFCT_NFCID1_LAST_NFCID1_Z_Pos) /*!< Bit mask of NFCID1_Z field.             */

/* NFCID1_Y @Bits 8..15 : NFCID1 byte Y */
  #define NFCT_NFCID1_LAST_NFCID1_Y_Pos (8UL)        /*!< Position of NFCID1_Y field.                                          */
  #define NFCT_NFCID1_LAST_NFCID1_Y_Msk (0xFFUL << NFCT_NFCID1_LAST_NFCID1_Y_Pos) /*!< Bit mask of NFCID1_Y field.             */

/* NFCID1_X @Bits 16..23 : NFCID1 byte X */
  #define NFCT_NFCID1_LAST_NFCID1_X_Pos (16UL)       /*!< Position of NFCID1_X field.                                          */
  #define NFCT_NFCID1_LAST_NFCID1_X_Msk (0xFFUL << NFCT_NFCID1_LAST_NFCID1_X_Pos) /*!< Bit mask of NFCID1_X field.             */

/* NFCID1_W @Bits 24..31 : NFCID1 byte W */
  #define NFCT_NFCID1_LAST_NFCID1_W_Pos (24UL)       /*!< Position of NFCID1_W field.                                          */
  #define NFCT_NFCID1_LAST_NFCID1_W_Msk (0xFFUL << NFCT_NFCID1_LAST_NFCID1_W_Pos) /*!< Bit mask of NFCID1_W field.             */


/* NFCT_NFCID1_2ND_LAST: Second last NFCID1 part (7 or 10 bytes ID) */
  #define NFCT_NFCID1_2ND_LAST_ResetValue (0x00000000UL) /*!< Reset value of NFCID1_2ND_LAST register.                         */

/* NFCID1_V @Bits 0..7 : NFCID1 byte V */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_V_Pos (0UL)    /*!< Position of NFCID1_V field.                                          */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_V_Msk (0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_V_Pos) /*!< Bit mask of NFCID1_V field.     */

/* NFCID1_U @Bits 8..15 : NFCID1 byte U */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_U_Pos (8UL)    /*!< Position of NFCID1_U field.                                          */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_U_Msk (0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_U_Pos) /*!< Bit mask of NFCID1_U field.     */

/* NFCID1_T @Bits 16..23 : NFCID1 byte T */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_T_Pos (16UL)   /*!< Position of NFCID1_T field.                                          */
  #define NFCT_NFCID1_2ND_LAST_NFCID1_T_Msk (0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_T_Pos) /*!< Bit mask of NFCID1_T field.     */


/* NFCT_NFCID1_3RD_LAST: Third last NFCID1 part (10 bytes ID) */
  #define NFCT_NFCID1_3RD_LAST_ResetValue (0x00000000UL) /*!< Reset value of NFCID1_3RD_LAST register.                         */

/* NFCID1_S @Bits 0..7 : NFCID1 byte S */
  #define NFCT_NFCID1_3RD_LAST_NFCID1_S_Pos (0UL)    /*!< Position of NFCID1_S field.                                          */
  #define NFCT_NFCID1_3RD_LAST_NFCID1_S_Msk (0xFFUL << NFCT_NFCID1_3RD_LAST_NFCID1_S_Pos) /*!< Bit mask of NFCID1_S field.     */

