tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define PWM_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define PWM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << PWM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define PWM_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define PWM_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define PWM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* PWM_TASKS_SEQSTART: Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at
                        the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not running. */

  #define PWM_TASKS_SEQSTART_MaxCount (2UL)          /*!< Max size of TASKS_SEQSTART[2] array.                                 */
  #define PWM_TASKS_SEQSTART_MaxIndex (1UL)          /*!< Max index of TASKS_SEQSTART[2] array.                                */
  #define PWM_TASKS_SEQSTART_MinIndex (0UL)          /*!< Min index of TASKS_SEQSTART[2] array.                                */
  #define PWM_TASKS_SEQSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SEQSTART[2] register.                         */

/* TASKS_SEQSTART @Bit 0 : Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence
                           at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not
                           running. */

  #define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Pos (0UL) /*!< Position of TASKS_SEQSTART field.                                   */
  #define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Msk (0x1UL << PWM_TASKS_SEQSTART_TASKS_SEQSTART_Pos) /*!< Bit mask of TASKS_SEQSTART
                                                                            field.*/
  #define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_SEQSTART field.                     */
  #define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_SEQSTART field.                     */
  #define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Trigger (0x1UL) /*!< Trigger task                                                  */


/* PWM_TASKS_NEXTSTEP: Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not
                        cause PWM generation to start if not running. */

  #define PWM_TASKS_NEXTSTEP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_NEXTSTEP register.                            */

/* TASKS_NEXTSTEP @Bit 0 : Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not
                           cause PWM generation to start if not running. */

  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos (0UL) /*!< Position of TASKS_NEXTSTEP field.                                   */
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Msk (0x1UL << PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos) /*!< Bit mask of TASKS_NEXTSTEP
                                                                            field.*/
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Min (0x1UL) /*!< Min enumerator value of TASKS_NEXTSTEP field.                     */
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Max (0x1UL) /*!< Max enumerator value of TASKS_NEXTSTEP field.                     */
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Trigger (0x1UL) /*!< Trigger task                                                  */


/* PWM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define PWM_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define PWM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define PWM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define PWM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_STOP_EN_Msk (0x1UL << PWM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define PWM_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define PWM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* PWM_SUBSCRIBE_SEQSTART: Subscribe configuration for task SEQSTART[n] */
  #define PWM_SUBSCRIBE_SEQSTART_MaxCount (2UL)      /*!< Max size of SUBSCRIBE_SEQSTART[2] array.                             */
  #define PWM_SUBSCRIBE_SEQSTART_MaxIndex (1UL)      /*!< Max index of SUBSCRIBE_SEQSTART[2] array.                            */
  #define PWM_SUBSCRIBE_SEQSTART_MinIndex (0UL)      /*!< Min index of SUBSCRIBE_SEQSTART[2] array.                            */
  #define PWM_SUBSCRIBE_SEQSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SEQSTART[2] register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that task SEQSTART[n] will subscribe to */
  #define PWM_SUBSCRIBE_SEQSTART_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define PWM_SUBSCRIBE_SEQSTART_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_SEQSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define PWM_SUBSCRIBE_SEQSTART_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_SEQSTART_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Msk (0x1UL << PWM_SUBSCRIBE_SEQSTART_EN_Pos) /*!< Bit mask of EN field.                    */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define PWM_SUBSCRIBE_SEQSTART_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


