tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* LOOPSDONE @Bit 7 : Enable or disable interrupt for event LOOPSDONE */
  #define PWM_INTEN_LOOPSDONE_Pos (7UL)              /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTEN_LOOPSDONE_Msk (0x1UL << PWM_INTEN_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                         */
  #define PWM_INTEN_LOOPSDONE_Min (0x0UL)            /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTEN_LOOPSDONE_Max (0x1UL)            /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTEN_LOOPSDONE_Disabled (0x0UL)       /*!< Disable                                                              */
  #define PWM_INTEN_LOOPSDONE_Enabled (0x1UL)        /*!< Enable                                                               */


/* PWM_INTENSET: Enable interrupt */
  #define PWM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define PWM_INTENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define PWM_INTENSET_STOPPED_Msk (0x1UL << PWM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define PWM_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define PWM_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define PWM_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define PWM_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQSTARTED0 @Bit 2 : Write '1' to enable interrupt for event SEQSTARTED[0] */
  #define PWM_INTENSET_SEQSTARTED0_Pos (2UL)         /*!< Position of SEQSTARTED0 field.                                       */
  #define PWM_INTENSET_SEQSTARTED0_Msk (0x1UL << PWM_INTENSET_SEQSTARTED0_Pos) /*!< Bit mask of SEQSTARTED0 field.             */
  #define PWM_INTENSET_SEQSTARTED0_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENSET_SEQSTARTED0_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENSET_SEQSTARTED0_Set (0x1UL)       /*!< Enable                                                               */
  #define PWM_INTENSET_SEQSTARTED0_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_SEQSTARTED0_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQSTARTED1 @Bit 3 : Write '1' to enable interrupt for event SEQSTARTED[1] */
  #define PWM_INTENSET_SEQSTARTED1_Pos (3UL)         /*!< Position of SEQSTARTED1 field.                                       */
  #define PWM_INTENSET_SEQSTARTED1_Msk (0x1UL << PWM_INTENSET_SEQSTARTED1_Pos) /*!< Bit mask of SEQSTARTED1 field.             */
  #define PWM_INTENSET_SEQSTARTED1_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENSET_SEQSTARTED1_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENSET_SEQSTARTED1_Set (0x1UL)       /*!< Enable                                                               */
  #define PWM_INTENSET_SEQSTARTED1_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_SEQSTARTED1_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQEND0 @Bit 4 : Write '1' to enable interrupt for event SEQEND[0] */
  #define PWM_INTENSET_SEQEND0_Pos (4UL)             /*!< Position of SEQEND0 field.                                           */
  #define PWM_INTENSET_SEQEND0_Msk (0x1UL << PWM_INTENSET_SEQEND0_Pos) /*!< Bit mask of SEQEND0 field.                         */
  #define PWM_INTENSET_SEQEND0_Min (0x0UL)           /*!< Min enumerator value of SEQEND0 field.                               */
  #define PWM_INTENSET_SEQEND0_Max (0x1UL)           /*!< Max enumerator value of SEQEND0 field.                               */
  #define PWM_INTENSET_SEQEND0_Set (0x1UL)           /*!< Enable                                                               */
  #define PWM_INTENSET_SEQEND0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_SEQEND0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQEND1 @Bit 5 : Write '1' to enable interrupt for event SEQEND[1] */
  #define PWM_INTENSET_SEQEND1_Pos (5UL)             /*!< Position of SEQEND1 field.                                           */
  #define PWM_INTENSET_SEQEND1_Msk (0x1UL << PWM_INTENSET_SEQEND1_Pos) /*!< Bit mask of SEQEND1 field.                         */
  #define PWM_INTENSET_SEQEND1_Min (0x0UL)           /*!< Min enumerator value of SEQEND1 field.                               */
  #define PWM_INTENSET_SEQEND1_Max (0x1UL)           /*!< Max enumerator value of SEQEND1 field.                               */
  #define PWM_INTENSET_SEQEND1_Set (0x1UL)           /*!< Enable                                                               */
  #define PWM_INTENSET_SEQEND1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_SEQEND1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PWMPERIODEND @Bit 6 : Write '1' to enable interrupt for event PWMPERIODEND */
  #define PWM_INTENSET_PWMPERIODEND_Pos (6UL)        /*!< Position of PWMPERIODEND field.                                      */
  #define PWM_INTENSET_PWMPERIODEND_Msk (0x1UL << PWM_INTENSET_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.          */
  #define PWM_INTENSET_PWMPERIODEND_Min (0x0UL)      /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENSET_PWMPERIODEND_Max (0x1UL)      /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENSET_PWMPERIODEND_Set (0x1UL)      /*!< Enable                                                               */
  #define PWM_INTENSET_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_PWMPERIODEND_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LOOPSDONE @Bit 7 : Write '1' to enable interrupt for event LOOPSDONE */
  #define PWM_INTENSET_LOOPSDONE_Pos (7UL)           /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTENSET_LOOPSDONE_Msk (0x1UL << PWM_INTENSET_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                   */
  #define PWM_INTENSET_LOOPSDONE_Min (0x0UL)         /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENSET_LOOPSDONE_Max (0x1UL)         /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENSET_LOOPSDONE_Set (0x1UL)         /*!< Enable                                                               */
  #define PWM_INTENSET_LOOPSDONE_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_LOOPSDONE_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* PWM_INTENCLR: Disable interrupt */
  #define PWM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define PWM_INTENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define PWM_INTENCLR_STOPPED_Msk (0x1UL << PWM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define PWM_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define PWM_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define PWM_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQSTARTED0 @Bit 2 : Write '1' to disable interrupt for event SEQSTARTED[0] */
  #define PWM_INTENCLR_SEQSTARTED0_Pos (2UL)         /*!< Position of SEQSTARTED0 field.                                       */
  #define PWM_INTENCLR_SEQSTARTED0_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED0_Pos) /*!< Bit mask of SEQSTARTED0 field.             */
  #define PWM_INTENCLR_SEQSTARTED0_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENCLR_SEQSTARTED0_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENCLR_SEQSTARTED0_Clear (0x1UL)     /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQSTARTED0_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQSTARTED0_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQSTARTED1 @Bit 3 : Write '1' to disable interrupt for event SEQSTARTED[1] */
  #define PWM_INTENCLR_SEQSTARTED1_Pos (3UL)         /*!< Position of SEQSTARTED1 field.                                       */
  #define PWM_INTENCLR_SEQSTARTED1_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED1_Pos) /*!< Bit mask of SEQSTARTED1 field.             */
  #define PWM_INTENCLR_SEQSTARTED1_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENCLR_SEQSTARTED1_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENCLR_SEQSTARTED1_Clear (0x1UL)     /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQSTARTED1_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQSTARTED1_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQEND0 @Bit 4 : Write '1' to disable interrupt for event SEQEND[0] */
  #define PWM_INTENCLR_SEQEND0_Pos (4UL)             /*!< Position of SEQEND0 field.                                           */
  #define PWM_INTENCLR_SEQEND0_Msk (0x1UL << PWM_INTENCLR_SEQEND0_Pos) /*!< Bit mask of SEQEND0 field.                         */
  #define PWM_INTENCLR_SEQEND0_Min (0x0UL)           /*!< Min enumerator value of SEQEND0 field.                               */
  #define PWM_INTENCLR_SEQEND0_Max (0x1UL)           /*!< Max enumerator value of SEQEND0 field.                               */
  #define PWM_INTENCLR_SEQEND0_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQEND0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQEND0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQEND1 @Bit 5 : Write '1' to disable interrupt for event SEQEND[1] */
  #define PWM_INTENCLR_SEQEND1_Pos (5UL)             /*!< Position of SEQEND1 field.                                           */
  #define PWM_INTENCLR_SEQEND1_Msk (0x1UL << PWM_INTENCLR_SEQEND1_Pos) /*!< Bit mask of SEQEND1 field.                         */
  #define PWM_INTENCLR_SEQEND1_Min (0x0UL)           /*!< Min enumerator value of SEQEND1 field.                               */
  #define PWM_INTENCLR_SEQEND1_Max (0x1UL)           /*!< Max enumerator value of SEQEND1 field.                               */
  #define PWM_INTENCLR_SEQEND1_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQEND1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQEND1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PWMPERIODEND @Bit 6 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define PWM_INTENCLR_PWMPERIODEND_Pos (6UL)        /*!< Position of PWMPERIODEND field.                                      */
  #define PWM_INTENCLR_PWMPERIODEND_Msk (0x1UL << PWM_INTENCLR_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.          */
  #define PWM_INTENCLR_PWMPERIODEND_Min (0x0UL)      /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENCLR_PWMPERIODEND_Max (0x1UL)      /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENCLR_PWMPERIODEND_Clear (0x1UL)    /*!< Disable                                                              */
  #define PWM_INTENCLR_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_PWMPERIODEND_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LOOPSDONE @Bit 7 : Write '1' to disable interrupt for event LOOPSDONE */
  #define PWM_INTENCLR_LOOPSDONE_Pos (7UL)           /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTENCLR_LOOPSDONE_Msk (0x1UL << PWM_INTENCLR_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                   */
  #define PWM_INTENCLR_LOOPSDONE_Min (0x0UL)         /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENCLR_LOOPSDONE_Max (0x1UL)         /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENCLR_LOOPSDONE_Clear (0x1UL)       /*!< Disable                                                              */
  #define PWM_INTENCLR_LOOPSDONE_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_LOOPSDONE_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


