tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CNT @Bits 0..15 : Number of playbacks of pattern cycles */
  #define PWM_LOOP_CNT_Pos (0UL)                     /*!< Position of CNT field.                                               */
  #define PWM_LOOP_CNT_Msk (0xFFFFUL << PWM_LOOP_CNT_Pos) /*!< Bit mask of CNT field.                                          */
  #define PWM_LOOP_CNT_Min (0x0UL)                   /*!< Min enumerator value of CNT field.                                   */
  #define PWM_LOOP_CNT_Max (0x0UL)                   /*!< Max enumerator value of CNT field.                                   */
  #define PWM_LOOP_CNT_Disabled (0x0000UL)           /*!< Looping disabled (stop at the end of the sequence)                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           QDEC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct QDEC_PSEL ===================================================== */
/**
  * @brief PSEL [QDEC_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LED;                               /*!< (@ 0x00000000) Pin select for LED signal                             */
  __IOM uint32_t  A;                                 /*!< (@ 0x00000004) Pin select for A signal                               */
  __IOM uint32_t  B;                                 /*!< (@ 0x00000008) Pin select for B signal                               */
} NRF_QDEC_PSEL_Type;                                /*!< Size = 12 (0x00C)                                                    */

/* QDEC_PSEL_LED: Pin select for LED signal */
  #define QDEC_PSEL_LED_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of LED register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_LED_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define QDEC_PSEL_LED_PIN_Msk (0x1FUL << QDEC_PSEL_LED_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define QDEC_PSEL_LED_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define QDEC_PSEL_LED_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define QDEC_PSEL_LED_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define QDEC_PSEL_LED_PORT_Msk (0xFUL << QDEC_PSEL_LED_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define QDEC_PSEL_LED_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define QDEC_PSEL_LED_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_LED_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define QDEC_PSEL_LED_CONNECT_Msk (0x1UL << QDEC_PSEL_LED_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define QDEC_PSEL_LED_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_LED_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_LED_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define QDEC_PSEL_LED_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* QDEC_PSEL_A: Pin select for A signal */
  #define QDEC_PSEL_A_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of A register.                                           */

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_A_PIN_Pos (0UL)                  /*!< Position of PIN field.                                               */
  #define QDEC_PSEL_A_PIN_Msk (0x1FUL << QDEC_PSEL_A_PIN_Pos) /*!< Bit mask of PIN field.                                      */
  #define QDEC_PSEL_A_PIN_Min (0x00UL)               /*!< Min value of PIN field.                                              */
  #define QDEC_PSEL_A_PIN_Max (0x1FUL)               /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define QDEC_PSEL_A_PORT_Pos (5UL)                 /*!< Position of PORT field.                                              */
  #define QDEC_PSEL_A_PORT_Msk (0xFUL << QDEC_PSEL_A_PORT_Pos) /*!< Bit mask of PORT field.                                    */
  #define QDEC_PSEL_A_PORT_Min (0x0UL)               /*!< Min value of PORT field.                                             */
  #define QDEC_PSEL_A_PORT_Max (0xFUL)               /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_A_CONNECT_Pos (31UL)             /*!< Position of CONNECT field.                                           */
  #define QDEC_PSEL_A_CONNECT_Msk (0x1UL << QDEC_PSEL_A_CONNECT_Pos) /*!< Bit mask of CONNECT field.                           */
  #define QDEC_PSEL_A_CONNECT_Min (0x0UL)            /*!< Min enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_A_CONNECT_Max (0x1UL)            /*!< Max enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_A_CONNECT_Disconnected (0x1UL)   /*!< Disconnect                                                           */
  #define QDEC_PSEL_A_CONNECT_Connected (0x0UL)      /*!< Connect                                                              */


