tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)               /*!< Position of ACCDBL field.                                            */
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos) /*!< Bit mask of ACCDBL field.                              */
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)             /*!< Min value of ACCDBL field.                                           */
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)             /*!< Max size of ACCDBL field.                                            */


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)  /*!< Reset value of ACCDBLREAD register.                                  */

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */

  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)       /*!< Position of ACCDBLREAD field.                                        */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos) /*!< Bit mask of ACCDBLREAD field.          */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)     /*!< Min value of ACCDBLREAD field.                                       */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)     /*!< Max size of ACCDBLREAD field.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct RADIO_PSEL ==================================================== */
/**
  * @brief PSEL [RADIO_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DFEGPIO[8];                        /*!< (@ 0x00000000) Pin select for DFE pin n                              */
} NRF_RADIO_PSEL_Type;                               /*!< Size = 32 (0x020)                                                    */

/* RADIO_PSEL_DFEGPIO: Pin select for DFE pin n */
  #define RADIO_PSEL_DFEGPIO_MaxCount (8UL)          /*!< Max size of DFEGPIO[8] array.                                        */
  #define RADIO_PSEL_DFEGPIO_MaxIndex (7UL)          /*!< Max index of DFEGPIO[8] array.                                       */
  #define RADIO_PSEL_DFEGPIO_MinIndex (0UL)          /*!< Min index of DFEGPIO[8] array.                                       */
  #define RADIO_PSEL_DFEGPIO_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DFEGPIO[8] register.                                */

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_PSEL_DFEGPIO_PIN_Pos (0UL)           /*!< Position of PIN field.                                               */
  #define RADIO_PSEL_DFEGPIO_PIN_Msk (0x1FUL << RADIO_PSEL_DFEGPIO_PIN_Pos) /*!< Bit mask of PIN field.                        */
  #define RADIO_PSEL_DFEGPIO_PIN_Min (0x00UL)        /*!< Min value of PIN field.                                              */
  #define RADIO_PSEL_DFEGPIO_PIN_Max (0x1FUL)        /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define RADIO_PSEL_DFEGPIO_PORT_Pos (5UL)          /*!< Position of PORT field.                                              */
  #define RADIO_PSEL_DFEGPIO_PORT_Msk (0xFUL << RADIO_PSEL_DFEGPIO_PORT_Pos) /*!< Bit mask of PORT field.                      */
  #define RADIO_PSEL_DFEGPIO_PORT_Min (0x0UL)        /*!< Min value of PORT field.                                             */
  #define RADIO_PSEL_DFEGPIO_PORT_Max (0x1UL)        /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Pos (31UL)      /*!< Position of CONNECT field.                                           */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Msk (0x1UL << RADIO_PSEL_DFEGPIO_CONNECT_Pos) /*!< Bit mask of CONNECT field.             */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Min (0x0UL)     /*!< Min enumerator value of CONNECT field.                               */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Max (0x1UL)     /*!< Max enumerator value of CONNECT field.                               */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                      */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Connected (0x0UL) /*!< Connect                                                            */



/* ================================================= Struct RADIO_DFEPACKET ================================================== */
/**
  * @brief DFEPACKET [RADIO_DFEPACKET] DFE packet EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes to transfer                   */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x0000000C) (unspecified)                                         */
} NRF_RADIO_DFEPACKET_Type;                          /*!< Size = 16 (0x010)                                                    */

/* RADIO_DFEPACKET_PTR: Data pointer */
  #define RADIO_DFEPACKET_PTR_ResetValue (0x01000000UL) /*!< Reset value of PTR register.                                      */

/* OFFSET @Bits 0..15 : Data pointer */
  #define RADIO_DFEPACKET_PTR_OFFSET_Pos (0UL)       /*!< Position of OFFSET field.                                            */
  #define RADIO_DFEPACKET_PTR_OFFSET_Msk (0xFFFFUL << RADIO_DFEPACKET_PTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.           */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_DFEPACKET_PTR_BASE_Pos (29UL)        /*!< Position of BASE field.                                              */
  #define RADIO_DFEPACKET_PTR_BASE_Msk (0x1UL << RADIO_DFEPACKET_PTR_BASE_Pos) /*!< Bit mask of BASE field.                    */


/* RADIO_DFEPACKET_MAXCNT: Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_ResetValue (0x00004000UL) /*!< Reset value of MAXCNT register.                                */

/* MAXCNT @Bits 0..15 : Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos (0UL)    /*!< Position of MAXCNT field.                                            */
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Msk (0xFFFFUL << RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.     */


/* RADIO_DFEPACKET_AMOUNT: Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos (0UL)    /*!< Position of AMOUNT field.                                            */
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Msk (0xFFFFUL << RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.     */


/* RADIO_DFEPACKET_ENABLE: (unspecified) */
  #define RADIO_DFEPACKET_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

/* ENABLE @Bit 0 : (unspecified) */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Msk (0x1UL << RADIO_DFEPACKET_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Disabled (0x1UL) /*!< Disable                                                          */
  #define RADIO_DFEPACKET_ENABLE_ENABLE_Enabled (0x0UL) /*!< Enable                                                            */


