tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* S1INCL @Bits 20..21 : Include or exclude S1 field in RAM */
  #define RADIO_PCNF0_S1INCL_Pos (20UL)              /*!< Position of S1INCL field.                                            */
  #define RADIO_PCNF0_S1INCL_Msk (0x3UL << RADIO_PCNF0_S1INCL_Pos) /*!< Bit mask of S1INCL field.                              */
  #define RADIO_PCNF0_S1INCL_Min (0x0UL)             /*!< Min enumerator value of S1INCL field.                                */
  #define RADIO_PCNF0_S1INCL_Max (0x1UL)             /*!< Max enumerator value of S1INCL field.                                */
  #define RADIO_PCNF0_S1INCL_Automatic (0x0UL)       /*!< Include S1 field in RAM only if S1LEN > 0                            */
  #define RADIO_PCNF0_S1INCL_Include (0x1UL)         /*!< Always include S1 field in RAM independent of S1LEN                  */

/* CILEN @Bits 22..23 : Length of code indicator - long range */
  #define RADIO_PCNF0_CILEN_Pos (22UL)               /*!< Position of CILEN field.                                             */
  #define RADIO_PCNF0_CILEN_Msk (0x3UL << RADIO_PCNF0_CILEN_Pos) /*!< Bit mask of CILEN field.                                 */

/* PLEN @Bits 24..25 : Length of preamble on air. Decision point: TASKS_START task */
  #define RADIO_PCNF0_PLEN_Pos (24UL)                /*!< Position of PLEN field.                                              */
  #define RADIO_PCNF0_PLEN_Msk (0x3UL << RADIO_PCNF0_PLEN_Pos) /*!< Bit mask of PLEN field.                                    */
  #define RADIO_PCNF0_PLEN_Min (0x0UL)               /*!< Min enumerator value of PLEN field.                                  */
  #define RADIO_PCNF0_PLEN_Max (0x3UL)               /*!< Max enumerator value of PLEN field.                                  */
  #define RADIO_PCNF0_PLEN_8bit (0x0UL)              /*!< 8-bit preamble                                                       */
  #define RADIO_PCNF0_PLEN_16bit (0x1UL)             /*!< 16-bit preamble                                                      */
  #define RADIO_PCNF0_PLEN_32bitZero (0x2UL)         /*!< 32-bit zero preamble - used for IEEE 802.15.4                        */
  #define RADIO_PCNF0_PLEN_LongRange (0x3UL)         /*!< Preamble - used for BLE long range                                   */

/* CRCINC @Bit 26 : Indicates if LENGTH field contains CRC or not */
  #define RADIO_PCNF0_CRCINC_Pos (26UL)              /*!< Position of CRCINC field.                                            */
  #define RADIO_PCNF0_CRCINC_Msk (0x1UL << RADIO_PCNF0_CRCINC_Pos) /*!< Bit mask of CRCINC field.                              */
  #define RADIO_PCNF0_CRCINC_Min (0x0UL)             /*!< Min enumerator value of CRCINC field.                                */
  #define RADIO_PCNF0_CRCINC_Max (0x1UL)             /*!< Max enumerator value of CRCINC field.                                */
  #define RADIO_PCNF0_CRCINC_Exclude (0x0UL)         /*!< LENGTH does not contain CRC                                          */
  #define RADIO_PCNF0_CRCINC_Include (0x1UL)         /*!< LENGTH includes CRC                                                  */

/* TERMLEN @Bits 29..30 : Length of TERM field in Long Range operation */
  #define RADIO_PCNF0_TERMLEN_Pos (29UL)             /*!< Position of TERMLEN field.                                           */
  #define RADIO_PCNF0_TERMLEN_Msk (0x3UL << RADIO_PCNF0_TERMLEN_Pos) /*!< Bit mask of TERMLEN field.                           */


/* RADIO_PCNF1: Packet configuration register 1 */
  #define RADIO_PCNF1_ResetValue (0x00000000UL)      /*!< Reset value of PCNF1 register.                                       */

/* MAXLEN @Bits 0..7 : Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate
                       the payload to MAXLEN. */

  #define RADIO_PCNF1_MAXLEN_Pos (0UL)               /*!< Position of MAXLEN field.                                            */
  #define RADIO_PCNF1_MAXLEN_Msk (0xFFUL << RADIO_PCNF1_MAXLEN_Pos) /*!< Bit mask of MAXLEN field.                             */
  #define RADIO_PCNF1_MAXLEN_Min (0x00UL)            /*!< Min value of MAXLEN field.                                           */
  #define RADIO_PCNF1_MAXLEN_Max (0xFFUL)            /*!< Max size of MAXLEN field.                                            */

/* STATLEN @Bits 8..15 : Static length in number of bytes */
  #define RADIO_PCNF1_STATLEN_Pos (8UL)              /*!< Position of STATLEN field.                                           */
  #define RADIO_PCNF1_STATLEN_Msk (0xFFUL << RADIO_PCNF1_STATLEN_Pos) /*!< Bit mask of STATLEN field.                          */
  #define RADIO_PCNF1_STATLEN_Min (0x00UL)           /*!< Min value of STATLEN field.                                          */
  #define RADIO_PCNF1_STATLEN_Max (0xFFUL)           /*!< Max size of STATLEN field.                                           */

/* BALEN @Bits 16..18 : Base address length in number of bytes */
  #define RADIO_PCNF1_BALEN_Pos (16UL)               /*!< Position of BALEN field.                                             */
  #define RADIO_PCNF1_BALEN_Msk (0x7UL << RADIO_PCNF1_BALEN_Pos) /*!< Bit mask of BALEN field.                                 */
  #define RADIO_PCNF1_BALEN_Min (0x1UL)              /*!< Min value of BALEN field.                                            */
  #define RADIO_PCNF1_BALEN_Max (0x1UL)              /*!< Max size of BALEN field.                                             */

/* ENDIAN @Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
  #define RADIO_PCNF1_ENDIAN_Pos (24UL)              /*!< Position of ENDIAN field.                                            */
  #define RADIO_PCNF1_ENDIAN_Msk (0x1UL << RADIO_PCNF1_ENDIAN_Pos) /*!< Bit mask of ENDIAN field.                              */
  #define RADIO_PCNF1_ENDIAN_Min (0x0UL)             /*!< Min enumerator value of ENDIAN field.                                */
  #define RADIO_PCNF1_ENDIAN_Max (0x1UL)             /*!< Max enumerator value of ENDIAN field.                                */
  #define RADIO_PCNF1_ENDIAN_Little (0x0UL)          /*!< Least significant bit on air first                                   */
  #define RADIO_PCNF1_ENDIAN_Big (0x1UL)             /*!< Most significant bit on air first                                    */

