tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                         */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x1UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                      */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                                     */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                                    */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)      /*!< Position of S0CONF field.                                            */
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field.             */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)      /*!< Position of S0MASK field.                                            */
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field.             */


/* RADIO_PACKETPTR: (unspecified) */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)  /*!< Reset value of PACKETPTR register.                                   */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_PACKETPTR_OFFSET_Pos (0UL)           /*!< Position of OFFSET field.                                            */
  #define RADIO_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.                   */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_PACKETPTR_BASE_Pos (29UL)            /*!< Position of BASE field.                                              */
  #define RADIO_PACKETPTR_BASE_Msk (0x1UL << RADIO_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field.                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RAMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RAMC ======================================================= */
/**
  * @brief RAM Controller
  */
  typedef struct {                                   /*!< RAMC Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_ERRORFIX;                  /*!< (@ 0x00000100) ECC detected fixable (one bit) error in read data from
                                                                         RAM.*/
    __IOM uint32_t EVENTS_ERRORNONFIX;               /*!< (@ 0x00000104) ECC detected non-fixable (multiple bits) error in read
                                                                         data from RAM.*/
    __IM uint32_t RESERVED1[254];
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000500) Waitstates for read operations.                       */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t SECBASE;                          /*!< (@ 0x00000600) Base address for secure access area.                  */
    __IOM uint32_t SECENABLE;                        /*!< (@ 0x00000604) Enable secure access restrictions.                    */
  } NRF_RAMC_Type;                                   /*!< Size = 1544 (0x608)                                                  */

/* RAMC_EVENTS_ERRORFIX: ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORFIX register.                         */

/* EVENTS_ERRORFIX @Bit 0 : ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos (0UL) /*!< Position of EVENTS_ERRORFIX field.                               */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Msk (0x1UL << RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERRORFIX field.*/
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORFIX field.                 */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORFIX field.                 */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Generated (0x1UL) /*!< Event generated                                          */


