tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RAMC_EVENTS_ERRORNONFIX: ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORNONFIX register.                   */

/* EVENTS_ERRORNONFIX @Bit 0 : ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos (0UL) /*!< Position of EVENTS_ERRORNONFIX field.                      */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Msk (0x1UL << RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORNONFIX field.*/
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORNONFIX field.        */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORNONFIX field.        */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Generated (0x1UL) /*!< Event generated                                    */


/* RAMC_WAITSTATES: Waitstates for read operations. */
  #define RAMC_WAITSTATES_ResetValue (0x00000000UL)  /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATES @Bit 0 : Number of waitstates for a read from the RAM. */
  #define RAMC_WAITSTATES_WAITSTATES_Pos (0UL)       /*!< Position of WAITSTATES field.                                        */
  #define RAMC_WAITSTATES_WAITSTATES_Msk (0x1UL << RAMC_WAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES field.          */
  #define RAMC_WAITSTATES_WAITSTATES_Min (0x0UL)     /*!< Min value of WAITSTATES field.                                       */
  #define RAMC_WAITSTATES_WAITSTATES_Max (0x1UL)     /*!< Max size of WAITSTATES field.                                        */


/* RAMC_SECBASE: Base address for secure access area. */
  #define RAMC_SECBASE_ResetValue (0x00000000UL)     /*!< Reset value of SECBASE register.                                     */

/* ADDR @Bits 0..31 : Base address */
  #define RAMC_SECBASE_ADDR_Pos (0UL)                /*!< Position of ADDR field.                                              */
  #define RAMC_SECBASE_ADDR_Msk (0xFFFFFFFFUL << RAMC_SECBASE_ADDR_Pos) /*!< Bit mask of ADDR field.                           */


/* RAMC_SECENABLE: Enable secure access restrictions. */
  #define RAMC_SECENABLE_ResetValue (0x00000000UL)   /*!< Reset value of SECENABLE register.                                   */

/* ENABLE @Bit 0 : Enable secure access restrictions */
  #define RAMC_SECENABLE_ENABLE_Pos (0UL)            /*!< Position of ENABLE field.                                            */
  #define RAMC_SECENABLE_ENABLE_Msk (0x1UL << RAMC_SECENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                        */
  #define RAMC_SECENABLE_ENABLE_Min (0x0UL)          /*!< Min enumerator value of ENABLE field.                                */
  #define RAMC_SECENABLE_ENABLE_Max (0x1UL)          /*!< Max enumerator value of ENABLE field.                                */
  #define RAMC_SECENABLE_ENABLE_Disable (0x0UL)      /*!< Secure access restrictions disabled                                  */
  #define RAMC_SECENABLE_ENABLE_Enable (0x1UL)       /*!< Secure access restrictions enabled                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RESETINFO                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================ Struct RESETINFO_RESETREAS_ERROR ============================================= */
/**
  * @brief ERROR [RESETINFO_RESETREAS_ERROR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) Reset error status.                                   */
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000004) Reset error address.                                  */
} NRF_RESETINFO_RESETREAS_ERROR_Type;                /*!< Size = 8 (0x008)                                                     */

/* RESETINFO_RESETREAS_ERROR_STATUS: Reset error status. */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                      */

/* ERRORSTATUS @Bits 0..3 : Error status */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Pos (0UL) /*!< Position of ERRORSTATUS field.                           */
  #define RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Msk (0xFUL << RESETINFO_RESETREAS_ERROR_STATUS_ERRORSTATUS_Pos) /*!< Bit
                                                                            mask of ERRORSTATUS field.*/


/* RESETINFO_RESETREAS_ERROR_ADDRESS: Reset error address. */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                    */

/* ERRORADDRESS @Bits 0..31 : Error address */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Pos (0UL) /*!< Position of ERRORADDRESS field.                        */
  #define RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Msk (0xFFFFFFFFUL << RESETINFO_RESETREAS_ERROR_ADDRESS_ERRORADDRESS_Pos)
                                                                            /*!< Bit mask of ERRORADDRESS field.*/



/* =============================================== Struct RESETINFO_RESETREAS ================================================ */
/**
  * @brief RESETREAS [RESETINFO_RESETREAS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GLOBAL;                            /*!< (@ 0x00000000) Global reset reason.                                  */
  __IOM uint32_t  LOCAL;                             /*!< (@ 0x00000004) Local reset reason.                                   */
  __IOM NRF_RESETINFO_RESETREAS_ERROR_Type ERROR;    /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_RESETINFO_RESETREAS_Type;                      /*!< Size = 16 (0x010)                                                    */

/* RESETINFO_RESETREAS_GLOBAL: Global reset reason. */
  #define RESETINFO_RESETREAS_GLOBAL_ResetValue (0x00000000UL) /*!< Reset value of GLOBAL register.                            */

/* RESETPOR @Bit 0 : Reset from power on reset. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos (0UL) /*!< Position of RESETPOR field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos) /*!< Bit mask of RESETPOR
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Min (0x0UL) /*!< Min enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Max (0x1UL) /*!< Max enumerator value of RESETPOR field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Detected (0x1UL) /*!< Detected                                                   */

