tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RESETPIN @Bit 1 : Reset from pin reset detected. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos (1UL) /*!< Position of RESETPIN field.                                       */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos) /*!< Bit mask of RESETPIN
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Min (0x0UL) /*!< Min enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Max (0x1UL) /*!< Max enumerator value of RESETPIN field.                         */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                            */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Detected (0x1UL) /*!< Detected                                                   */

/* DOG @Bit 2 : Reset from the SysCtrl watchdog timer detected. */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Pos (2UL)   /*!< Position of DOG field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DOG_Pos) /*!< Bit mask of DOG field.         */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Min (0x0UL) /*!< Min enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Max (0x1UL) /*!< Max enumerator value of DOG field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Detected (0x1UL) /*!< Detected                                                        */

/* CTRLAP @Bit 3 : Reset from CTRL-AP detected. */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos (3UL) /*!< Position of CTRLAP field.                                           */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos) /*!< Bit mask of CTRLAP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Min (0x0UL) /*!< Min enumerator value of CTRLAP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Max (0x1UL) /*!< Max enumerator value of CTRLAP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_NotDetected (0x0UL) /*!< Not detected                                              */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Detected (0x1UL) /*!< Detected                                                     */

/* SECSREQ @Bit 4 : Reset due to secure domain system reset request. */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos (4UL) /*!< Position of SECSREQ field.                                         */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos) /*!< Bit mask of SECSREQ
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Min (0x0UL) /*!< Min enumerator value of SECSREQ field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Max (0x1UL) /*!< Max enumerator value of SECSREQ field.                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_NotDetected (0x0UL) /*!< Not detected                                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Detected (0x1UL) /*!< Detected                                                    */

/* SECWDT @Bit 5 : Reset due to secure domain watchdog timer detected. */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_Pos (5UL) /*!< Position of SECWDT field.                                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECWDT_Pos) /*!< Bit mask of SECWDT field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_Min (0x0UL) /*!< Min enumerator value of SECWDT field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_Max (0x1UL) /*!< Max enumerator value of SECWDT field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_NotDetected (0x0UL) /*!< Not detected                                              */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT_Detected (0x1UL) /*!< Detected                                                     */

/* SECLOCKUP @Bit 6 : Reset due to secure domain lockup. */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos (6UL) /*!< Position of SECLOCKUP field.                                     */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos) /*!< Bit mask of
                                                                            SECLOCKUP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Min (0x0UL) /*!< Min enumerator value of SECLOCKUP field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Max (0x1UL) /*!< Max enumerator value of SECLOCKUP field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_NotDetected (0x0UL) /*!< Not detected                                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Detected (0x1UL) /*!< Detected                                                  */

/* SECTAMPER @Bit 7 : Reset due to secure domain tamper detected */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos (7UL) /*!< Position of SECTAMPER field.                                     */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos) /*!< Bit mask of
                                                                            SECTAMPER field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Min (0x0UL) /*!< Min enumerator value of SECTAMPER field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Max (0x1UL) /*!< Max enumerator value of SECTAMPER field.                       */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_NotDetected (0x0UL) /*!< Not detected                                           */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Detected (0x1UL) /*!< Detected                                                  */

/* OFF @Bit 8 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO. */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Pos (8UL)   /*!< Position of OFF field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_OFF_Pos) /*!< Bit mask of OFF field.         */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Min (0x0UL) /*!< Min enumerator value of OFF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Max (0x1UL) /*!< Max enumerator value of OFF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Detected (0x1UL) /*!< Detected                                                        */

/* LPCOMP @Bit 9 : Reset due to wakeup from System OFF mode when wakeup is triggered by LPCOMP (Low Power Comparator). */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos (9UL) /*!< Position of LPCOMP field.                                           */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos) /*!< Bit mask of LPCOMP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Min (0x0UL) /*!< Min enumerator value of LPCOMP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Max (0x1UL) /*!< Max enumerator value of LPCOMP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_NotDetected (0x0UL) /*!< Not detected                                              */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Detected (0x1UL) /*!< Detected                                                     */

/* DIF @Bit 10 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode. */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Pos (10UL)  /*!< Position of DIF field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DIF_Pos) /*!< Bit mask of DIF field.         */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Min (0x0UL) /*!< Min enumerator value of DIF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Max (0x1UL) /*!< Max enumerator value of DIF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Detected (0x1UL) /*!< Detected                                                        */

/* GRTC @Bit 11 : Reset due to wakeup from System OFF mode when wakeup is triggered by GRTC interrupt. */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Pos (11UL) /*!< Position of GRTC field.                                              */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_GRTC_Pos) /*!< Bit mask of GRTC field.      */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Min (0x0UL) /*!< Min enumerator value of GRTC field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Max (0x1UL) /*!< Max enumerator value of GRTC field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Detected (0x1UL) /*!< Detected                                                       */

/* NFC @Bit 12 : Reset due to wakeup from System OFF mode when wakeup is triggered by NFC field detection in sense mode. */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Pos (12UL)  /*!< Position of NFC field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_NFC_Pos) /*!< Bit mask of NFC field.         */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Min (0x0UL) /*!< Min enumerator value of NFC field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Max (0x1UL) /*!< Max enumerator value of NFC field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Detected (0x1UL) /*!< Detected                                                        */

/* VUSB @Bit 13 : Reset after wakeup from System OFF mode due to VBUS rising into valid range. */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Pos (13UL) /*!< Position of VUSB field.                                              */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_VUSB_Pos) /*!< Bit mask of VUSB field.      */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Min (0x0UL) /*!< Min enumerator value of VUSB field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Max (0x1UL) /*!< Max enumerator value of VUSB field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Detected (0x1UL) /*!< Detected                                                       */


