tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ===================================================== Struct SAADC_CH ===================================================== */
/**
  * @brief CH [SAADC_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PSELP;                             /*!< (@ 0x00000000) Input positive pin selection for CH[n]                */
  __IOM uint32_t  PSELN;                             /*!< (@ 0x00000004) Input negative pin selection for CH[n]                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000008) Input configuration for CH[n]                         */
  __IOM uint32_t  LIMIT;                             /*!< (@ 0x0000000C) High/low limits for event monitoring a channel        */
} NRF_SAADC_CH_Type;                                 /*!< Size = 16 (0x010)                                                    */
  #define SAADC_CH_MaxCount (8UL)                    /*!< Size of CH[8] array.                                                 */
  #define SAADC_CH_MaxIndex (7UL)                    /*!< Max index of CH[8] array.                                            */
  #define SAADC_CH_MinIndex (0UL)                    /*!< Min index of CH[8] array.                                            */

/* SAADC_CH_PSELP: Input positive pin selection for CH[n] */
  #define SAADC_CH_PSELP_ResetValue (0x00000000UL)   /*!< Reset value of PSELP register.                                       */

/* PSELP @Bits 0..4 : Analog positive input channel */
  #define SAADC_CH_PSELP_PSELP_Pos (0UL)             /*!< Position of PSELP field.                                             */
  #define SAADC_CH_PSELP_PSELP_Msk (0x1FUL << SAADC_CH_PSELP_PSELP_Pos) /*!< Bit mask of PSELP field.                          */
  #define SAADC_CH_PSELP_PSELP_Min (0x0UL)           /*!< Min enumerator value of PSELP field.                                 */
  #define SAADC_CH_PSELP_PSELP_Max (0x16UL)          /*!< Max enumerator value of PSELP field.                                 */
  #define SAADC_CH_PSELP_PSELP_NC (0x00UL)           /*!< Not connected                                                        */
  #define SAADC_CH_PSELP_PSELP_AnalogInput0 (0x01UL) /*!< AIN0                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput1 (0x02UL) /*!< AIN1                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput2 (0x03UL) /*!< AIN2                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput3 (0x04UL) /*!< AIN3                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput4 (0x05UL) /*!< AIN4                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput5 (0x06UL) /*!< AIN5                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput6 (0x07UL) /*!< AIN6                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput7 (0x08UL) /*!< AIN7                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput8 (0x11UL) /*!< AIN8                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput9 (0x12UL) /*!< AIN9                                                                 */
  #define SAADC_CH_PSELP_PSELP_AnalogInput10 (0x13UL) /*!< AIN10                                                               */
  #define SAADC_CH_PSELP_PSELP_AnalogInput11 (0x14UL) /*!< AIN11                                                               */
  #define SAADC_CH_PSELP_PSELP_AnalogInput12 (0x15UL) /*!< AIN12                                                               */
  #define SAADC_CH_PSELP_PSELP_AnalogInput13 (0x16UL) /*!< AIN13                                                               */


/* SAADC_CH_PSELN: Input negative pin selection for CH[n] */
  #define SAADC_CH_PSELN_ResetValue (0x00000000UL)   /*!< Reset value of PSELN register.                                       */

/* PSELN @Bits 0..4 : Analog negative input, enables differential channel */
  #define SAADC_CH_PSELN_PSELN_Pos (0UL)             /*!< Position of PSELN field.                                             */
  #define SAADC_CH_PSELN_PSELN_Msk (0x1FUL << SAADC_CH_PSELN_PSELN_Pos) /*!< Bit mask of PSELN field.                          */
  #define SAADC_CH_PSELN_PSELN_Min (0x0UL)           /*!< Min enumerator value of PSELN field.                                 */
  #define SAADC_CH_PSELN_PSELN_Max (0x16UL)          /*!< Max enumerator value of PSELN field.                                 */
  #define SAADC_CH_PSELN_PSELN_NC (0x00UL)           /*!< Not connected                                                        */
  #define SAADC_CH_PSELN_PSELN_AnalogInput0 (0x01UL) /*!< AIN0                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput1 (0x02UL) /*!< AIN1                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput2 (0x03UL) /*!< AIN2                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput3 (0x04UL) /*!< AIN3                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput4 (0x05UL) /*!< AIN4                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput5 (0x06UL) /*!< AIN5                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput6 (0x07UL) /*!< AIN6                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput7 (0x08UL) /*!< AIN7                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput8 (0x11UL) /*!< AIN8                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput9 (0x12UL) /*!< AIN9                                                                 */
  #define SAADC_CH_PSELN_PSELN_AnalogInput10 (0x13UL) /*!< AIN10                                                               */
  #define SAADC_CH_PSELN_PSELN_AnalogInput11 (0x14UL) /*!< AIN11                                                               */
  #define SAADC_CH_PSELN_PSELN_AnalogInput12 (0x15UL) /*!< AIN12                                                               */
  #define SAADC_CH_PSELN_PSELN_AnalogInput13 (0x16UL) /*!< AIN13                                                               */


