tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SAADC_CH_CONFIG: Input configuration for CH[n] */
  #define SAADC_CH_CONFIG_ResetValue (0x00020000UL)  /*!< Reset value of CONFIG register.                                      */

/* RESP @Bits 0..1 : Positive channel resistor control */
  #define SAADC_CH_CONFIG_RESP_Pos (0UL)             /*!< Position of RESP field.                                              */
  #define SAADC_CH_CONFIG_RESP_Msk (0x3UL << SAADC_CH_CONFIG_RESP_Pos) /*!< Bit mask of RESP field.                            */
  #define SAADC_CH_CONFIG_RESP_Min (0x0UL)           /*!< Min enumerator value of RESP field.                                  */
  #define SAADC_CH_CONFIG_RESP_Max (0x3UL)           /*!< Max enumerator value of RESP field.                                  */
  #define SAADC_CH_CONFIG_RESP_Bypass (0x0UL)        /*!< Bypass resistor ladder                                               */
  #define SAADC_CH_CONFIG_RESP_Pulldown (0x1UL)      /*!< Pull-down to GND                                                     */
  #define SAADC_CH_CONFIG_RESP_Pullup (0x2UL)        /*!< Pull-up to VDD_AO_1V8                                                */
  #define SAADC_CH_CONFIG_RESP_VDDAO1V8div2 (0x3UL)  /*!< Set input at VDD_AO_1V8/2                                            */

/* RESN @Bits 4..5 : Negative channel resistor control */
  #define SAADC_CH_CONFIG_RESN_Pos (4UL)             /*!< Position of RESN field.                                              */
  #define SAADC_CH_CONFIG_RESN_Msk (0x3UL << SAADC_CH_CONFIG_RESN_Pos) /*!< Bit mask of RESN field.                            */
  #define SAADC_CH_CONFIG_RESN_Min (0x0UL)           /*!< Min enumerator value of RESN field.                                  */
  #define SAADC_CH_CONFIG_RESN_Max (0x3UL)           /*!< Max enumerator value of RESN field.                                  */
  #define SAADC_CH_CONFIG_RESN_Bypass (0x0UL)        /*!< Bypass resistor ladder                                               */
  #define SAADC_CH_CONFIG_RESN_Pulldown (0x1UL)      /*!< Pull-down to GND                                                     */
  #define SAADC_CH_CONFIG_RESN_Pullup (0x2UL)        /*!< Pull-up to VDD_AO_1V8                                                */
  #define SAADC_CH_CONFIG_RESN_VDDAO1V8div2 (0x3UL)  /*!< Set input at VDD_AO_1V8/2                                            */

/* GAIN @Bits 8..9 : Gain control */
  #define SAADC_CH_CONFIG_GAIN_Pos (8UL)             /*!< Position of GAIN field.                                              */
  #define SAADC_CH_CONFIG_GAIN_Msk (0x3UL << SAADC_CH_CONFIG_GAIN_Pos) /*!< Bit mask of GAIN field.                            */
  #define SAADC_CH_CONFIG_GAIN_Min (0x0UL)           /*!< Min enumerator value of GAIN field.                                  */
  #define SAADC_CH_CONFIG_GAIN_Max (0x3UL)           /*!< Max enumerator value of GAIN field.                                  */
  #define SAADC_CH_CONFIG_GAIN_Gain2_3 (0x0UL)       /*!< 2/3                                                                  */
  #define SAADC_CH_CONFIG_GAIN_Gain1 (0x1UL)         /*!< 1                                                                    */
  #define SAADC_CH_CONFIG_GAIN_Gain2 (0x2UL)         /*!< 2                                                                    */
  #define SAADC_CH_CONFIG_GAIN_Gain4 (0x3UL)         /*!< 4                                                                    */

/* BURST @Bit 11 : Enable burst mode */
  #define SAADC_CH_CONFIG_BURST_Pos (11UL)           /*!< Position of BURST field.                                             */
  #define SAADC_CH_CONFIG_BURST_Msk (0x1UL << SAADC_CH_CONFIG_BURST_Pos) /*!< Bit mask of BURST field.                         */
  #define SAADC_CH_CONFIG_BURST_Min (0x0UL)          /*!< Min enumerator value of BURST field.                                 */
  #define SAADC_CH_CONFIG_BURST_Max (0x1UL)          /*!< Max enumerator value of BURST field.                                 */
  #define SAADC_CH_CONFIG_BURST_Disabled (0x0UL)     /*!< Burst mode is disabled (normal operation)                            */
  #define SAADC_CH_CONFIG_BURST_Enabled (0x1UL)      /*!< Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as
                                                          fast as it can, and sends the average to Data RAM.*/

/* REFSEL @Bit 12 : Reference control */
  #define SAADC_CH_CONFIG_REFSEL_Pos (12UL)          /*!< Position of REFSEL field.                                            */
  #define SAADC_CH_CONFIG_REFSEL_Msk (0x1UL << SAADC_CH_CONFIG_REFSEL_Pos) /*!< Bit mask of REFSEL field.                      */
  #define SAADC_CH_CONFIG_REFSEL_Min (0x0UL)         /*!< Min enumerator value of REFSEL field.                                */
  #define SAADC_CH_CONFIG_REFSEL_Max (0x1UL)         /*!< Max enumerator value of REFSEL field.                                */
  #define SAADC_CH_CONFIG_REFSEL_Internal (0x0UL)    /*!< Internal reference (1.024 V)                                         */
  #define SAADC_CH_CONFIG_REFSEL_External (0x1UL)    /*!< External reference given at PADC_EXT_REF_1V2                         */

/* MODE @Bit 15 : Enable differential mode */
  #define SAADC_CH_CONFIG_MODE_Pos (15UL)            /*!< Position of MODE field.                                              */
  #define SAADC_CH_CONFIG_MODE_Msk (0x1UL << SAADC_CH_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define SAADC_CH_CONFIG_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define SAADC_CH_CONFIG_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define SAADC_CH_CONFIG_MODE_SE (0x0UL)            /*!< Single ended, PSELN will be ignored, negative input to ADC shorted to
                                                          GND*/
  #define SAADC_CH_CONFIG_MODE_Diff (0x1UL)          /*!< Differential                                                         */

/* TACQ @Bits 16..24 : Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is
                       ((TACQ+1) x 125 ns) */

  #define SAADC_CH_CONFIG_TACQ_Pos (16UL)            /*!< Position of TACQ field.                                              */
  #define SAADC_CH_CONFIG_TACQ_Msk (0x1FFUL << SAADC_CH_CONFIG_TACQ_Pos) /*!< Bit mask of TACQ field.                          */
  #define SAADC_CH_CONFIG_TACQ_Min (0x000UL)         /*!< Min value of TACQ field.                                             */
  #define SAADC_CH_CONFIG_TACQ_Max (0x13FUL)         /*!< Max size of TACQ field.                                              */

/* TCONV @Bits 28..30 : Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns) */
  #define SAADC_CH_CONFIG_TCONV_Pos (28UL)           /*!< Position of TCONV field.                                             */
  #define SAADC_CH_CONFIG_TCONV_Msk (0x7UL << SAADC_CH_CONFIG_TCONV_Pos) /*!< Bit mask of TCONV field.                         */
  #define SAADC_CH_CONFIG_TCONV_Min (0x0UL)          /*!< Min value of TCONV field.                                            */
  #define SAADC_CH_CONFIG_TCONV_Max (0x7UL)          /*!< Max size of TCONV field.                                             */


/* SAADC_CH_LIMIT: High/low limits for event monitoring a channel */
  #define SAADC_CH_LIMIT_ResetValue (0x7FFF8000UL)   /*!< Reset value of LIMIT register.                                       */

/* LOW @Bits 0..15 : Low level limit */
  #define SAADC_CH_LIMIT_LOW_Pos (0UL)               /*!< Position of LOW field.                                               */
  #define SAADC_CH_LIMIT_LOW_Msk (0xFFFFUL << SAADC_CH_LIMIT_LOW_Pos) /*!< Bit mask of LOW field.                              */

