tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH1LIMITH @Bit 8 : Write '1' to disable interrupt for event CH1LIMITH */
  #define SAADC_INTENCLR_CH1LIMITH_Pos (8UL)         /*!< Position of CH1LIMITH field.                                         */
  #define SAADC_INTENCLR_CH1LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH1LIMITH_Pos) /*!< Bit mask of CH1LIMITH field.               */
  #define SAADC_INTENCLR_CH1LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTENCLR_CH1LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTENCLR_CH1LIMITH_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH1LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH1LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH1LIMITL @Bit 9 : Write '1' to disable interrupt for event CH1LIMITL */
  #define SAADC_INTENCLR_CH1LIMITL_Pos (9UL)         /*!< Position of CH1LIMITL field.                                         */
  #define SAADC_INTENCLR_CH1LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH1LIMITL_Pos) /*!< Bit mask of CH1LIMITL field.               */
  #define SAADC_INTENCLR_CH1LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTENCLR_CH1LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTENCLR_CH1LIMITL_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH1LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH1LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH2LIMITH @Bit 10 : Write '1' to disable interrupt for event CH2LIMITH */
  #define SAADC_INTENCLR_CH2LIMITH_Pos (10UL)        /*!< Position of CH2LIMITH field.                                         */
  #define SAADC_INTENCLR_CH2LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH2LIMITH_Pos) /*!< Bit mask of CH2LIMITH field.               */
  #define SAADC_INTENCLR_CH2LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTENCLR_CH2LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTENCLR_CH2LIMITH_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH2LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH2LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH2LIMITL @Bit 11 : Write '1' to disable interrupt for event CH2LIMITL */
  #define SAADC_INTENCLR_CH2LIMITL_Pos (11UL)        /*!< Position of CH2LIMITL field.                                         */
  #define SAADC_INTENCLR_CH2LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH2LIMITL_Pos) /*!< Bit mask of CH2LIMITL field.               */
  #define SAADC_INTENCLR_CH2LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTENCLR_CH2LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTENCLR_CH2LIMITL_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH2LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH2LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH3LIMITH @Bit 12 : Write '1' to disable interrupt for event CH3LIMITH */
  #define SAADC_INTENCLR_CH3LIMITH_Pos (12UL)        /*!< Position of CH3LIMITH field.                                         */
  #define SAADC_INTENCLR_CH3LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH3LIMITH_Pos) /*!< Bit mask of CH3LIMITH field.               */
  #define SAADC_INTENCLR_CH3LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTENCLR_CH3LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTENCLR_CH3LIMITH_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH3LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH3LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH3LIMITL @Bit 13 : Write '1' to disable interrupt for event CH3LIMITL */
  #define SAADC_INTENCLR_CH3LIMITL_Pos (13UL)        /*!< Position of CH3LIMITL field.                                         */
  #define SAADC_INTENCLR_CH3LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH3LIMITL_Pos) /*!< Bit mask of CH3LIMITL field.               */
  #define SAADC_INTENCLR_CH3LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTENCLR_CH3LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTENCLR_CH3LIMITL_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH3LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH3LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH4LIMITH @Bit 14 : Write '1' to disable interrupt for event CH4LIMITH */
  #define SAADC_INTENCLR_CH4LIMITH_Pos (14UL)        /*!< Position of CH4LIMITH field.                                         */
  #define SAADC_INTENCLR_CH4LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH4LIMITH_Pos) /*!< Bit mask of CH4LIMITH field.               */
  #define SAADC_INTENCLR_CH4LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTENCLR_CH4LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTENCLR_CH4LIMITH_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH4LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH4LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

