tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIM_PSEL_MISO: Pin select for MISO signal */
  #define SPIM_PSEL_MISO_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MISO register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_MISO_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SPIM_PSEL_MISO_PIN_Msk (0x1FUL << SPIM_PSEL_MISO_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define SPIM_PSEL_MISO_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define SPIM_PSEL_MISO_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_MISO_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define SPIM_PSEL_MISO_PORT_Msk (0xFUL << SPIM_PSEL_MISO_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define SPIM_PSEL_MISO_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define SPIM_PSEL_MISO_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_MISO_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define SPIM_PSEL_MISO_CONNECT_Msk (0x1UL << SPIM_PSEL_MISO_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SPIM_PSEL_MISO_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_MISO_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_MISO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define SPIM_PSEL_MISO_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* SPIM_PSEL_CSN: Pin select for CSN */
  #define SPIM_PSEL_CSN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of CSN register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_CSN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIM_PSEL_CSN_PIN_Msk (0x1FUL << SPIM_PSEL_CSN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIM_PSEL_CSN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIM_PSEL_CSN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_CSN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIM_PSEL_CSN_PORT_Msk (0xFUL << SPIM_PSEL_CSN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIM_PSEL_CSN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIM_PSEL_CSN_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_CSN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIM_PSEL_CSN_CONNECT_Msk (0x1UL << SPIM_PSEL_CSN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIM_PSEL_CSN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_CSN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_CSN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIM_PSEL_CSN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ===================================================== Struct SPIM_RXD ===================================================== */
/**
  * @brief RXD [SPIM_RXD] RXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_SPIM_RXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* SPIM_RXD_PTR: Data pointer */
  #define SPIM_RXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define SPIM_RXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define SPIM_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << SPIM_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* SPIM_RXD_MAXCNT: Maximum number of bytes in receive buffer */
  #define SPIM_RXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in receive buffer */
  #define SPIM_RXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define SPIM_RXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << SPIM_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define SPIM_RXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define SPIM_RXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


