tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIM_RXD_AMOUNT: Number of bytes transferred in the last transaction */
  #define SPIM_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction */
  #define SPIM_RXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define SPIM_RXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << SPIM_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define SPIM_RXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define SPIM_RXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* SPIM_RXD_LIST: EasyDMA list type */
  #define SPIM_RXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..1 : List type */
  #define SPIM_RXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define SPIM_RXD_LIST_LIST_Msk (0x3UL << SPIM_RXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define SPIM_RXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define SPIM_RXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define SPIM_RXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define SPIM_RXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



/* ===================================================== Struct SPIM_TXD ===================================================== */
/**
  * @brief TXD [SPIM_TXD] TXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Number of bytes in transmit buffer                    */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_SPIM_TXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* SPIM_TXD_PTR: Data pointer */
  #define SPIM_TXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define SPIM_TXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define SPIM_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << SPIM_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* SPIM_TXD_MAXCNT: Number of bytes in transmit buffer */
  #define SPIM_TXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in transmit buffer */
  #define SPIM_TXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define SPIM_TXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << SPIM_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define SPIM_TXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define SPIM_TXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


/* SPIM_TXD_AMOUNT: Number of bytes transferred in the last transaction */
  #define SPIM_TXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction */
  #define SPIM_TXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define SPIM_TXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << SPIM_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define SPIM_TXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define SPIM_TXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* SPIM_TXD_LIST: EasyDMA list type */
  #define SPIM_TXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..1 : List type */
  #define SPIM_TXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define SPIM_TXD_LIST_LIST_Msk (0x3UL << SPIM_TXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define SPIM_TXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define SPIM_TXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define SPIM_TXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define SPIM_TXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



/* ================================================== Struct SPIM_IFTIMING =================================================== */
/**
  * @brief IFTIMING [SPIM_IFTIMING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RXDELAY;                           /*!< (@ 0x00000000) Sample delay for input serial data on MISO            */
  __IOM uint32_t  CSNDUR;                            /*!< (@ 0x00000004) Minimum duration between edge of CSN and edge of SCK.
                                                                         When SHORTS.END_START is used, this is also the minimum
                                                                         duration CSN must stay high between transactions.*/
} NRF_SPIM_IFTIMING_Type;                            /*!< Size = 8 (0x008)                                                     */

/* SPIM_IFTIMING_RXDELAY: Sample delay for input serial data on MISO */
  #define SPIM_IFTIMING_RXDELAY_ResetValue (0x00000002UL) /*!< Reset value of RXDELAY register.                                */

/* RXDELAY @Bits 0..2 : Sample delay for input serial data on MISO. The value specifies the number of 64 MHz clock cycles
                        (15.625 ns) delay from the the sampling edge of SCK (leading edge for CONFIG.CPHA = 0, trailing edge for
                        CONFIG.CPHA = 1) until the input serial data is sampled. As en example, if RXDELAY = 0 and CONFIG.CPHA =
                        0, the input serial data is sampled on the rising edge of SCK. */

  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Pos (0UL)    /*!< Position of RXDELAY field.                                           */
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Msk (0x7UL << SPIM_IFTIMING_RXDELAY_RXDELAY_Pos) /*!< Bit mask of RXDELAY field.       */
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Min (0x0UL)  /*!< Min value of RXDELAY field.                                          */
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Max (0x7UL)  /*!< Max size of RXDELAY field.                                           */


/* SPIM_IFTIMING_CSNDUR: Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is also the
                          minimum duration CSN must stay high between transactions. */

  #define SPIM_IFTIMING_CSNDUR_ResetValue (0x00000002UL) /*!< Reset value of CSNDUR register.                                  */

/* CSNDUR @Bits 0..7 : Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is the minimum
                       duration CSN must stay high between transactions. The value is specified in number of 64 MHz clock cycles
                       (15.625 ns). */

  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Pos (0UL)      /*!< Position of CSNDUR field.                                            */
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Msk (0xFFUL << SPIM_IFTIMING_CSNDUR_CSNDUR_Pos) /*!< Bit mask of CSNDUR field.           */
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Min (0x00UL)   /*!< Min value of CSNDUR field.                                           */
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Max (0xFFUL)   /*!< Max size of CSNDUR field.                                            */



/* =================================================== Struct SPIM_DMA_RX ==================================================== */
/**
  * @brief RX [SPIM_DMA_RX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_SPIM_DMA_RX_Type;                              /*!< Size = 8 (0x008)                                                     */

/* SPIM_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define SPIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


/* SPIM_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define SPIM_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                  */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define SPIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                        */
  #define SPIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SPIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct SPIM_DMA_TX ==================================================== */
/**
  * @brief TX [SPIM_DMA_TX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_SPIM_DMA_TX_Type;                              /*!< Size = 8 (0x008)                                                     */

/* SPIM_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define SPIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


/* SPIM_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define SPIM_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                  */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define SPIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                        */
  #define SPIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SPIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



