tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ===================================================== Struct SPIM_DMA ===================================================== */
/**
  * @brief DMA [SPIM_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_SPIM_DMA_RX_Type RX;                     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_SPIM_DMA_TX_Type TX;                     /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_SPIM_DMA_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* ======================================================= Struct SPIM ======================================================= */
/**
  * @brief Serial Peripheral Interface Master with EasyDMA
  */
  typedef struct {                                   /*!< SPIM Structure                                                       */
    __IM uint32_t RESERVED[4];
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000010) Start SPI transaction                                 */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000014) Stop SPI transaction                                  */
    __IM uint32_t RESERVED1;
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000001C) Suspend SPI transaction                               */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000020) Resume SPI transaction                                */
    __IM uint32_t RESERVED2[27];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000090) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000094) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED3;
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x000000A0) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED4[24];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) SPI transaction has stopped                           */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t EVENTS_ENDRX;                     /*!< (@ 0x00000110) End of RXD buffer reached                             */
    __IM uint32_t RESERVED6;
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000118) End of RXD buffer and TXD buffer reached              */
    __IM uint32_t RESERVED7;
    __IOM uint32_t EVENTS_ENDTX;                     /*!< (@ 0x00000120) End of TXD buffer reached                             */
    __IM uint32_t RESERVED8[10];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x0000014C) Transaction started                                   */
    __IM uint32_t RESERVED9[9];
    __IOM uint32_t EVENTS_RXBUSERROR;                /*!< (@ 0x00000174) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IOM uint32_t EVENTS_TXBUSERROR;                /*!< (@ 0x00000178) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IM uint32_t RESERVED10[2];
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED11[2];
    __IOM uint32_t PUBLISH_ENDRX;                    /*!< (@ 0x00000190) Publish configuration for event ENDRX                 */
    __IM uint32_t RESERVED12;
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000198) Publish configuration for event END                   */
    __IM uint32_t RESERVED13;
    __IOM uint32_t PUBLISH_ENDTX;                    /*!< (@ 0x000001A0) Publish configuration for event ENDTX                 */
    __IM uint32_t RESERVED14[10];
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x000001CC) Publish configuration for event STARTED               */
    __IM uint32_t RESERVED15[9];
    __IOM uint32_t PUBLISH_RXBUSERROR;               /*!< (@ 0x000001F4) Publish configuration for event RXBUSERROR            */
    __IOM uint32_t PUBLISH_TXBUSERROR;               /*!< (@ 0x000001F8) Publish configuration for event TXBUSERROR            */
    __IM uint32_t RESERVED16;
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED17[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED18[61];
    __IOM uint32_t STALLSTAT;                        /*!< (@ 0x00000400) Stall status for EasyDMA RAM accesses. The fields in
                                                                         this register are set to STALL by hardware whenever a
                                                                         stall occurres and can be cleared (set to NOSTALL) by
                                                                         the CPU.*/
    __IM uint32_t RESERVED19[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable SPIM                                           */
    __IM uint32_t RESERVED20;
    __IOM NRF_SPIM_PSEL_Type PSEL;                   /*!< (@ 0x00000508) (unspecified)                                         */
    __IM uint32_t RESERVED21[3];
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000524) SPI frequency. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED22[3];
    __IOM NRF_SPIM_RXD_Type RXD;                     /*!< (@ 0x00000534) RXD EasyDMA channel                                   */
    __IOM NRF_SPIM_TXD_Type TXD;                     /*!< (@ 0x00000544) TXD EasyDMA channel                                   */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000554) Configuration register                                */
    __IM uint32_t RESERVED23[2];
    __IOM NRF_SPIM_IFTIMING_Type IFTIMING;           /*!< (@ 0x00000560) (unspecified)                                         */
    __IOM uint32_t CSNPOL;                           /*!< (@ 0x00000568) Polarity of CSN output                                */
    __IOM uint32_t PSELDCX;                          /*!< (@ 0x0000056C) Pin select for DCX signal                             */
    __IOM uint32_t DCXCNT;                           /*!< (@ 0x00000570) DCX configuration                                     */
    __IM uint32_t RESERVED24[15];
    __IOM NRF_SPIM_DMA_Type DMA;                     /*!< (@ 0x000005B0) (unspecified)                                         */
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Byte transmitted after TXD.MAXCNT bytes have been
                                                                         transmitted in the case when RXD.MAXCNT is greater than
                                                                         TXD.MAXCNT*/
  } NRF_SPIM_Type;                                   /*!< Size = 1476 (0x5C4)                                                  */

/* SPIM_TASKS_START: Start SPI transaction */
  #define SPIM_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start SPI transaction */
  #define SPIM_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define SPIM_TASKS_START_TASKS_START_Msk (0x1UL << SPIM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define SPIM_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define SPIM_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define SPIM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* SPIM_TASKS_STOP: Stop SPI transaction */
  #define SPIM_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop SPI transaction */
  #define SPIM_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define SPIM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define SPIM_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define SPIM_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define SPIM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* SPIM_TASKS_SUSPEND: Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SUSPEND register.                             */

/* TASKS_SUSPEND @Bit 0 : Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field.                                     */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL) /*!< Min enumerator value of TASKS_SUSPEND field.                       */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL) /*!< Max enumerator value of TASKS_SUSPEND field.                       */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                   */


