tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EVENTS_ENDRX @Bit 0 : End of RXD buffer reached */
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Pos (0UL)   /*!< Position of EVENTS_ENDRX field.                                      */
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Msk (0x1UL << SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Pos) /*!< Bit mask of EVENTS_ENDRX field.*/
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDRX field.                          */
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDRX field.                          */
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Generated (0x1UL) /*!< Event generated                                                */


/* SPIM_EVENTS_END: End of RXD buffer and TXD buffer reached */
  #define SPIM_EVENTS_END_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_END register.                                  */

/* EVENTS_END @Bit 0 : End of RXD buffer and TXD buffer reached */
  #define SPIM_EVENTS_END_EVENTS_END_Pos (0UL)       /*!< Position of EVENTS_END field.                                        */
  #define SPIM_EVENTS_END_EVENTS_END_Msk (0x1UL << SPIM_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field.          */
  #define SPIM_EVENTS_END_EVENTS_END_Min (0x0UL)     /*!< Min enumerator value of EVENTS_END field.                            */
  #define SPIM_EVENTS_END_EVENTS_END_Max (0x1UL)     /*!< Max enumerator value of EVENTS_END field.                            */
  #define SPIM_EVENTS_END_EVENTS_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define SPIM_EVENTS_END_EVENTS_END_Generated (0x1UL) /*!< Event generated                                                    */


/* SPIM_EVENTS_ENDTX: End of TXD buffer reached */
  #define SPIM_EVENTS_ENDTX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDTX register.                               */

/* EVENTS_ENDTX @Bit 0 : End of TXD buffer reached */
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Pos (0UL)   /*!< Position of EVENTS_ENDTX field.                                      */
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Msk (0x1UL << SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Pos) /*!< Bit mask of EVENTS_ENDTX field.*/
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDTX field.                          */
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDTX field.                          */
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Generated (0x1UL) /*!< Event generated                                                */


/* SPIM_EVENTS_STARTED: Transaction started */
  #define SPIM_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                           */

/* EVENTS_STARTED @Bit 0 : Transaction started */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                  */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                    */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                    */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                            */


/* SPIM_EVENTS_RXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define SPIM_EVENTS_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXBUSERROR register.                     */

/* EVENTS_RXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos (0UL) /*!< Position of EVENTS_RXBUSERROR field.                         */
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Msk (0x1UL << SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_RXBUSERROR field.*/
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXBUSERROR field.           */
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXBUSERROR field.           */
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define SPIM_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* SPIM_EVENTS_TXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define SPIM_EVENTS_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXBUSERROR register.                     */

/* EVENTS_TXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos (0UL) /*!< Position of EVENTS_TXBUSERROR field.                         */
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Msk (0x1UL << SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TXBUSERROR field.*/
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXBUSERROR field.           */
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXBUSERROR field.           */
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define SPIM_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* SPIM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define SPIM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define SPIM_PUBLISH_STOPPED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define SPIM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_STOPPED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_STOPPED_EN_Msk (0x1UL << SPIM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SPIM_PUBLISH_STOPPED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_STOPPED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_STOPPED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define SPIM_PUBLISH_STOPPED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* SPIM_PUBLISH_ENDRX: Publish configuration for event ENDRX */
  #define SPIM_PUBLISH_ENDRX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ENDRX register.                             */

