tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event ENDRX will publish to */
  #define SPIM_PUBLISH_ENDRX_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_ENDRX_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_ENDRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define SPIM_PUBLISH_ENDRX_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_ENDRX_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_ENDRX_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_ENDRX_EN_Msk (0x1UL << SPIM_PUBLISH_ENDRX_EN_Pos) /*!< Bit mask of EN field.                            */
  #define SPIM_PUBLISH_ENDRX_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_ENDRX_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_ENDRX_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define SPIM_PUBLISH_ENDRX_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* SPIM_PUBLISH_END: Publish configuration for event END */
  #define SPIM_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SPIM_PUBLISH_END_CHIDX_Pos (0UL)           /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_END_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                      */
  #define SPIM_PUBLISH_END_CHIDX_Min (0x00UL)        /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_END_CHIDX_Max (0xFFUL)        /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_END_EN_Pos (31UL)             /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_END_EN_Msk (0x1UL << SPIM_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                                */
  #define SPIM_PUBLISH_END_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_END_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_END_EN_Disabled (0x0UL)       /*!< Disable publishing                                                   */
  #define SPIM_PUBLISH_END_EN_Enabled (0x1UL)        /*!< Enable publishing                                                    */


/* SPIM_PUBLISH_ENDTX: Publish configuration for event ENDTX */
  #define SPIM_PUBLISH_ENDTX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ENDTX register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ENDTX will publish to */
  #define SPIM_PUBLISH_ENDTX_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_ENDTX_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_ENDTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define SPIM_PUBLISH_ENDTX_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_ENDTX_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_ENDTX_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_ENDTX_EN_Msk (0x1UL << SPIM_PUBLISH_ENDTX_EN_Pos) /*!< Bit mask of EN field.                            */
  #define SPIM_PUBLISH_ENDTX_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_ENDTX_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_ENDTX_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define SPIM_PUBLISH_ENDTX_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* SPIM_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define SPIM_PUBLISH_STARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STARTED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define SPIM_PUBLISH_STARTED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define SPIM_PUBLISH_STARTED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_STARTED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_STARTED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_STARTED_EN_Msk (0x1UL << SPIM_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SPIM_PUBLISH_STARTED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_STARTED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_STARTED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define SPIM_PUBLISH_STARTED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


