tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIM_PUBLISH_RXBUSERROR: Publish configuration for event RXBUSERROR */
  #define SPIM_PUBLISH_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event RXBUSERROR will publish to */
  #define SPIM_PUBLISH_RXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_RXBUSERROR_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_RXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SPIM_PUBLISH_RXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_RXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Msk (0x1UL << SPIM_PUBLISH_RXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define SPIM_PUBLISH_RXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* SPIM_PUBLISH_TXBUSERROR: Publish configuration for event TXBUSERROR */
  #define SPIM_PUBLISH_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXBUSERROR will publish to */
  #define SPIM_PUBLISH_TXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SPIM_PUBLISH_TXBUSERROR_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_TXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SPIM_PUBLISH_TXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SPIM_PUBLISH_TXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Msk (0x1UL << SPIM_PUBLISH_TXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define SPIM_PUBLISH_TXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* SPIM_SHORTS: Shortcuts between local events and tasks */
  #define SPIM_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* END_START @Bit 17 : Shortcut between event END and task START */
  #define SPIM_SHORTS_END_START_Pos (17UL)           /*!< Position of END_START field.                                         */
  #define SPIM_SHORTS_END_START_Msk (0x1UL << SPIM_SHORTS_END_START_Pos) /*!< Bit mask of END_START field.                     */
  #define SPIM_SHORTS_END_START_Min (0x0UL)          /*!< Min enumerator value of END_START field.                             */
  #define SPIM_SHORTS_END_START_Max (0x1UL)          /*!< Max enumerator value of END_START field.                             */
  #define SPIM_SHORTS_END_START_Disabled (0x0UL)     /*!< Disable shortcut                                                     */
  #define SPIM_SHORTS_END_START_Enabled (0x1UL)      /*!< Enable shortcut                                                      */


/* SPIM_INTENSET: Enable interrupt */
  #define SPIM_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define SPIM_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define SPIM_INTENSET_STOPPED_Msk (0x1UL << SPIM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define SPIM_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define SPIM_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define SPIM_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define SPIM_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to enable interrupt for event ENDRX */
  #define SPIM_INTENSET_ENDRX_Pos (4UL)              /*!< Position of ENDRX field.                                             */
  #define SPIM_INTENSET_ENDRX_Msk (0x1UL << SPIM_INTENSET_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define SPIM_INTENSET_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define SPIM_INTENSET_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define SPIM_INTENSET_ENDRX_Set (0x1UL)            /*!< Enable                                                               */
  #define SPIM_INTENSET_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* END @Bit 6 : Write '1' to enable interrupt for event END */
  #define SPIM_INTENSET_END_Pos (6UL)                /*!< Position of END field.                                               */
  #define SPIM_INTENSET_END_Msk (0x1UL << SPIM_INTENSET_END_Pos) /*!< Bit mask of END field.                                   */
  #define SPIM_INTENSET_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SPIM_INTENSET_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SPIM_INTENSET_END_Set (0x1UL)              /*!< Enable                                                               */
  #define SPIM_INTENSET_END_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_END_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* ENDTX @Bit 8 : Write '1' to enable interrupt for event ENDTX */
  #define SPIM_INTENSET_ENDTX_Pos (8UL)              /*!< Position of ENDTX field.                                             */
  #define SPIM_INTENSET_ENDTX_Msk (0x1UL << SPIM_INTENSET_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define SPIM_INTENSET_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define SPIM_INTENSET_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define SPIM_INTENSET_ENDTX_Set (0x1UL)            /*!< Enable                                                               */
  #define SPIM_INTENSET_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* STARTED @Bit 19 : Write '1' to enable interrupt for event STARTED */
  #define SPIM_INTENSET_STARTED_Pos (19UL)           /*!< Position of STARTED field.                                           */
  #define SPIM_INTENSET_STARTED_Msk (0x1UL << SPIM_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define SPIM_INTENSET_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define SPIM_INTENSET_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define SPIM_INTENSET_STARTED_Set (0x1UL)          /*!< Enable                                                               */
  #define SPIM_INTENSET_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

