tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RXBUSERROR @Bit 29 : Write '1' to enable interrupt for event RXBUSERROR */
  #define SPIM_INTENSET_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define SPIM_INTENSET_RXBUSERROR_Msk (0x1UL << SPIM_INTENSET_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define SPIM_INTENSET_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define SPIM_INTENSET_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define SPIM_INTENSET_RXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define SPIM_INTENSET_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to enable interrupt for event TXBUSERROR */
  #define SPIM_INTENSET_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define SPIM_INTENSET_TXBUSERROR_Msk (0x1UL << SPIM_INTENSET_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define SPIM_INTENSET_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define SPIM_INTENSET_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define SPIM_INTENSET_TXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define SPIM_INTENSET_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENSET_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* SPIM_INTENCLR: Disable interrupt */
  #define SPIM_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define SPIM_INTENCLR_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define SPIM_INTENCLR_STOPPED_Msk (0x1UL << SPIM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define SPIM_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define SPIM_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define SPIM_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define SPIM_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to disable interrupt for event ENDRX */
  #define SPIM_INTENCLR_ENDRX_Pos (4UL)              /*!< Position of ENDRX field.                                             */
  #define SPIM_INTENCLR_ENDRX_Msk (0x1UL << SPIM_INTENCLR_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define SPIM_INTENCLR_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define SPIM_INTENCLR_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define SPIM_INTENCLR_ENDRX_Clear (0x1UL)          /*!< Disable                                                              */
  #define SPIM_INTENCLR_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* END @Bit 6 : Write '1' to disable interrupt for event END */
  #define SPIM_INTENCLR_END_Pos (6UL)                /*!< Position of END field.                                               */
  #define SPIM_INTENCLR_END_Msk (0x1UL << SPIM_INTENCLR_END_Pos) /*!< Bit mask of END field.                                   */
  #define SPIM_INTENCLR_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SPIM_INTENCLR_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SPIM_INTENCLR_END_Clear (0x1UL)            /*!< Disable                                                              */
  #define SPIM_INTENCLR_END_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_END_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* ENDTX @Bit 8 : Write '1' to disable interrupt for event ENDTX */
  #define SPIM_INTENCLR_ENDTX_Pos (8UL)              /*!< Position of ENDTX field.                                             */
  #define SPIM_INTENCLR_ENDTX_Msk (0x1UL << SPIM_INTENCLR_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define SPIM_INTENCLR_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define SPIM_INTENCLR_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define SPIM_INTENCLR_ENDTX_Clear (0x1UL)          /*!< Disable                                                              */
  #define SPIM_INTENCLR_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* STARTED @Bit 19 : Write '1' to disable interrupt for event STARTED */
  #define SPIM_INTENCLR_STARTED_Pos (19UL)           /*!< Position of STARTED field.                                           */
  #define SPIM_INTENCLR_STARTED_Msk (0x1UL << SPIM_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define SPIM_INTENCLR_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define SPIM_INTENCLR_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define SPIM_INTENCLR_STARTED_Clear (0x1UL)        /*!< Disable                                                              */
  #define SPIM_INTENCLR_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to disable interrupt for event RXBUSERROR */
  #define SPIM_INTENCLR_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define SPIM_INTENCLR_RXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define SPIM_INTENCLR_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define SPIM_INTENCLR_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define SPIM_INTENCLR_RXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIM_INTENCLR_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

