tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXBUSERROR @Bit 30 : Write '1' to disable interrupt for event TXBUSERROR */
  #define SPIM_INTENCLR_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define SPIM_INTENCLR_TXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define SPIM_INTENCLR_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define SPIM_INTENCLR_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define SPIM_INTENCLR_TXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIM_INTENCLR_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* SPIM_STALLSTAT: Stall status for EasyDMA RAM accesses. The fields in this register are set to STALL by hardware whenever a
                    stall occurres and can be cleared (set to NOSTALL) by the CPU. */

  #define SPIM_STALLSTAT_ResetValue (0x00000000UL)   /*!< Reset value of STALLSTAT register.                                   */

/* TX @Bit 0 : Stall status for EasyDMA RAM reads */
  #define SPIM_STALLSTAT_TX_Pos (0UL)                /*!< Position of TX field.                                                */
  #define SPIM_STALLSTAT_TX_Msk (0x1UL << SPIM_STALLSTAT_TX_Pos) /*!< Bit mask of TX field.                                    */
  #define SPIM_STALLSTAT_TX_Min (0x0UL)              /*!< Min value of TX field.                                               */
  #define SPIM_STALLSTAT_TX_Max (0x1UL)              /*!< Max size of TX field.                                                */
  #define SPIM_STALLSTAT_TX_NOSTALL (0x0UL)          /*!< No stall                                                             */
  #define SPIM_STALLSTAT_TX_STALL (0x1UL)            /*!< A stall has occurred                                                 */

/* RX @Bit 1 : Stall status for EasyDMA RAM writes */
  #define SPIM_STALLSTAT_RX_Pos (1UL)                /*!< Position of RX field.                                                */
  #define SPIM_STALLSTAT_RX_Msk (0x1UL << SPIM_STALLSTAT_RX_Pos) /*!< Bit mask of RX field.                                    */
  #define SPIM_STALLSTAT_RX_Min (0x0UL)              /*!< Min value of RX field.                                               */
  #define SPIM_STALLSTAT_RX_Max (0x1UL)              /*!< Max size of RX field.                                                */
  #define SPIM_STALLSTAT_RX_NOSTALL (0x0UL)          /*!< No stall                                                             */
  #define SPIM_STALLSTAT_RX_STALL (0x1UL)            /*!< A stall has occurred                                                 */


/* SPIM_ENABLE: Enable SPIM */
  #define SPIM_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable SPIM */
  #define SPIM_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define SPIM_ENABLE_ENABLE_Msk (0xFUL << SPIM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define SPIM_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define SPIM_ENABLE_ENABLE_Max (0x7UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define SPIM_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable SPIM                                                         */
  #define SPIM_ENABLE_ENABLE_Enabled (0x7UL)         /*!< Enable SPIM                                                          */


/* SPIM_FREQUENCY: SPI frequency. Accuracy depends on the HFCLK source selected. */
  #define SPIM_FREQUENCY_ResetValue (0x04000000UL)   /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..31 : SPI master data rate */
  #define SPIM_FREQUENCY_FREQUENCY_Pos (0UL)         /*!< Position of FREQUENCY field.                                         */
  #define SPIM_FREQUENCY_FREQUENCY_Msk (0xFFFFFFFFUL << SPIM_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.        */
  #define SPIM_FREQUENCY_FREQUENCY_Min (0x2000000UL) /*!< Min enumerator value of FREQUENCY field.                             */
  #define SPIM_FREQUENCY_FREQUENCY_Max (0x80000000UL) /*!< Max enumerator value of FREQUENCY field.                            */
  #define SPIM_FREQUENCY_FREQUENCY_K125 (0x02000000UL) /*!< 125 kbps                                                           */
  #define SPIM_FREQUENCY_FREQUENCY_K250 (0x04000000UL) /*!< 250 kbps                                                           */
  #define SPIM_FREQUENCY_FREQUENCY_K500 (0x08000000UL) /*!< 500 kbps                                                           */
  #define SPIM_FREQUENCY_FREQUENCY_M1 (0x10000000UL) /*!< 1 Mbps                                                               */
  #define SPIM_FREQUENCY_FREQUENCY_M2 (0x20000000UL) /*!< 2 Mbps                                                               */
  #define SPIM_FREQUENCY_FREQUENCY_M4 (0x40000000UL) /*!< 4 Mbps                                                               */
  #define SPIM_FREQUENCY_FREQUENCY_M8 (0x80000000UL) /*!< 8 Mbps                                                               */
  #define SPIM_FREQUENCY_FREQUENCY_M16 (0x0A000000UL) /*!< 16 Mbps                                                             */
  #define SPIM_FREQUENCY_FREQUENCY_M32 (0x14000000UL) /*!< 32 Mbps                                                             */


/* SPIM_CONFIG: Configuration register */
  #define SPIM_CONFIG_ResetValue (0x00000000UL)      /*!< Reset value of CONFIG register.                                      */

/* ORDER @Bit 0 : Bit order */
  #define SPIM_CONFIG_ORDER_Pos (0UL)                /*!< Position of ORDER field.                                             */
  #define SPIM_CONFIG_ORDER_Msk (0x1UL << SPIM_CONFIG_ORDER_Pos) /*!< Bit mask of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_Min (0x0UL)              /*!< Min enumerator value of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_Max (0x1UL)              /*!< Max enumerator value of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_MsbFirst (0x0UL)         /*!< Most significant bit shifted out first                               */
  #define SPIM_CONFIG_ORDER_LsbFirst (0x1UL)         /*!< Least significant bit shifted out first                              */

