tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CPHA @Bit 1 : Serial clock (SCK) phase */
  #define SPIM_CONFIG_CPHA_Pos (1UL)                 /*!< Position of CPHA field.                                              */
  #define SPIM_CONFIG_CPHA_Msk (0x1UL << SPIM_CONFIG_CPHA_Pos) /*!< Bit mask of CPHA field.                                    */
  #define SPIM_CONFIG_CPHA_Min (0x0UL)               /*!< Min enumerator value of CPHA field.                                  */
  #define SPIM_CONFIG_CPHA_Max (0x1UL)               /*!< Max enumerator value of CPHA field.                                  */
  #define SPIM_CONFIG_CPHA_Leading (0x0UL)           /*!< Sample on leading edge of clock, shift serial data on trailing edge  */
  #define SPIM_CONFIG_CPHA_Trailing (0x1UL)          /*!< Sample on trailing edge of clock, shift serial data on leading edge  */

/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPIM_CONFIG_CPOL_Pos (2UL)                 /*!< Position of CPOL field.                                              */
  #define SPIM_CONFIG_CPOL_Msk (0x1UL << SPIM_CONFIG_CPOL_Pos) /*!< Bit mask of CPOL field.                                    */
  #define SPIM_CONFIG_CPOL_Min (0x0UL)               /*!< Min enumerator value of CPOL field.                                  */
  #define SPIM_CONFIG_CPOL_Max (0x1UL)               /*!< Max enumerator value of CPOL field.                                  */
  #define SPIM_CONFIG_CPOL_ActiveHigh (0x0UL)        /*!< Active high                                                          */
  #define SPIM_CONFIG_CPOL_ActiveLow (0x1UL)         /*!< Active low                                                           */


/* SPIM_CSNPOL: Polarity of CSN output */
  #define SPIM_CSNPOL_ResetValue (0x00000000UL)      /*!< Reset value of CSNPOL register.                                      */

/* CSNPOL @Bit 0 : Polarity of CSN output */
  #define SPIM_CSNPOL_CSNPOL_Pos (0UL)               /*!< Position of CSNPOL field.                                            */
  #define SPIM_CSNPOL_CSNPOL_Msk (0x1UL << SPIM_CSNPOL_CSNPOL_Pos) /*!< Bit mask of CSNPOL field.                              */
  #define SPIM_CSNPOL_CSNPOL_Min (0x0UL)             /*!< Min enumerator value of CSNPOL field.                                */
  #define SPIM_CSNPOL_CSNPOL_Max (0x1UL)             /*!< Max enumerator value of CSNPOL field.                                */
  #define SPIM_CSNPOL_CSNPOL_LOW (0x0UL)             /*!< Active low (idle state high)                                         */
  #define SPIM_CSNPOL_CSNPOL_HIGH (0x1UL)            /*!< Active high (idle state low)                                         */


/* SPIM_PSELDCX: Pin select for DCX signal */
  #define SPIM_PSELDCX_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of PSELDCX register.                                     */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSELDCX_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define SPIM_PSELDCX_PIN_Msk (0x1FUL << SPIM_PSELDCX_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define SPIM_PSELDCX_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define SPIM_PSELDCX_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSELDCX_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define SPIM_PSELDCX_PORT_Msk (0xFUL << SPIM_PSELDCX_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define SPIM_PSELDCX_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define SPIM_PSELDCX_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSELDCX_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define SPIM_PSELDCX_CONNECT_Msk (0x1UL << SPIM_PSELDCX_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define SPIM_PSELDCX_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSELDCX_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSELDCX_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define SPIM_PSELDCX_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* SPIM_DCXCNT: DCX configuration */
  #define SPIM_DCXCNT_ResetValue (0x00000000UL)      /*!< Reset value of DCXCNT register.                                      */

/* DCXCNT @Bits 0..3 : This register specifies the number of command bytes preceding the data bytes. The PSEL.DCX line will be
                       low during transmission of command bytes and high during transmission of data bytes. Value 0xF indicates
                       that all bytes are command bytes. */

  #define SPIM_DCXCNT_DCXCNT_Pos (0UL)               /*!< Position of DCXCNT field.                                            */
  #define SPIM_DCXCNT_DCXCNT_Msk (0xFUL << SPIM_DCXCNT_DCXCNT_Pos) /*!< Bit mask of DCXCNT field.                              */
  #define SPIM_DCXCNT_DCXCNT_Min (0x0UL)             /*!< Min value of DCXCNT field.                                           */
  #define SPIM_DCXCNT_DCXCNT_Max (0xFUL)             /*!< Max size of DCXCNT field.                                            */


/* SPIM_ORC: Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than
              TXD.MAXCNT */

  #define SPIM_ORC_ResetValue (0x00000000UL)         /*!< Reset value of ORC register.                                         */

/* ORC @Bits 0..7 : Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than
                    TXD.MAXCNT. */

  #define SPIM_ORC_ORC_Pos (0UL)                     /*!< Position of ORC field.                                               */
  #define SPIM_ORC_ORC_Msk (0xFFUL << SPIM_ORC_ORC_Pos) /*!< Bit mask of ORC field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SPIS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct SPIS_PSEL ===================================================== */
/**
  * @brief PSEL [SPIS_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000000) Pin select for SCK                                    */
  __IOM uint32_t  MISO;                              /*!< (@ 0x00000004) Pin select for MISO signal                            */
  __IOM uint32_t  MOSI;                              /*!< (@ 0x00000008) Pin select for MOSI signal                            */
  __IOM uint32_t  CSN;                               /*!< (@ 0x0000000C) Pin select for CSN signal                             */
} NRF_SPIS_PSEL_Type;                                /*!< Size = 16 (0x010)                                                    */

/* SPIS_PSEL_SCK: Pin select for SCK */
  #define SPIS_PSEL_SCK_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_SCK_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_SCK_PIN_Msk (0x1FUL << SPIS_PSEL_SCK_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIS_PSEL_SCK_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_SCK_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_SCK_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_SCK_PORT_Msk (0xFUL << SPIS_PSEL_SCK_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIS_PSEL_SCK_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_SCK_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_SCK_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_SCK_CONNECT_Msk (0x1UL << SPIS_PSEL_SCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIS_PSEL_SCK_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_SCK_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_SCK_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIS_PSEL_SCK_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* SPIS_PSEL_MISO: Pin select for MISO signal */
  #define SPIS_PSEL_MISO_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MISO register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_MISO_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_MISO_PIN_Msk (0x1FUL << SPIS_PSEL_MISO_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define SPIS_PSEL_MISO_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_MISO_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_MISO_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_MISO_PORT_Msk (0xFUL << SPIS_PSEL_MISO_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define SPIS_PSEL_MISO_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_MISO_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_MISO_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_MISO_CONNECT_Msk (0x1UL << SPIS_PSEL_MISO_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SPIS_PSEL_MISO_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MISO_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MISO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define SPIS_PSEL_MISO_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* SPIS_PSEL_MOSI: Pin select for MOSI signal */
  #define SPIS_PSEL_MOSI_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MOSI register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_MOSI_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_MOSI_PIN_Msk (0x1FUL << SPIS_PSEL_MOSI_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define SPIS_PSEL_MOSI_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_MOSI_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_MOSI_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_MOSI_PORT_Msk (0xFUL << SPIS_PSEL_MOSI_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define SPIS_PSEL_MOSI_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_MOSI_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_MOSI_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_MOSI_CONNECT_Msk (0x1UL << SPIS_PSEL_MOSI_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SPIS_PSEL_MOSI_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MOSI_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MOSI_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define SPIS_PSEL_MOSI_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


