tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIS_PSEL_CSN: Pin select for CSN signal */
  #define SPIS_PSEL_CSN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of CSN register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_CSN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_CSN_PIN_Msk (0x1FUL << SPIS_PSEL_CSN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIS_PSEL_CSN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_CSN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_CSN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_CSN_PORT_Msk (0xFUL << SPIS_PSEL_CSN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIS_PSEL_CSN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_CSN_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_CSN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_CSN_CONNECT_Msk (0x1UL << SPIS_PSEL_CSN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIS_PSEL_CSN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_CSN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_CSN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIS_PSEL_CSN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ===================================================== Struct SPIS_RXD ===================================================== */
/**
  * @brief RXD [SPIS_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) RXD data pointer                                      */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes received in last granted transaction  */
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_SPIS_RXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* SPIS_RXD_PTR: RXD data pointer */
  #define SPIS_RXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RXD data pointer */
  #define SPIS_RXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define SPIS_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << SPIS_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* SPIS_RXD_MAXCNT: Maximum number of bytes in receive buffer */
  #define SPIS_RXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in receive buffer */
  #define SPIS_RXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define SPIS_RXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << SPIS_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define SPIS_RXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define SPIS_RXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


/* SPIS_RXD_AMOUNT: Number of bytes received in last granted transaction */
  #define SPIS_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes received in the last granted transaction */
  #define SPIS_RXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define SPIS_RXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << SPIS_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define SPIS_RXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define SPIS_RXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* SPIS_RXD_LIST: EasyDMA list type */
  #define SPIS_RXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..1 : List type */
  #define SPIS_RXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define SPIS_RXD_LIST_LIST_Msk (0x3UL << SPIS_RXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define SPIS_RXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define SPIS_RXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define SPIS_RXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define SPIS_RXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



/* ===================================================== Struct SPIS_TXD ===================================================== */
/**
  * @brief TXD [SPIS_TXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) TXD data pointer                                      */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transmitted in last granted
                                                                         transaction*/
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_SPIS_TXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* SPIS_TXD_PTR: TXD data pointer */
  #define SPIS_TXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : TXD data pointer */
  #define SPIS_TXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define SPIS_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << SPIS_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* SPIS_TXD_MAXCNT: Maximum number of bytes in transmit buffer */
  #define SPIS_TXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

