tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ======================================================= Struct SPIS ======================================================= */
/**
  * @brief SPI Slave
  */
  typedef struct {                                   /*!< SPIS Structure                                                       */
    __IM uint32_t RESERVED[9];
    __OM uint32_t TASKS_ACQUIRE;                     /*!< (@ 0x00000024) Acquire SPI semaphore                                 */
    __OM uint32_t TASKS_RELEASE;                     /*!< (@ 0x00000028) Release SPI semaphore, enabling the SPI slave to
                                                                         acquire it*/
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t SUBSCRIBE_ACQUIRE;                /*!< (@ 0x000000A4) Subscribe configuration for task ACQUIRE              */
    __IOM uint32_t SUBSCRIBE_RELEASE;                /*!< (@ 0x000000A8) Subscribe configuration for task RELEASE              */
    __IM uint32_t RESERVED2[22];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000104) Granted transaction completed                         */
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t EVENTS_ENDRX;                     /*!< (@ 0x00000110) End of RXD buffer reached                             */
    __IM uint32_t RESERVED4[5];
    __IOM uint32_t EVENTS_ACQUIRED;                  /*!< (@ 0x00000128) Semaphore acquired                                    */
    __IM uint32_t RESERVED5[18];
    __IOM uint32_t EVENTS_RXBUSERROR;                /*!< (@ 0x00000174) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IOM uint32_t EVENTS_TXBUSERROR;                /*!< (@ 0x00000178) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000184) Publish configuration for event END                   */
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t PUBLISH_ENDRX;                    /*!< (@ 0x00000190) Publish configuration for event ENDRX                 */
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t PUBLISH_ACQUIRED;                 /*!< (@ 0x000001A8) Publish configuration for event ACQUIRED              */
    __IM uint32_t RESERVED9[18];
    __IOM uint32_t PUBLISH_RXBUSERROR;               /*!< (@ 0x000001F4) Publish configuration for event RXBUSERROR            */
    __IOM uint32_t PUBLISH_TXBUSERROR;               /*!< (@ 0x000001F8) Publish configuration for event TXBUSERROR            */
    __IM uint32_t RESERVED10;
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED11[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED12[61];
    __IM uint32_t SEMSTAT;                           /*!< (@ 0x00000400) Semaphore status register                             */
    __IM uint32_t RESERVED13[15];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000440) Status from last transaction                          */
    __IM uint32_t RESERVED14[47];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable SPI slave                                      */
    __IM uint32_t RESERVED15;
    __IOM NRF_SPIS_PSEL_Type PSEL;                   /*!< (@ 0x00000508) (unspecified)                                         */
    __IM uint32_t RESERVED16[7];
    __IOM NRF_SPIS_RXD_Type RXD;                     /*!< (@ 0x00000534) (unspecified)                                         */
    __IOM NRF_SPIS_TXD_Type TXD;                     /*!< (@ 0x00000544) (unspecified)                                         */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000554) Configuration register                                */
    __IM uint32_t RESERVED17;
    __IOM uint32_t DEF;                              /*!< (@ 0x0000055C) Default character. Character clocked out in case of an
                                                                         ignored transaction.*/
    __IM uint32_t RESERVED18[20];
    __IOM NRF_SPIS_DMA_Type DMA;                     /*!< (@ 0x000005B0) (unspecified)                                         */
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Over-read character                                   */
  } NRF_SPIS_Type;                                   /*!< Size = 1476 (0x5C4)                                                  */

/* SPIS_TASKS_ACQUIRE: Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQUIRE register.                             */

/* TASKS_ACQUIRE @Bit 0 : Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos (0UL) /*!< Position of TASKS_ACQUIRE field.                                     */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Msk (0x1UL << SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos) /*!< Bit mask of TASKS_ACQUIRE
                                                                            field.*/
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQUIRE field.                       */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQUIRE field.                       */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* SPIS_TASKS_RELEASE: Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RELEASE register.                             */

/* TASKS_RELEASE @Bit 0 : Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos (0UL) /*!< Position of TASKS_RELEASE field.                                     */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Msk (0x1UL << SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos) /*!< Bit mask of TASKS_RELEASE
                                                                            field.*/
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Min (0x1UL) /*!< Min enumerator value of TASKS_RELEASE field.                       */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Max (0x1UL) /*!< Max enumerator value of TASKS_RELEASE field.                       */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* SPIS_SUBSCRIBE_ACQUIRE: Subscribe configuration for task ACQUIRE */
  #define SPIS_SUBSCRIBE_ACQUIRE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACQUIRE register.                     */

