tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task ACQUIRE will subscribe to */
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Msk (0xFFUL << SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Msk (0x1UL << SPIS_SUBSCRIBE_ACQUIRE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* SPIS_SUBSCRIBE_RELEASE: Subscribe configuration for task RELEASE */
  #define SPIS_SUBSCRIBE_RELEASE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RELEASE register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task RELEASE will subscribe to */
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Msk (0xFFUL << SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Msk (0x1UL << SPIS_SUBSCRIBE_RELEASE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* SPIS_EVENTS_END: Granted transaction completed */
  #define SPIS_EVENTS_END_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_END register.                                  */

/* EVENTS_END @Bit 0 : Granted transaction completed */
  #define SPIS_EVENTS_END_EVENTS_END_Pos (0UL)       /*!< Position of EVENTS_END field.                                        */
  #define SPIS_EVENTS_END_EVENTS_END_Msk (0x1UL << SPIS_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field.          */
  #define SPIS_EVENTS_END_EVENTS_END_Min (0x0UL)     /*!< Min enumerator value of EVENTS_END field.                            */
  #define SPIS_EVENTS_END_EVENTS_END_Max (0x1UL)     /*!< Max enumerator value of EVENTS_END field.                            */
  #define SPIS_EVENTS_END_EVENTS_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define SPIS_EVENTS_END_EVENTS_END_Generated (0x1UL) /*!< Event generated                                                    */


/* SPIS_EVENTS_ENDRX: End of RXD buffer reached */
  #define SPIS_EVENTS_ENDRX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDRX register.                               */

/* EVENTS_ENDRX @Bit 0 : End of RXD buffer reached */
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos (0UL)   /*!< Position of EVENTS_ENDRX field.                                      */
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Msk (0x1UL << SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos) /*!< Bit mask of EVENTS_ENDRX field.*/
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDRX field.                          */
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDRX field.                          */
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Generated (0x1UL) /*!< Event generated                                                */


/* SPIS_EVENTS_ACQUIRED: Semaphore acquired */
  #define SPIS_EVENTS_ACQUIRED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ACQUIRED register.                         */

/* EVENTS_ACQUIRED @Bit 0 : Semaphore acquired */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos (0UL) /*!< Position of EVENTS_ACQUIRED field.                               */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Msk (0x1UL << SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos) /*!< Bit mask of
                                                                            EVENTS_ACQUIRED field.*/
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACQUIRED field.                 */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACQUIRED field.                 */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Generated (0x1UL) /*!< Event generated                                          */


/* SPIS_EVENTS_RXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define SPIS_EVENTS_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXBUSERROR register.                     */

/* EVENTS_RXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos (0UL) /*!< Position of EVENTS_RXBUSERROR field.                         */
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Msk (0x1UL << SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_RXBUSERROR field.*/
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXBUSERROR field.           */
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXBUSERROR field.           */
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define SPIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* SPIS_EVENTS_TXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define SPIS_EVENTS_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXBUSERROR register.                     */

/* EVENTS_TXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos (0UL) /*!< Position of EVENTS_TXBUSERROR field.                         */
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Msk (0x1UL << SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TXBUSERROR field.*/
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXBUSERROR field.           */
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXBUSERROR field.           */
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define SPIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* SPIS_PUBLISH_END: Publish configuration for event END */
  #define SPIS_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                 */

