tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIS_PUBLISH_TXBUSERROR: Publish configuration for event TXBUSERROR */
  #define SPIS_PUBLISH_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXBUSERROR will publish to */
  #define SPIS_PUBLISH_TXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SPIS_PUBLISH_TXBUSERROR_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_TXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SPIS_PUBLISH_TXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SPIS_PUBLISH_TXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Msk (0x1UL << SPIS_PUBLISH_TXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define SPIS_PUBLISH_TXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* SPIS_SHORTS: Shortcuts between local events and tasks */
  #define SPIS_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* END_ACQUIRE @Bit 2 : Shortcut between event END and task ACQUIRE */
  #define SPIS_SHORTS_END_ACQUIRE_Pos (2UL)          /*!< Position of END_ACQUIRE field.                                       */
  #define SPIS_SHORTS_END_ACQUIRE_Msk (0x1UL << SPIS_SHORTS_END_ACQUIRE_Pos) /*!< Bit mask of END_ACQUIRE field.               */
  #define SPIS_SHORTS_END_ACQUIRE_Min (0x0UL)        /*!< Min enumerator value of END_ACQUIRE field.                           */
  #define SPIS_SHORTS_END_ACQUIRE_Max (0x1UL)        /*!< Max enumerator value of END_ACQUIRE field.                           */
  #define SPIS_SHORTS_END_ACQUIRE_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define SPIS_SHORTS_END_ACQUIRE_Enabled (0x1UL)    /*!< Enable shortcut                                                      */


/* SPIS_INTENSET: Enable interrupt */
  #define SPIS_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* END @Bit 1 : Write '1' to enable interrupt for event END */
  #define SPIS_INTENSET_END_Pos (1UL)                /*!< Position of END field.                                               */
  #define SPIS_INTENSET_END_Msk (0x1UL << SPIS_INTENSET_END_Pos) /*!< Bit mask of END field.                                   */
  #define SPIS_INTENSET_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SPIS_INTENSET_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SPIS_INTENSET_END_Set (0x1UL)              /*!< Enable                                                               */
  #define SPIS_INTENSET_END_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define SPIS_INTENSET_END_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to enable interrupt for event ENDRX */
  #define SPIS_INTENSET_ENDRX_Pos (4UL)              /*!< Position of ENDRX field.                                             */
  #define SPIS_INTENSET_ENDRX_Msk (0x1UL << SPIS_INTENSET_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define SPIS_INTENSET_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define SPIS_INTENSET_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define SPIS_INTENSET_ENDRX_Set (0x1UL)            /*!< Enable                                                               */
  #define SPIS_INTENSET_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIS_INTENSET_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ACQUIRED @Bit 10 : Write '1' to enable interrupt for event ACQUIRED */
  #define SPIS_INTENSET_ACQUIRED_Pos (10UL)          /*!< Position of ACQUIRED field.                                          */
  #define SPIS_INTENSET_ACQUIRED_Msk (0x1UL << SPIS_INTENSET_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                    */
  #define SPIS_INTENSET_ACQUIRED_Min (0x0UL)         /*!< Min enumerator value of ACQUIRED field.                              */
  #define SPIS_INTENSET_ACQUIRED_Max (0x1UL)         /*!< Max enumerator value of ACQUIRED field.                              */
  #define SPIS_INTENSET_ACQUIRED_Set (0x1UL)         /*!< Enable                                                               */
  #define SPIS_INTENSET_ACQUIRED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SPIS_INTENSET_ACQUIRED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to enable interrupt for event RXBUSERROR */
  #define SPIS_INTENSET_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define SPIS_INTENSET_RXBUSERROR_Msk (0x1UL << SPIS_INTENSET_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define SPIS_INTENSET_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define SPIS_INTENSET_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define SPIS_INTENSET_RXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define SPIS_INTENSET_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIS_INTENSET_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to enable interrupt for event TXBUSERROR */
  #define SPIS_INTENSET_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define SPIS_INTENSET_TXBUSERROR_Msk (0x1UL << SPIS_INTENSET_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define SPIS_INTENSET_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define SPIS_INTENSET_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define SPIS_INTENSET_TXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define SPIS_INTENSET_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIS_INTENSET_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


