tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SPIS_INTENCLR: Disable interrupt */
  #define SPIS_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 1 : Write '1' to disable interrupt for event END */
  #define SPIS_INTENCLR_END_Pos (1UL)                /*!< Position of END field.                                               */
  #define SPIS_INTENCLR_END_Msk (0x1UL << SPIS_INTENCLR_END_Pos) /*!< Bit mask of END field.                                   */
  #define SPIS_INTENCLR_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SPIS_INTENCLR_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SPIS_INTENCLR_END_Clear (0x1UL)            /*!< Disable                                                              */
  #define SPIS_INTENCLR_END_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define SPIS_INTENCLR_END_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to disable interrupt for event ENDRX */
  #define SPIS_INTENCLR_ENDRX_Pos (4UL)              /*!< Position of ENDRX field.                                             */
  #define SPIS_INTENCLR_ENDRX_Msk (0x1UL << SPIS_INTENCLR_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define SPIS_INTENCLR_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define SPIS_INTENCLR_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define SPIS_INTENCLR_ENDRX_Clear (0x1UL)          /*!< Disable                                                              */
  #define SPIS_INTENCLR_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SPIS_INTENCLR_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ACQUIRED @Bit 10 : Write '1' to disable interrupt for event ACQUIRED */
  #define SPIS_INTENCLR_ACQUIRED_Pos (10UL)          /*!< Position of ACQUIRED field.                                          */
  #define SPIS_INTENCLR_ACQUIRED_Msk (0x1UL << SPIS_INTENCLR_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                    */
  #define SPIS_INTENCLR_ACQUIRED_Min (0x0UL)         /*!< Min enumerator value of ACQUIRED field.                              */
  #define SPIS_INTENCLR_ACQUIRED_Max (0x1UL)         /*!< Max enumerator value of ACQUIRED field.                              */
  #define SPIS_INTENCLR_ACQUIRED_Clear (0x1UL)       /*!< Disable                                                              */
  #define SPIS_INTENCLR_ACQUIRED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SPIS_INTENCLR_ACQUIRED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to disable interrupt for event RXBUSERROR */
  #define SPIS_INTENCLR_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define SPIS_INTENCLR_RXBUSERROR_Msk (0x1UL << SPIS_INTENCLR_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define SPIS_INTENCLR_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define SPIS_INTENCLR_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define SPIS_INTENCLR_RXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIS_INTENCLR_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIS_INTENCLR_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to disable interrupt for event TXBUSERROR */
  #define SPIS_INTENCLR_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define SPIS_INTENCLR_TXBUSERROR_Msk (0x1UL << SPIS_INTENCLR_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define SPIS_INTENCLR_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define SPIS_INTENCLR_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define SPIS_INTENCLR_TXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIS_INTENCLR_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIS_INTENCLR_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* SPIS_SEMSTAT: Semaphore status register */
  #define SPIS_SEMSTAT_ResetValue (0x00000001UL)     /*!< Reset value of SEMSTAT register.                                     */

/* SEMSTAT @Bits 0..1 : Semaphore status */
  #define SPIS_SEMSTAT_SEMSTAT_Pos (0UL)             /*!< Position of SEMSTAT field.                                           */
  #define SPIS_SEMSTAT_SEMSTAT_Msk (0x3UL << SPIS_SEMSTAT_SEMSTAT_Pos) /*!< Bit mask of SEMSTAT field.                         */
  #define SPIS_SEMSTAT_SEMSTAT_Min (0x0UL)           /*!< Min enumerator value of SEMSTAT field.                               */
  #define SPIS_SEMSTAT_SEMSTAT_Max (0x3UL)           /*!< Max enumerator value of SEMSTAT field.                               */
  #define SPIS_SEMSTAT_SEMSTAT_Free (0x0UL)          /*!< Semaphore is free                                                    */
  #define SPIS_SEMSTAT_SEMSTAT_CPU (0x1UL)           /*!< Semaphore is assigned to CPU                                         */
  #define SPIS_SEMSTAT_SEMSTAT_SPIS (0x2UL)          /*!< Semaphore is assigned to SPI slave                                   */
  #define SPIS_SEMSTAT_SEMSTAT_CPUPending (0x3UL)    /*!< Semaphore is assigned to SPI but a handover to the CPU is pending    */


/* SPIS_STATUS: Status from last transaction */
  #define SPIS_STATUS_ResetValue (0x00000000UL)      /*!< Reset value of STATUS register.                                      */

/* OVERREAD @Bit 0 : TX buffer over-read detected, and prevented */
  #define SPIS_STATUS_OVERREAD_Pos (0UL)             /*!< Position of OVERREAD field.                                          */
  #define SPIS_STATUS_OVERREAD_Msk (0x1UL << SPIS_STATUS_OVERREAD_Pos) /*!< Bit mask of OVERREAD field.                        */
  #define SPIS_STATUS_OVERREAD_Min (0x0UL)           /*!< Min enumerator value of OVERREAD field.                              */
  #define SPIS_STATUS_OVERREAD_Max (0x1UL)           /*!< Max enumerator value of OVERREAD field.                              */
  #define SPIS_STATUS_OVERREAD_NotPresent (0x0UL)    /*!< Read: error not present                                              */
  #define SPIS_STATUS_OVERREAD_Present (0x1UL)       /*!< Read: error present                                                  */
  #define SPIS_STATUS_OVERREAD_Clear (0x1UL)         /*!< Write: clear error on writing '1'                                    */

/* OVERFLOW @Bit 1 : RX buffer overflow detected, and prevented */
  #define SPIS_STATUS_OVERFLOW_Pos (1UL)             /*!< Position of OVERFLOW field.                                          */
  #define SPIS_STATUS_OVERFLOW_Msk (0x1UL << SPIS_STATUS_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                        */
  #define SPIS_STATUS_OVERFLOW_Min (0x0UL)           /*!< Min enumerator value of OVERFLOW field.                              */
  #define SPIS_STATUS_OVERFLOW_Max (0x1UL)           /*!< Max enumerator value of OVERFLOW field.                              */
  #define SPIS_STATUS_OVERFLOW_NotPresent (0x0UL)    /*!< Read: error not present                                              */
  #define SPIS_STATUS_OVERFLOW_Present (0x1UL)       /*!< Read: error present                                                  */
  #define SPIS_STATUS_OVERFLOW_Clear (0x1UL)         /*!< Write: clear error on writing '1'                                    */


/* SPIS_ENABLE: Enable SPI slave */
  #define SPIS_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable SPI slave */
  #define SPIS_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define SPIS_ENABLE_ENABLE_Msk (0xFUL << SPIS_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define SPIS_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define SPIS_ENABLE_ENABLE_Max (0x2UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define SPIS_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable SPI slave                                                    */
  #define SPIS_ENABLE_ENABLE_Enabled (0x2UL)         /*!< Enable SPI slave                                                     */


