tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Pos (16UL)    /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIO_PIN_OWNERID_Pos) /*!< Bit mask of OWNERID field.         */
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Min (0x0UL)   /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Max (0xFUL)   /*!< Max size of OWNERID field.                                           */



/* ================================================= Struct SPU_FEATURE_GRTC ================================================= */
/**
  * @brief GRTC [SPU_FEATURE_GRTC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CC[16];                            /*!< (@ 0x00000000) Configuration of features for CC n of GRTC            */
  __IM  uint32_t  RESERVED[15];
  __IOM uint32_t  SYSCOUNTER;                        /*!< (@ 0x0000007C) Configuration of features for SYSCOUNTERL/SYSCOUNTERH
                                                                         of GRTC*/
  __IOM uint32_t  INTERRUPT[7];                      /*!< (@ 0x00000080) Configuration of features for interrupt n of GRTC     */
} NRF_SPU_FEATURE_GRTC_Type;                         /*!< Size = 156 (0x09C)                                                   */

/* SPU_FEATURE_GRTC_CC: Configuration of features for CC n of GRTC */
  #define SPU_FEATURE_GRTC_CC_MaxCount (16UL)        /*!< Max size of CC[16] array.                                            */
  #define SPU_FEATURE_GRTC_CC_MaxIndex (15UL)        /*!< Max index of CC[16] array.                                           */
  #define SPU_FEATURE_GRTC_CC_MinIndex (0UL)         /*!< Min index of CC[16] array.                                           */
  #define SPU_FEATURE_GRTC_CC_ResetValue (0x00000000UL) /*!< Reset value of CC[16] register.                                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Pos (4UL)      /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CC_SECATTR_Pos) /*!< Bit mask of SECATTR field.           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Min (0x0UL)    /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Max (0x1UL)    /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                         */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                 */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CC_LOCK_Pos (8UL)         /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_CC_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CC_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define SPU_FEATURE_GRTC_CC_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Unlocked (0x0UL)  /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GRTC_CC_LOCK_Locked (0x1UL)    /*!< Feature permissions can not be changed until the next reset          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_CC_OWNERID_Pos (16UL)     /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURE_GRTC_CC_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_CC_OWNERID_Pos) /*!< Bit mask of OWNERID field.           */
  #define SPU_FEATURE_GRTC_CC_OWNERID_Min (0x0UL)    /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURE_GRTC_CC_OWNERID_Max (0xFUL)    /*!< Max size of OWNERID field.                                           */


/* SPU_FEATURE_GRTC_SYSCOUNTER: Configuration of features for SYSCOUNTERL/SYSCOUNTERH of GRTC */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTER register.                       */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                        */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                          */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                 */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                         */

