tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos (8UL) /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos) /*!< Bit mask of LOCK field.    */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                            */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset     */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                       */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                     */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                      */


/* SPU_FEATURE_GRTC_INTERRUPT: Configuration of features for interrupt n of GRTC */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxCount (7UL)  /*!< Max size of INTERRUPT[7] array.                                      */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxIndex (6UL)  /*!< Max index of INTERRUPT[7] array.                                     */
  #define SPU_FEATURE_GRTC_INTERRUPT_MinIndex (0UL)  /*!< Min index of INTERRUPT[7] array.                                     */
  #define SPU_FEATURE_GRTC_INTERRUPT_ResetValue (0x00000000UL) /*!< Reset value of INTERRUPT[7] register.                      */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                                        */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                                      */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                                       */



/* ============================================= Struct SPU_FEATURE_BELLS_DOMAIN ============================================= */
/**
  * @brief DOMAIN [SPU_FEATURE_BELLS_DOMAIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BELL[16];                          /*!< (@ 0x00000000) Configuration of features for bell pair [(o * 2) + 1:o
                                                                         * 2] of domain n*/
} NRF_SPU_FEATURE_BELLS_DOMAIN_Type;                 /*!< Size = 64 (0x040)                                                    */
  #define SPU_FEATURE_BELLS_DOMAIN_MaxCount (16UL)   /*!< Size of DOMAIN[16] array.                                            */
  #define SPU_FEATURE_BELLS_DOMAIN_MaxIndex (15UL)   /*!< Max index of DOMAIN[16] array.                                       */
  #define SPU_FEATURE_BELLS_DOMAIN_MinIndex (0UL)    /*!< Min index of DOMAIN[16] array.                                       */

/* SPU_FEATURE_BELLS_DOMAIN_BELL: Configuration of features for bell pair [(o * 2) + 1:o * 2] of domain n */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_MaxCount (16UL) /*!< Max size of BELL[16] array.                                       */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_MaxIndex (15UL) /*!< Max index of BELL[16] array.                                      */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_MinIndex (0UL) /*!< Min index of BELL[16] array.                                       */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_ResetValue (0x00000000UL) /*!< Reset value of BELL[16] register.                       */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                      */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Msk (0x1UL << SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Pos) /*!< Bit mask of
                                                                            SECATTR field.*/
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                        */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                        */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage               */
  #define SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                       */

