tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* STM_HEMASTR: Indicates the STPv2 master number of hardware event trace. This number is the master number presented in STPv2.
                 */

  #define STM_HEMASTR_ResetValue (0x00000000UL)      /*!< Reset value of HEMASTR register.                                     */

/* MASTER @Bits 0..16 : The STPv2 master number that hardware event traces should be associated with. */
  #define STM_HEMASTR_MASTER_Pos (0UL)               /*!< Position of MASTER field.                                            */
  #define STM_HEMASTR_MASTER_Msk (0x1FFFFUL << STM_HEMASTR_MASTER_Pos) /*!< Bit mask of MASTER field.                          */
  #define STM_HEMASTR_MASTER_Min (0x00000UL)         /*!< Min value of MASTER field.                                           */
  #define STM_HEMASTR_MASTER_Max (0x0FFFFUL)         /*!< Max size of MASTER field.                                            */


/* STM_HEFEAT1R: Indicates the features of the STM. */
  #define STM_HEFEAT1R_ResetValue (0x00000000UL)     /*!< Reset value of HEFEAT1R register.                                    */

/* HETER @Bit 0 : STMHETER support */
  #define STM_HEFEAT1R_HETER_Pos (0UL)               /*!< Position of HETER field.                                             */
  #define STM_HEFEAT1R_HETER_Msk (0x1UL << STM_HEFEAT1R_HETER_Pos) /*!< Bit mask of HETER field.                               */
  #define STM_HEFEAT1R_HETER_Min (0x0UL)             /*!< Min enumerator value of HETER field.                                 */
  #define STM_HEFEAT1R_HETER_Max (0x1UL)             /*!< Max enumerator value of HETER field.                                 */
  #define STM_HEFEAT1R_HETER_NotImplemented (0x0UL)  /*!< The feature is not implemented.                                      */
  #define STM_HEFEAT1R_HETER_Implemented (0x1UL)     /*!< The feature is implemented.                                          */

/* HEERR @Bit 2 : Hardware event error detection support */
  #define STM_HEFEAT1R_HEERR_Pos (2UL)               /*!< Position of HEERR field.                                             */
  #define STM_HEFEAT1R_HEERR_Msk (0x1UL << STM_HEFEAT1R_HEERR_Pos) /*!< Bit mask of HEERR field.                               */
  #define STM_HEFEAT1R_HEERR_Min (0x0UL)             /*!< Min enumerator value of HEERR field.                                 */
  #define STM_HEFEAT1R_HEERR_Max (0x1UL)             /*!< Max enumerator value of HEERR field.                                 */
  #define STM_HEFEAT1R_HEERR_NotImplemented (0x0UL)  /*!< The feature is not implemented.                                      */
  #define STM_HEFEAT1R_HEERR_Implemented (0x1UL)     /*!< The feature is implemented.                                          */

/* HEMASTR @Bit 3 : STMHEMASTR support */
  #define STM_HEFEAT1R_HEMASTR_Pos (3UL)             /*!< Position of HEMASTR field.                                           */
  #define STM_HEFEAT1R_HEMASTR_Msk (0x1UL << STM_HEFEAT1R_HEMASTR_Pos) /*!< Bit mask of HEMASTR field.                         */
  #define STM_HEFEAT1R_HEMASTR_Min (0x0UL)           /*!< Min enumerator value of HEMASTR field.                               */
  #define STM_HEFEAT1R_HEMASTR_Max (0x1UL)           /*!< Max enumerator value of HEMASTR field.                               */
  #define STM_HEFEAT1R_HEMASTR_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define STM_HEFEAT1R_HEMASTR_Implemented (0x1UL)   /*!< The feature is implemented.                                          */

/* NUMHE @Bits 15..23 : The number of hardware events supported by the STM */
  #define STM_HEFEAT1R_NUMHE_Pos (15UL)              /*!< Position of NUMHE field.                                             */
  #define STM_HEFEAT1R_NUMHE_Msk (0x1FFUL << STM_HEFEAT1R_NUMHE_Pos) /*!< Bit mask of NUMHE field.                             */
  #define STM_HEFEAT1R_NUMHE_Min (0x000UL)           /*!< Min value of NUMHE field.                                            */
  #define STM_HEFEAT1R_NUMHE_Max (0x0FFUL)           /*!< Max size of NUMHE field.                                             */


/* STM_HEIDR: Indicates the features of hardware event tracing in the STM. */
  #define STM_HEIDR_ResetValue (0x00000000UL)        /*!< Reset value of HEIDR register.                                       */

/* CLASS @Bits 0..3 : The CLASS field identifies the programmers model */
  #define STM_HEIDR_CLASS_Pos (0UL)                  /*!< Position of CLASS field.                                             */
  #define STM_HEIDR_CLASS_Msk (0xFUL << STM_HEIDR_CLASS_Pos) /*!< Bit mask of CLASS field.                                     */
  #define STM_HEIDR_CLASS_Min (0x1UL)                /*!< Min enumerator value of CLASS field.                                 */
  #define STM_HEIDR_CLASS_Max (0x1UL)                /*!< Max enumerator value of CLASS field.                                 */
  #define STM_HEIDR_CLASS_HardwareEventControl (0x1UL) /*!< Hardware Event Control programmers model                           */

/* CLASSREV @Bits 4..7 : The CLASSREV field identifies the revision of the programmers model */
  #define STM_HEIDR_CLASSREV_Pos (4UL)               /*!< Position of CLASSREV field.                                          */
  #define STM_HEIDR_CLASSREV_Msk (0xFUL << STM_HEIDR_CLASSREV_Pos) /*!< Bit mask of CLASSREV field.                            */

/* VENDSPEC @Bits 8..11 : The VENDSPEC field identifies any vendor specific modifications or mappings */
  #define STM_HEIDR_VENDSPEC_Pos (8UL)               /*!< Position of VENDSPEC field.                                          */
  #define STM_HEIDR_VENDSPEC_Msk (0xFUL << STM_HEIDR_VENDSPEC_Pos) /*!< Bit mask of VENDSPEC field.                            */


/* STM_TCSR: Controls the STM settings. */
  #define STM_TCSR_ResetValue (0x00000000UL)         /*!< Reset value of TCSR register.                                        */

/* EN @Bit 0 : Global STM enable */
  #define STM_TCSR_EN_Pos (0UL)                      /*!< Position of EN field.                                                */
  #define STM_TCSR_EN_Msk (0x1UL << STM_TCSR_EN_Pos) /*!< Bit mask of EN field.                                                */
  #define STM_TCSR_EN_Min (0x0UL)                    /*!< Min enumerator value of EN field.                                    */
  #define STM_TCSR_EN_Max (0x1UL)                    /*!< Max enumerator value of EN field.                                    */
  #define STM_TCSR_EN_Disabled (0x0UL)               /*!< The STM is disabled.                                                 */
  #define STM_TCSR_EN_Enabled (0x1UL)                /*!< The STM is enabled.                                                  */

