tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_NSNID_Pos (2UL)             /*!< Position of NSNID field.                                             */
  #define STM_AUTHSTATUS_NSNID_Msk (0x3UL << STM_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                           */
  #define STM_AUTHSTATUS_NSNID_Min (0x0UL)           /*!< Min enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_Max (0x1UL)           /*!< Max enumerator value of NSNID field.                                 */
  #define STM_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define STM_AUTHSTATUS_NSNID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define STM_AUTHSTATUS_SID_Pos (4UL)               /*!< Position of SID field.                                               */
  #define STM_AUTHSTATUS_SID_Msk (0x3UL << STM_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                                 */
  #define STM_AUTHSTATUS_SID_Min (0x0UL)             /*!< Min enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_Max (0x1UL)             /*!< Max enumerator value of SID field.                                   */
  #define STM_AUTHSTATUS_SID_NotImplemented (0x0UL)  /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SID_Implemented (0x1UL)     /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_SNID_Pos (6UL)              /*!< Position of SNID field.                                              */
  #define STM_AUTHSTATUS_SNID_Msk (0x3UL << STM_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                              */
  #define STM_AUTHSTATUS_SNID_Min (0x0UL)            /*!< Min enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_Max (0x1UL)            /*!< Max enumerator value of SNID field.                                  */
  #define STM_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_SNID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */


/* STM_DEVID: Indicates the capabilities of the STM. */
  #define STM_DEVID_ResetValue (0x00000000UL)        /*!< Reset value of DEVID register.                                       */

/* NUMSP @Bits 0..16 : This value indicates the number of stimulus ports implemented. */
  #define STM_DEVID_NUMSP_Pos (0UL)                  /*!< Position of NUMSP field.                                             */
  #define STM_DEVID_NUMSP_Msk (0x1FFFFUL << STM_DEVID_NUMSP_Pos) /*!< Bit mask of NUMSP field.                                 */
  #define STM_DEVID_NUMSP_Max (0x10000UL)            /*!< Maximum 65,536 stimulus ports can be implemented.                    */


/* STM_DEVTYPE: Controls the single-shot comparator. */
  #define STM_DEVTYPE_ResetValue (0x00000000UL)      /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define STM_DEVTYPE_MAJOR_Pos (0UL)                /*!< Position of MAJOR field.                                             */
  #define STM_DEVTYPE_MAJOR_Msk (0xFUL << STM_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Min (0x3UL)              /*!< Min enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_Max (0x3UL)              /*!< Max enumerator value of MAJOR field.                                 */
  #define STM_DEVTYPE_MAJOR_TraceSource (0x3UL)      /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define STM_DEVTYPE_SUB_Pos (4UL)                  /*!< Position of SUB field.                                               */
  #define STM_DEVTYPE_SUB_Msk (0xFUL << STM_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                       */
  #define STM_DEVTYPE_SUB_Min (0x6UL)                /*!< Min enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_Max (0x6UL)                /*!< Max enumerator value of SUB field.                                   */
  #define STM_DEVTYPE_SUB_StimulusTrace (0x6UL)      /*!< Peripheral is a stimulus trace source.                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          STMDATA                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct STMDATA_DOMAIN ================================================== */
/**
  * @brief DOMAIN [STMDATA_DOMAIN] (unspecified)
  */
typedef struct {
  __IOM uint8_t   NSDATA[16777216];                  /*!< (@ 0x00000000) NonSecure STM output data buffer for domain n. Writes
                                                                         to this region generates trace packets with id n+96.*/
  __IOM uint8_t   SDATA[16777216];                   /*!< (@ 0x01000000) Secure STM output data buffer for domain n. Writes to
                                                                         this region generates trace packets with id n+32.*/
} NRF_STMDATA_DOMAIN_Type;                           /*!< Size = 33554432 (0x2000000)                                          */
  #define STMDATA_DOMAIN_MaxCount (16UL)             /*!< Size of DOMAIN[16] array.                                            */
  #define STMDATA_DOMAIN_MaxIndex (15UL)             /*!< Max index of DOMAIN[16] array.                                       */
  #define STMDATA_DOMAIN_MinIndex (0UL)              /*!< Min index of DOMAIN[16] array.                                       */

/* ===================================================== Struct STMDATA ====================================================== */
/**
  * @brief System Trace Macrocell data buffer
  */
  typedef struct {                                   /*!< STMDATA Structure                                                    */
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_STMDATA_DOMAIN_Type DOMAIN[16];      /*!< (@ 0x00000000) (unspecified)                                         */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  } NRF_STMDATA_Type;                                /*!< Size = 536870912 (0x20000000)                                        */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TBM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TBM ======================================================== */
/**
  * @brief Trace buffer monitor
  */
  typedef struct {                                   /*!< TBM Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start counter                                         */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop counter, clear counter value                     */
    __OM uint32_t TASKS_FLUSH;                       /*!< (@ 0x00000008) Stop counter, keep current counter value              */
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_HALFFULL;                  /*!< (@ 0x00000100) Counter value equals half-full                        */
    __IOM uint32_t EVENTS_FULL;                      /*!< (@ 0x00000104) Counter value equals full                             */
    __IOM uint32_t EVENTS_FLUSH;                     /*!< (@ 0x00000108) Counter stopped due to flush                          */
    __IM uint32_t RESERVED1[61];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    __IOM uint32_t BUFFERSIZE;                       /*!< (@ 0x00000400) System RAM trace buffer total size in bytes           */
    __IM uint32_t COUNT;                             /*!< (@ 0x00000404) Counter current value                                 */
  } NRF_TBM_Type;                                    /*!< Size = 1032 (0x408)                                                  */

/* TBM_TASKS_START: Start counter */
  #define TBM_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

