tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TDDCONF_DBGPWRUPREQ: Debug power-up request */
  #define TDDCONF_DBGPWRUPREQ_ResetValue (0x00000000UL) /*!< Reset value of DBGPWRUPREQ register.                              */

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Msk (0x1UL << TDDCONF_DBGPWRUPREQ_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_NotActive (0x0UL) /*!< Power-up request not active                                        */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Active (0x1UL)  /*!< Power-up request active                                              */


/* TDDCONF_TRACEPORTSPEED: Trace port trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_ResetValue (0x00000000UL) /*!< Reset value of TRACEPORTSPEED register.                        */

/* SPEED @Bits 0..1 : Trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Pos (0UL)     /*!< Position of SPEED field.                                             */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Msk (0x3UL << TDDCONF_TRACEPORTSPEED_SPEED_Pos) /*!< Bit mask of SPEED field.           */


/* TDDCONF_DEBUGPOWERREQSTATUS: Combined effective system status of both SWJ-DP and TDDCONF registers originated power requests
                                 */

  #define TDDCONF_DEBUGPOWERREQSTATUS_ResetValue (0x00000000UL) /*!< Reset value of DEBUGPOWERREQSTATUS register.              */

/* SYSPWRUPREQUESTED @Bit 0 : System powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos (0UL) /*!< Position of SYSPWRUPREQUESTED field.                    */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of SYSPWRUPREQUESTED field.*/
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Min (0x0UL) /*!< Min enumerator value of SYSPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Max (0x1UL) /*!< Max enumerator value of SYSPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_NoPowerReq (0x0UL) /*!< Power not requested                            */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_PowerReq (0x1UL) /*!< Power requested                                  */

/* DBGPWRUPREQUESTED @Bit 1 : Debug domain powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos (1UL) /*!< Position of DBGPWRUPREQUESTED field.                    */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of DBGPWRUPREQUESTED field.*/
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Min (0x0UL) /*!< Min enumerator value of DBGPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Max (0x1UL) /*!< Max enumerator value of DBGPWRUPREQUESTED field.      */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_NoPowerReq (0x0UL) /*!< Power not requested                            */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_PowerReq (0x1UL) /*!< Power requested                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TEMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TEMP ======================================================= */
/**
  * @brief Temperature Sensor
  */
  typedef struct {                                   /*!< TEMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start temperature measurement                         */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop temperature measurement                          */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_DATARDY;                   /*!< (@ 0x00000100) Temperature measurement complete, data ready          */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_DATARDY;                  /*!< (@ 0x00000180) Publish configuration for event DATARDY               */
    __IM uint32_t RESERVED3[96];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[127];
    __IM int32_t  TEMP;                              /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                   */
    __IM uint32_t RESERVED5[5];
    __IOM uint32_t A0;                               /*!< (@ 0x00000520) Slope of 1st piece wise linear function               */
    __IOM uint32_t A1;                               /*!< (@ 0x00000524) Slope of 2nd piece wise linear function               */
    __IOM uint32_t A2;                               /*!< (@ 0x00000528) Slope of 3rd piece wise linear function               */
    __IOM uint32_t A3;                               /*!< (@ 0x0000052C) Slope of 4th piece wise linear function               */
    __IOM uint32_t A4;                               /*!< (@ 0x00000530) Slope of 5th piece wise linear function               */
    __IOM uint32_t A5;                               /*!< (@ 0x00000534) Slope of 6th piece wise linear function               */
    __IOM uint32_t A6;                               /*!< (@ 0x00000538) Slope of 7th piece wise linear function               */
    __IM uint32_t RESERVED6;
    __IOM uint32_t B0;                               /*!< (@ 0x00000540) y-intercept of 1st piece wise linear function         */
    __IOM uint32_t B1;                               /*!< (@ 0x00000544) y-intercept of 2nd piece wise linear function         */
    __IOM uint32_t B2;                               /*!< (@ 0x00000548) y-intercept of 3rd piece wise linear function         */
    __IOM uint32_t B3;                               /*!< (@ 0x0000054C) y-intercept of 4th piece wise linear function         */
    __IOM uint32_t B4;                               /*!< (@ 0x00000550) y-intercept of 5th piece wise linear function         */
    __IOM uint32_t B5;                               /*!< (@ 0x00000554) y-intercept of 6th piece wise linear function         */
    __IOM uint32_t B6;                               /*!< (@ 0x00000558) y-intercept of 7th piece wise linear function         */
    __IM uint32_t RESERVED7;
    __IOM uint32_t T0;                               /*!< (@ 0x00000560) End point of 1st piece wise linear function           */
    __IOM uint32_t T1;                               /*!< (@ 0x00000564) End point of 2nd piece wise linear function           */
    __IOM uint32_t T2;                               /*!< (@ 0x00000568) End point of 3rd piece wise linear function           */
    __IOM uint32_t T3;                               /*!< (@ 0x0000056C) End point of 4th piece wise linear function           */
    __IOM uint32_t T4;                               /*!< (@ 0x00000570) End point of 5th piece wise linear function           */
    __IOM uint32_t T5;                               /*!< (@ 0x00000574) End point of 6th piece wise linear function           */
  } NRF_TEMP_Type;                                   /*!< Size = 1400 (0x578)                                                  */

/* TEMP_TASKS_START: Start temperature measurement */
  #define TEMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start temperature measurement */
  #define TEMP_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define TEMP_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define TEMP_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


