tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PORT_SIZE_17 @Bit 16 : Indicates whether the TPIU supports port size of 17-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Pos (16UL) /*!< Position of PORT_SIZE_17 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_17 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_17 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_17 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_NotSupported (0x0UL) /*!< Port size 17 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Supported (0x1UL) /*!< Port size 17 is supported.                               */

/* PORT_SIZE_18 @Bit 17 : Indicates whether the TPIU supports port size of 18-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Pos (17UL) /*!< Position of PORT_SIZE_18 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_18 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_18 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_18 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_NotSupported (0x0UL) /*!< Port size 18 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Supported (0x1UL) /*!< Port size 18 is supported.                               */

/* PORT_SIZE_19 @Bit 18 : Indicates whether the TPIU supports port size of 19-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Pos (18UL) /*!< Position of PORT_SIZE_19 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_19 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_19 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_19 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_NotSupported (0x0UL) /*!< Port size 19 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Supported (0x1UL) /*!< Port size 19 is supported.                               */

/* PORT_SIZE_20 @Bit 19 : Indicates whether the TPIU supports port size of 20-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Pos (19UL) /*!< Position of PORT_SIZE_20 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_20 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_20 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_20 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_NotSupported (0x0UL) /*!< Port size 20 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Supported (0x1UL) /*!< Port size 20 is supported.                               */

/* PORT_SIZE_21 @Bit 20 : Indicates whether the TPIU supports port size of 21-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Pos (20UL) /*!< Position of PORT_SIZE_21 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_21 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_21 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_21 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_NotSupported (0x0UL) /*!< Port size 21 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Supported (0x1UL) /*!< Port size 21 is supported.                               */

/* PORT_SIZE_22 @Bit 21 : Indicates whether the TPIU supports port size of 22-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Pos (21UL) /*!< Position of PORT_SIZE_22 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_22 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_22 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_22 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_NotSupported (0x0UL) /*!< Port size 22 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Supported (0x1UL) /*!< Port size 22 is supported.                               */

/* PORT_SIZE_23 @Bit 22 : Indicates whether the TPIU supports port size of 23-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Pos (22UL) /*!< Position of PORT_SIZE_23 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_23 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_23 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_23 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_NotSupported (0x0UL) /*!< Port size 23 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Supported (0x1UL) /*!< Port size 23 is supported.                               */

/* PORT_SIZE_24 @Bit 23 : Indicates whether the TPIU supports port size of 24-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Pos (23UL) /*!< Position of PORT_SIZE_24 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_24 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_24 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_24 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_NotSupported (0x0UL) /*!< Port size 24 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Supported (0x1UL) /*!< Port size 24 is supported.                               */

/* PORT_SIZE_25 @Bit 24 : Indicates whether the TPIU supports port size of 25-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Pos (24UL) /*!< Position of PORT_SIZE_25 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_25 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_25 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_25 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_NotSupported (0x0UL) /*!< Port size 25 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Supported (0x1UL) /*!< Port size 25 is supported.                               */

/* PORT_SIZE_26 @Bit 25 : Indicates whether the TPIU supports port size of 26-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Pos (25UL) /*!< Position of PORT_SIZE_26 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_26 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_26 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_26 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_NotSupported (0x0UL) /*!< Port size 26 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Supported (0x1UL) /*!< Port size 26 is supported.                               */

