tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MULT3 @Bit 3 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Pos (3UL)     /*!< Position of MULT3 field.                                             */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT3_Pos) /*!< Bit mask of MULT3 field.           */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Min (0x0UL)   /*!< Min enumerator value of MULT3 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Max (0x1UL)   /*!< Max enumerator value of MULT3 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Disabled (0x0UL) /*!< Multiplier disabled.                                              */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Enabled (0x1UL) /*!< Multiplier enabled.                                                */

/* MULT4 @Bit 4 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Pos (4UL)     /*!< Position of MULT4 field.                                             */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT4_Pos) /*!< Bit mask of MULT4 field.           */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Min (0x0UL)   /*!< Min enumerator value of MULT4 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Max (0x1UL)   /*!< Max enumerator value of MULT4 field.                                 */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Disabled (0x0UL) /*!< Multiplier disabled.                                              */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Enabled (0x1UL) /*!< Multiplier enabled.                                                */


/* TPIU_SUPPPORTEDTESTPATTERNMODES: The Supported_test_pattern_modes register provides a set of known bit sequences or patterns
                                     that can be output over the trace port and can be detected by the TPA or other associated
                                     trace capture device. */

  #define TPIU_SUPPPORTEDTESTPATTERNMODES_ResetValue (0x00000000UL) /*!< Reset value of SUPPPORTEDTESTPATTERNMODES register.   */

/* PATW1 @Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos (0UL) /*!< Position of PATW1 field.                                        */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Min (0x0UL) /*!< Min enumerator value of PATW1 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Max (0x1UL) /*!< Max enumerator value of PATW1 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_NotSupported (0x0UL) /*!< Test pattern is not supported.                       */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Supported (0x1UL) /*!< Test pattern is supported.                              */

/* PATW0 @Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos (1UL) /*!< Position of PATW0 field.                                        */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Min (0x0UL) /*!< Min enumerator value of PATW0 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Max (0x1UL) /*!< Max enumerator value of PATW0 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_NotSupported (0x0UL) /*!< Test pattern is not supported.                       */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Supported (0x1UL) /*!< Test pattern is supported.                              */

/* PATA5 @Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos (2UL) /*!< Position of PATA5 field.                                        */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Min (0x0UL) /*!< Min enumerator value of PATA5 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Max (0x1UL) /*!< Max enumerator value of PATA5 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_NotSupported (0x0UL) /*!< Test pattern is not supported.                       */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Supported (0x1UL) /*!< Test pattern is supported.                              */

/* PATF0 @Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos (3UL) /*!< Position of PATF0 field.                                        */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Min (0x0UL) /*!< Min enumerator value of PATF0 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Max (0x1UL) /*!< Max enumerator value of PATF0 field.                          */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_NotSupported (0x0UL) /*!< Test pattern is not supported.                       */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Supported (0x1UL) /*!< Test pattern is supported.                              */

/* PTIMEEN @Bit 16 : Indicates whether timed mode is supported. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos (16UL) /*!< Position of PTIMEEN field.                                   */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of
                                                                            PTIMEEN field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Min (0x0UL) /*!< Min enumerator value of PTIMEEN field.                      */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Max (0x1UL) /*!< Max enumerator value of PTIMEEN field.                      */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_NotSupported (0x0UL) /*!< Mode is not supported.                             */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Supported (0x1UL) /*!< Mode is supported.                                    */

