tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define TPIU_ITATBCTR0_ResetValue (0x00000000UL)   /*!< Reset value of ITATBCTR0 register.                                   */

/* ATVALID @Bit 0 : Reads the value of atvalids. */
  #define TPIU_ITATBCTR0_ATVALID_Pos (0UL)           /*!< Position of ATVALID field.                                           */
  #define TPIU_ITATBCTR0_ATVALID_Msk (0x1UL << TPIU_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field.                     */
  #define TPIU_ITATBCTR0_ATVALID_Min (0x0UL)         /*!< Min enumerator value of ATVALID field.                               */
  #define TPIU_ITATBCTR0_ATVALID_Max (0x1UL)         /*!< Max enumerator value of ATVALID field.                               */
  #define TPIU_ITATBCTR0_ATVALID_Low (0x0UL)         /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR0_ATVALID_High (0x1UL)        /*!< Pin is logic 1.                                                      */

/* AFREADY @Bit 2 : Reads the value of afreadys. */
  #define TPIU_ITATBCTR0_AFREADY_Pos (2UL)           /*!< Position of AFREADY field.                                           */
  #define TPIU_ITATBCTR0_AFREADY_Msk (0x1UL << TPIU_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field.                     */
  #define TPIU_ITATBCTR0_AFREADY_Min (0x0UL)         /*!< Min enumerator value of AFREADY field.                               */
  #define TPIU_ITATBCTR0_AFREADY_Max (0x1UL)         /*!< Max enumerator value of AFREADY field.                               */
  #define TPIU_ITATBCTR0_AFREADY_Low (0x0UL)         /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR0_AFREADY_High (0x1UL)        /*!< Pin is logic 1.                                                      */

/* ATBYTES @Bits 8..9 : Reads the value of atbytess. */
  #define TPIU_ITATBCTR0_ATBYTES_Pos (8UL)           /*!< Position of ATBYTES field.                                           */
  #define TPIU_ITATBCTR0_ATBYTES_Msk (0x3UL << TPIU_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field.                     */
  #define TPIU_ITATBCTR0_ATBYTES_Min (0x0UL)         /*!< Min enumerator value of ATBYTES field.                               */
  #define TPIU_ITATBCTR0_ATBYTES_Max (0x1UL)         /*!< Max enumerator value of ATBYTES field.                               */
  #define TPIU_ITATBCTR0_ATBYTES_Low (0x0UL)         /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR0_ATBYTES_High (0x1UL)        /*!< Pin is logic 1.                                                      */


/* TPIU_ITCTRL: Used to enable topology detection. This register enables the component to switch from a functional mode, the
                 default behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                 for integration testing and topology solving. */

  #define TPIU_ITCTRL_ResetValue (0x00000000UL)      /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATIONMODE @Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration
                            functionality is implemented, this register must read as zero. */

  #define TPIU_ITCTRL_INTEGRATIONMODE_Pos (0UL)      /*!< Position of INTEGRATIONMODE field.                                   */
  #define TPIU_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << TPIU_ITCTRL_INTEGRATIONMODE_Pos) /*!< Bit mask of INTEGRATIONMODE field.   */
  #define TPIU_ITCTRL_INTEGRATIONMODE_Min (0x0UL)    /*!< Min enumerator value of INTEGRATIONMODE field.                       */
  #define TPIU_ITCTRL_INTEGRATIONMODE_Max (0x1UL)    /*!< Max enumerator value of INTEGRATIONMODE field.                       */
  #define TPIU_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL) /*!< Integration mode is disabled.                                      */
  #define TPIU_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL) /*!< Integration mode is Enabled.                                        */


/* TPIU_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. The
                   claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim
                   tag, and determines the number of claim bits implemented. */

  #define TPIU_CLAIMSET_ResetValue (0x00000000UL)    /*!< Reset value of CLAIMSET register.                                    */

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT0_Pos (0UL)               /*!< Position of BIT0 field.                                              */
  #define TPIU_CLAIMSET_BIT0_Msk (0x1UL << TPIU_CLAIMSET_BIT0_Pos) /*!< Bit mask of BIT0 field.                                */
  #define TPIU_CLAIMSET_BIT0_Min (0x0UL)             /*!< Min enumerator value of BIT0 field.                                  */
  #define TPIU_CLAIMSET_BIT0_Max (0x1UL)             /*!< Max enumerator value of BIT0 field.                                  */
  #define TPIU_CLAIMSET_BIT0_NotImplemented (0x0UL)  /*!< Claim bit 0 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT0_Implemented (0x1UL)     /*!< Claim bit 0 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT0_Set (0x1UL)             /*!< Set claim bit 0.                                                     */

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT1_Pos (1UL)               /*!< Position of BIT1 field.                                              */
  #define TPIU_CLAIMSET_BIT1_Msk (0x1UL << TPIU_CLAIMSET_BIT1_Pos) /*!< Bit mask of BIT1 field.                                */
  #define TPIU_CLAIMSET_BIT1_Min (0x0UL)             /*!< Min enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMSET_BIT1_Max (0x1UL)             /*!< Max enumerator value of BIT1 field.                                  */
  #define TPIU_CLAIMSET_BIT1_NotImplemented (0x0UL)  /*!< Claim bit 1 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT1_Implemented (0x1UL)     /*!< Claim bit 1 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT1_Set (0x1UL)             /*!< Set claim bit 1.                                                     */

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT2_Pos (2UL)               /*!< Position of BIT2 field.                                              */
  #define TPIU_CLAIMSET_BIT2_Msk (0x1UL << TPIU_CLAIMSET_BIT2_Pos) /*!< Bit mask of BIT2 field.                                */
  #define TPIU_CLAIMSET_BIT2_Min (0x0UL)             /*!< Min enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMSET_BIT2_Max (0x1UL)             /*!< Max enumerator value of BIT2 field.                                  */
  #define TPIU_CLAIMSET_BIT2_NotImplemented (0x0UL)  /*!< Claim bit 2 is not implemented.                                      */
  #define TPIU_CLAIMSET_BIT2_Implemented (0x1UL)     /*!< Claim bit 2 is implemented.                                          */
  #define TPIU_CLAIMSET_BIT2_Set (0x1UL)             /*!< Set claim bit 2.                                                     */

