tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TPIU_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not
                  recognized. The debugger can then report this information. */

  #define TPIU_DEVTYPE_ResetValue (0x00000000UL)     /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define TPIU_DEVTYPE_MAJOR_Pos (0UL)               /*!< Position of MAJOR field.                                             */
  #define TPIU_DEVTYPE_MAJOR_Msk (0xFUL << TPIU_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                               */
  #define TPIU_DEVTYPE_MAJOR_Min (0x1UL)             /*!< Min enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_Max (0x1UL)             /*!< Max enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_TraceSource (0x1UL)     /*!< Peripheral is a trace sink.                                          */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define TPIU_DEVTYPE_SUB_Pos (4UL)                 /*!< Position of SUB field.                                               */
  #define TPIU_DEVTYPE_SUB_Msk (0xFUL << TPIU_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                     */
  #define TPIU_DEVTYPE_SUB_Min (0x1UL)               /*!< Min enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_Max (0x1UL)               /*!< Max enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_TracePort (0x1UL)         /*!< Indicates that this component is a trace port component.             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TSGEN                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct TSGEN ======================================================= */
/**
  * @brief Timestamp generator
  */
  typedef struct {                                   /*!< TSGEN Structure                                                      */
    __IOM uint32_t CNTCR;                            /*!< (@ 0x00000000) Counter Control Register                              */
    __IM uint32_t CNTSR;                             /*!< (@ 0x00000004) Counter Status Register                               */
    __IOM uint32_t CNTCVL;                           /*!< (@ 0x00000008) Current Counter Value Lower register                  */
    __IOM uint32_t CNTCVU;                           /*!< (@ 0x0000000C) Current Counter Value Upper register                  */
    __IM uint32_t RESERVED[4];
    __IOM uint32_t CNTFID0;                          /*!< (@ 0x00000020) Base Frequency ID                                     */
    __IM uint32_t RESERVED1[1003];
    __IM uint32_t PIDR4;                             /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t RESERVED2[3];
    __IM uint32_t PIDR0;                             /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PIDR1;                             /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PIDR2;                             /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PIDR3;                             /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t CIDR0;                             /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t CIDR1;                             /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t CIDR2;                             /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t CIDR3;                             /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_TSGEN_Type;                                  /*!< Size = 4096 (0x1000)                                                 */

/* TSGEN_CNTCR: Counter Control Register */
  #define TSGEN_CNTCR_ResetValue (0x00000000UL)      /*!< Reset value of CNTCR register.                                       */

/* EN @Bit 0 : Counter enable */
  #define TSGEN_CNTCR_EN_Pos (0UL)                   /*!< Position of EN field.                                                */
  #define TSGEN_CNTCR_EN_Msk (0x1UL << TSGEN_CNTCR_EN_Pos) /*!< Bit mask of EN field.                                          */
  #define TSGEN_CNTCR_EN_Min (0x0UL)                 /*!< Min enumerator value of EN field.                                    */
  #define TSGEN_CNTCR_EN_Max (0x1UL)                 /*!< Max enumerator value of EN field.                                    */
  #define TSGEN_CNTCR_EN_Disabled (0x0UL)            /*!< (unspecified)                                                        */
  #define TSGEN_CNTCR_EN_Enabled (0x1UL)             /*!< (unspecified)                                                        */

/* HDBG @Bit 1 : Halt on Debug */
  #define TSGEN_CNTCR_HDBG_Pos (1UL)                 /*!< Position of HDBG field.                                              */
  #define TSGEN_CNTCR_HDBG_Msk (0x1UL << TSGEN_CNTCR_HDBG_Pos) /*!< Bit mask of HDBG field.                                    */
  #define TSGEN_CNTCR_HDBG_Min (0x0UL)               /*!< Min enumerator value of HDBG field.                                  */
  #define TSGEN_CNTCR_HDBG_Max (0x1UL)               /*!< Max enumerator value of HDBG field.                                  */
  #define TSGEN_CNTCR_HDBG_Disabled (0x0UL)          /*!< Do not halt on debug, HLTDBG signal into the counter has no effect.  */
  #define TSGEN_CNTCR_HDBG_Enabled (0x1UL)           /*!< Halt on debug, when HLTDBG is driven HIGH, the count value is held
                                                          static.*/


/* TSGEN_CNTSR: Counter Status Register */
  #define TSGEN_CNTSR_ResetValue (0x00000000UL)      /*!< Reset value of CNTSR register.                                       */

/* DBGH @Bit 1 : Debug halted */
  #define TSGEN_CNTSR_DBGH_Pos (1UL)                 /*!< Position of DBGH field.                                              */
  #define TSGEN_CNTSR_DBGH_Msk (0x1UL << TSGEN_CNTSR_DBGH_Pos) /*!< Bit mask of DBGH field.                                    */


/* TSGEN_CNTCVL: Current Counter Value Lower register */
  #define TSGEN_CNTCVL_ResetValue (0x00000000UL)     /*!< Reset value of CNTCVL register.                                      */

/* CNTCVL_L_32 @Bits 0..31 : Current value of Counter, lower 32 bits */
  #define TSGEN_CNTCVL_CNTCVL_L_32_Pos (0UL)         /*!< Position of CNTCVL_L_32 field.                                       */
  #define TSGEN_CNTCVL_CNTCVL_L_32_Msk (0xFFFFFFFFUL << TSGEN_CNTCVL_CNTCVL_L_32_Pos) /*!< Bit mask of CNTCVL_L_32 field.      */


