tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ===================================================== Struct TWIM_RXD ===================================================== */
/**
  * @brief RXD [TWIM_RXD] RXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_TWIM_RXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* TWIM_RXD_PTR: Data pointer */
  #define TWIM_RXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define TWIM_RXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define TWIM_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << TWIM_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* TWIM_RXD_MAXCNT: Maximum number of bytes in receive buffer */
  #define TWIM_RXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in receive buffer */
  #define TWIM_RXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define TWIM_RXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIM_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define TWIM_RXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define TWIM_RXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


/* TWIM_RXD_AMOUNT: Number of bytes transferred in the last transaction */
  #define TWIM_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIM_RXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define TWIM_RXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIM_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define TWIM_RXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define TWIM_RXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* TWIM_RXD_LIST: EasyDMA list type */
  #define TWIM_RXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..2 : List type */
  #define TWIM_RXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define TWIM_RXD_LIST_LIST_Msk (0x7UL << TWIM_RXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define TWIM_RXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define TWIM_RXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define TWIM_RXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define TWIM_RXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



/* ===================================================== Struct TWIM_TXD ===================================================== */
/**
  * @brief TXD [TWIM_TXD] TXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_TWIM_TXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* TWIM_TXD_PTR: Data pointer */
  #define TWIM_TXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define TWIM_TXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define TWIM_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << TWIM_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* TWIM_TXD_MAXCNT: Maximum number of bytes in transmit buffer */
  #define TWIM_TXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in transmit buffer */
  #define TWIM_TXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define TWIM_TXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIM_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define TWIM_TXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define TWIM_TXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


