tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ======================================================= Struct TWIM ======================================================= */
/**
  * @brief I2C compatible Two-Wire Master Interface with EasyDMA
  */
  typedef struct {                                   /*!< TWIM Structure                                                       */
    __OM uint32_t TASKS_STARTRX;                     /*!< (@ 0x00000000) Start TWI receive sequence                            */
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STARTTX;                     /*!< (@ 0x00000008) Start TWI transmit sequence                           */
    __IM uint32_t RESERVED1[2];
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000014) Stop TWI transaction. Must be issued while the TWI
                                                                         master is not suspended.*/
    __IM uint32_t RESERVED2;
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000001C) Suspend TWI transaction                               */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000020) Resume TWI transaction                                */
    __IM uint32_t RESERVED3[23];
    __IOM uint32_t SUBSCRIBE_STARTRX;                /*!< (@ 0x00000080) Subscribe configuration for task STARTRX              */
    __IM uint32_t RESERVED4;
    __IOM uint32_t SUBSCRIBE_STARTTX;                /*!< (@ 0x00000088) Subscribe configuration for task STARTTX              */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000094) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED6;
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x000000A0) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED7[24];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) TWI stopped                                           */
    __IM uint32_t RESERVED8[7];
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000124) TWI error                                             */
    __IM uint32_t RESERVED9[8];
    __IOM uint32_t EVENTS_SUSPENDED;                 /*!< (@ 0x00000148) SUSPEND task has been issued, TWI traffic is now
                                                                         suspended.*/
    __IOM uint32_t EVENTS_RXSTARTED;                 /*!< (@ 0x0000014C) Receive sequence started                              */
    __IOM uint32_t EVENTS_TXSTARTED;                 /*!< (@ 0x00000150) Transmit sequence started                             */
    __IM uint32_t RESERVED10[2];
    __IOM uint32_t EVENTS_LASTRX;                    /*!< (@ 0x0000015C) Byte boundary, starting to receive the last byte      */
    __IOM uint32_t EVENTS_LASTTX;                    /*!< (@ 0x00000160) Byte boundary, starting to transmit the last byte     */
    __IM uint32_t RESERVED11[4];
    __IOM uint32_t EVENTS_RXBUSERROR;                /*!< (@ 0x00000174) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IOM uint32_t EVENTS_TXBUSERROR;                /*!< (@ 0x00000178) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IM uint32_t RESERVED12[2];
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED13[7];
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x000001A4) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED14[8];
    __IOM uint32_t PUBLISH_SUSPENDED;                /*!< (@ 0x000001C8) Publish configuration for event SUSPENDED             */
    __IOM uint32_t PUBLISH_RXSTARTED;                /*!< (@ 0x000001CC) Publish configuration for event RXSTARTED             */
    __IOM uint32_t PUBLISH_TXSTARTED;                /*!< (@ 0x000001D0) Publish configuration for event TXSTARTED             */
    __IM uint32_t RESERVED15[2];
    __IOM uint32_t PUBLISH_LASTRX;                   /*!< (@ 0x000001DC) Publish configuration for event LASTRX                */
    __IOM uint32_t PUBLISH_LASTTX;                   /*!< (@ 0x000001E0) Publish configuration for event LASTTX                */
    __IM uint32_t RESERVED16[4];
    __IOM uint32_t PUBLISH_RXBUSERROR;               /*!< (@ 0x000001F4) Publish configuration for event RXBUSERROR            */
    __IOM uint32_t PUBLISH_TXBUSERROR;               /*!< (@ 0x000001F8) Publish configuration for event TXBUSERROR            */
    __IM uint32_t RESERVED17;
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED18[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED19[110];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x000004C4) Error source                                          */
    __IM uint32_t RESERVED20[14];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable TWIM                                           */
    __IM uint32_t RESERVED21;
    __IOM NRF_TWIM_PSEL_Type PSEL;                   /*!< (@ 0x00000508) (unspecified)                                         */
    __IM uint32_t RESERVED22[5];
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED23[3];
    __IOM NRF_TWIM_RXD_Type RXD;                     /*!< (@ 0x00000534) RXD EasyDMA channel                                   */
    __IOM NRF_TWIM_TXD_Type TXD;                     /*!< (@ 0x00000544) TXD EasyDMA channel                                   */
    __IM uint32_t RESERVED24[13];
    __IOM uint32_t ADDRESS;                          /*!< (@ 0x00000588) Address used in the TWI transfer                      */
    __IM uint32_t RESERVED25[9];
    __IOM NRF_TWIM_DMA_Type DMA;                     /*!< (@ 0x000005B0) (unspecified)                                         */
  } NRF_TWIM_Type;                                   /*!< Size = 1472 (0x5C0)                                                  */

