tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TWIM_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWIM_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWIM_PUBLISH_ERROR_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWIM_PUBLISH_ERROR_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_ERROR_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_ERROR_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_ERROR_EN_Msk (0x1UL << TWIM_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWIM_PUBLISH_ERROR_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_ERROR_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_ERROR_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_ERROR_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_SUSPENDED: Publish configuration for event SUSPENDED */
  #define TWIM_PUBLISH_SUSPENDED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SUSPENDED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event SUSPENDED will publish to */
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_SUSPENDED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_SUSPENDED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_SUSPENDED_EN_Msk (0x1UL << TWIM_PUBLISH_SUSPENDED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIM_PUBLISH_SUSPENDED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_SUSPENDED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_SUSPENDED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_SUSPENDED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_RXSTARTED: Publish configuration for event RXSTARTED */
  #define TWIM_PUBLISH_RXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXSTARTED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RXSTARTED will publish to */
  #define TWIM_PUBLISH_RXSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_RXSTARTED_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_RXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIM_PUBLISH_RXSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_RXSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_RXSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_RXSTARTED_EN_Msk (0x1UL << TWIM_PUBLISH_RXSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIM_PUBLISH_RXSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_RXSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_RXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_RXSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_TXSTARTED: Publish configuration for event TXSTARTED */
  #define TWIM_PUBLISH_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXSTARTED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event TXSTARTED will publish to */
  #define TWIM_PUBLISH_TXSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_TXSTARTED_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_TXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIM_PUBLISH_TXSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_TXSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_TXSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_TXSTARTED_EN_Msk (0x1UL << TWIM_PUBLISH_TXSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIM_PUBLISH_TXSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_TXSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_TXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_TXSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_LASTRX: Publish configuration for event LASTRX */
  #define TWIM_PUBLISH_LASTRX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LASTRX register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event LASTRX will publish to */
  #define TWIM_PUBLISH_LASTRX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_LASTRX_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_LASTRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWIM_PUBLISH_LASTRX_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_LASTRX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_LASTRX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_LASTRX_EN_Msk (0x1UL << TWIM_PUBLISH_LASTRX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWIM_PUBLISH_LASTRX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTRX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTRX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_LASTRX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_LASTTX: Publish configuration for event LASTTX */
  #define TWIM_PUBLISH_LASTTX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LASTTX register.                           */

