tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event LASTTX will publish to */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_LASTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_LASTTX_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_LASTTX_EN_Msk (0x1UL << TWIM_PUBLISH_LASTTX_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWIM_PUBLISH_LASTTX_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTTX_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_LASTTX_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWIM_PUBLISH_LASTTX_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_RXBUSERROR: Publish configuration for event RXBUSERROR */
  #define TWIM_PUBLISH_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event RXBUSERROR will publish to */
  #define TWIM_PUBLISH_RXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_RXBUSERROR_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_RXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TWIM_PUBLISH_RXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_RXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Msk (0x1UL << TWIM_PUBLISH_RXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TWIM_PUBLISH_RXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TWIM_PUBLISH_TXBUSERROR: Publish configuration for event TXBUSERROR */
  #define TWIM_PUBLISH_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXBUSERROR will publish to */
  #define TWIM_PUBLISH_TXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TWIM_PUBLISH_TXBUSERROR_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_TXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TWIM_PUBLISH_TXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TWIM_PUBLISH_TXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Msk (0x1UL << TWIM_PUBLISH_TXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TWIM_PUBLISH_TXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TWIM_SHORTS: Shortcuts between local events and tasks */
  #define TWIM_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* LASTTX_STARTRX @Bit 7 : Shortcut between event LASTTX and task STARTRX */
  #define TWIM_SHORTS_LASTTX_STARTRX_Pos (7UL)       /*!< Position of LASTTX_STARTRX field.                                    */
  #define TWIM_SHORTS_LASTTX_STARTRX_Msk (0x1UL << TWIM_SHORTS_LASTTX_STARTRX_Pos) /*!< Bit mask of LASTTX_STARTRX field.      */
  #define TWIM_SHORTS_LASTTX_STARTRX_Min (0x0UL)     /*!< Min enumerator value of LASTTX_STARTRX field.                        */
  #define TWIM_SHORTS_LASTTX_STARTRX_Max (0x1UL)     /*!< Max enumerator value of LASTTX_STARTRX field.                        */
  #define TWIM_SHORTS_LASTTX_STARTRX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTTX_STARTRX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTTX_SUSPEND @Bit 8 : Shortcut between event LASTTX and task SUSPEND */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Pos (8UL)       /*!< Position of LASTTX_SUSPEND field.                                    */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Msk (0x1UL << TWIM_SHORTS_LASTTX_SUSPEND_Pos) /*!< Bit mask of LASTTX_SUSPEND field.      */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Min (0x0UL)     /*!< Min enumerator value of LASTTX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Max (0x1UL)     /*!< Max enumerator value of LASTTX_SUSPEND field.                        */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTTX_STOP @Bit 9 : Shortcut between event LASTTX and task STOP */
  #define TWIM_SHORTS_LASTTX_STOP_Pos (9UL)          /*!< Position of LASTTX_STOP field.                                       */
  #define TWIM_SHORTS_LASTTX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTTX_STOP_Pos) /*!< Bit mask of LASTTX_STOP field.               */
  #define TWIM_SHORTS_LASTTX_STOP_Min (0x0UL)        /*!< Min enumerator value of LASTTX_STOP field.                           */
  #define TWIM_SHORTS_LASTTX_STOP_Max (0x1UL)        /*!< Max enumerator value of LASTTX_STOP field.                           */
  #define TWIM_SHORTS_LASTTX_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define TWIM_SHORTS_LASTTX_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* LASTRX_STARTTX @Bit 10 : Shortcut between event LASTRX and task STARTTX */
  #define TWIM_SHORTS_LASTRX_STARTTX_Pos (10UL)      /*!< Position of LASTRX_STARTTX field.                                    */
  #define TWIM_SHORTS_LASTRX_STARTTX_Msk (0x1UL << TWIM_SHORTS_LASTRX_STARTTX_Pos) /*!< Bit mask of LASTRX_STARTTX field.      */
  #define TWIM_SHORTS_LASTRX_STARTTX_Min (0x0UL)     /*!< Min enumerator value of LASTRX_STARTTX field.                        */
  #define TWIM_SHORTS_LASTRX_STARTTX_Max (0x1UL)     /*!< Max enumerator value of LASTRX_STARTTX field.                        */
  #define TWIM_SHORTS_LASTRX_STARTTX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TWIM_SHORTS_LASTRX_STARTTX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* LASTRX_STOP @Bit 12 : Shortcut between event LASTRX and task STOP */
  #define TWIM_SHORTS_LASTRX_STOP_Pos (12UL)         /*!< Position of LASTRX_STOP field.                                       */
  #define TWIM_SHORTS_LASTRX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTRX_STOP_Pos) /*!< Bit mask of LASTRX_STOP field.               */
  #define TWIM_SHORTS_LASTRX_STOP_Min (0x0UL)        /*!< Min enumerator value of LASTRX_STOP field.                           */
  #define TWIM_SHORTS_LASTRX_STOP_Max (0x1UL)        /*!< Max enumerator value of LASTRX_STOP field.                           */
  #define TWIM_SHORTS_LASTRX_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define TWIM_SHORTS_LASTRX_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */


