tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TWIM_INTEN: Enable or disable interrupt */
  #define TWIM_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define TWIM_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define TWIM_INTEN_STOPPED_Msk (0x1UL << TWIM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define TWIM_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIM_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 9 : Enable or disable interrupt for event ERROR */
  #define TWIM_INTEN_ERROR_Pos (9UL)                 /*!< Position of ERROR field.                                             */
  #define TWIM_INTEN_ERROR_Msk (0x1UL << TWIM_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define TWIM_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIM_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* SUSPENDED @Bit 18 : Enable or disable interrupt for event SUSPENDED */
  #define TWIM_INTEN_SUSPENDED_Pos (18UL)            /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTEN_SUSPENDED_Msk (0x1UL << TWIM_INTEN_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                       */
  #define TWIM_INTEN_SUSPENDED_Min (0x0UL)           /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTEN_SUSPENDED_Max (0x1UL)           /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTEN_SUSPENDED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIM_INTEN_SUSPENDED_Enabled (0x1UL)       /*!< Enable                                                               */

/* RXSTARTED @Bit 19 : Enable or disable interrupt for event RXSTARTED */
  #define TWIM_INTEN_RXSTARTED_Pos (19UL)            /*!< Position of RXSTARTED field.                                         */
  #define TWIM_INTEN_RXSTARTED_Msk (0x1UL << TWIM_INTEN_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                       */
  #define TWIM_INTEN_RXSTARTED_Min (0x0UL)           /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIM_INTEN_RXSTARTED_Max (0x1UL)           /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIM_INTEN_RXSTARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIM_INTEN_RXSTARTED_Enabled (0x1UL)       /*!< Enable                                                               */

/* TXSTARTED @Bit 20 : Enable or disable interrupt for event TXSTARTED */
  #define TWIM_INTEN_TXSTARTED_Pos (20UL)            /*!< Position of TXSTARTED field.                                         */
  #define TWIM_INTEN_TXSTARTED_Msk (0x1UL << TWIM_INTEN_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                       */
  #define TWIM_INTEN_TXSTARTED_Min (0x0UL)           /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIM_INTEN_TXSTARTED_Max (0x1UL)           /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIM_INTEN_TXSTARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIM_INTEN_TXSTARTED_Enabled (0x1UL)       /*!< Enable                                                               */

/* LASTRX @Bit 23 : Enable or disable interrupt for event LASTRX */
  #define TWIM_INTEN_LASTRX_Pos (23UL)               /*!< Position of LASTRX field.                                            */
  #define TWIM_INTEN_LASTRX_Msk (0x1UL << TWIM_INTEN_LASTRX_Pos) /*!< Bit mask of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Min (0x0UL)              /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Max (0x1UL)              /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTEN_LASTRX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TWIM_INTEN_LASTRX_Enabled (0x1UL)          /*!< Enable                                                               */

/* LASTTX @Bit 24 : Enable or disable interrupt for event LASTTX */
  #define TWIM_INTEN_LASTTX_Pos (24UL)               /*!< Position of LASTTX field.                                            */
  #define TWIM_INTEN_LASTTX_Msk (0x1UL << TWIM_INTEN_LASTTX_Pos) /*!< Bit mask of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Min (0x0UL)              /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Max (0x1UL)              /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTEN_LASTTX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TWIM_INTEN_LASTTX_Enabled (0x1UL)          /*!< Enable                                                               */

/* RXBUSERROR @Bit 29 : Enable or disable interrupt for event RXBUSERROR */
  #define TWIM_INTEN_RXBUSERROR_Pos (29UL)           /*!< Position of RXBUSERROR field.                                        */
  #define TWIM_INTEN_RXBUSERROR_Msk (0x1UL << TWIM_INTEN_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.                    */
  #define TWIM_INTEN_RXBUSERROR_Min (0x0UL)          /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTEN_RXBUSERROR_Max (0x1UL)          /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTEN_RXBUSERROR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIM_INTEN_RXBUSERROR_Enabled (0x1UL)      /*!< Enable                                                               */

/* TXBUSERROR @Bit 30 : Enable or disable interrupt for event TXBUSERROR */
  #define TWIM_INTEN_TXBUSERROR_Pos (30UL)           /*!< Position of TXBUSERROR field.                                        */
  #define TWIM_INTEN_TXBUSERROR_Msk (0x1UL << TWIM_INTEN_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.                    */
  #define TWIM_INTEN_TXBUSERROR_Min (0x0UL)          /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTEN_TXBUSERROR_Max (0x1UL)          /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTEN_TXBUSERROR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIM_INTEN_TXBUSERROR_Enabled (0x1UL)      /*!< Enable                                                               */


/* TWIM_INTENSET: Enable interrupt */
  #define TWIM_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIM_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIM_INTENSET_STOPPED_Msk (0x1UL << TWIM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIM_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIM_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to enable interrupt for event ERROR */
  #define TWIM_INTENSET_ERROR_Pos (9UL)              /*!< Position of ERROR field.                                             */
  #define TWIM_INTENSET_ERROR_Msk (0x1UL << TWIM_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIM_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIM_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* SUSPENDED @Bit 18 : Write '1' to enable interrupt for event SUSPENDED */
  #define TWIM_INTENSET_SUSPENDED_Pos (18UL)         /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTENSET_SUSPENDED_Msk (0x1UL << TWIM_INTENSET_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                 */
  #define TWIM_INTENSET_SUSPENDED_Min (0x0UL)        /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENSET_SUSPENDED_Max (0x1UL)        /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENSET_SUSPENDED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIM_INTENSET_SUSPENDED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_SUSPENDED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
  #define TWIM_INTENSET_RXSTARTED_Pos (19UL)         /*!< Position of RXSTARTED field.                                         */
  #define TWIM_INTENSET_RXSTARTED_Msk (0x1UL << TWIM_INTENSET_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                 */
  #define TWIM_INTENSET_RXSTARTED_Min (0x0UL)        /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIM_INTENSET_RXSTARTED_Max (0x1UL)        /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIM_INTENSET_RXSTARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIM_INTENSET_RXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_RXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

