tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXSTARTED @Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
  #define TWIM_INTENSET_TXSTARTED_Pos (20UL)         /*!< Position of TXSTARTED field.                                         */
  #define TWIM_INTENSET_TXSTARTED_Msk (0x1UL << TWIM_INTENSET_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                 */
  #define TWIM_INTENSET_TXSTARTED_Min (0x0UL)        /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIM_INTENSET_TXSTARTED_Max (0x1UL)        /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIM_INTENSET_TXSTARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIM_INTENSET_TXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_TXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LASTRX @Bit 23 : Write '1' to enable interrupt for event LASTRX */
  #define TWIM_INTENSET_LASTRX_Pos (23UL)            /*!< Position of LASTRX field.                                            */
  #define TWIM_INTENSET_LASTRX_Msk (0x1UL << TWIM_INTENSET_LASTRX_Pos) /*!< Bit mask of LASTRX field.                          */
  #define TWIM_INTENSET_LASTRX_Min (0x0UL)           /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTENSET_LASTRX_Max (0x1UL)           /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTENSET_LASTRX_Set (0x1UL)           /*!< Enable                                                               */
  #define TWIM_INTENSET_LASTRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_LASTRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* LASTTX @Bit 24 : Write '1' to enable interrupt for event LASTTX */
  #define TWIM_INTENSET_LASTTX_Pos (24UL)            /*!< Position of LASTTX field.                                            */
  #define TWIM_INTENSET_LASTTX_Msk (0x1UL << TWIM_INTENSET_LASTTX_Pos) /*!< Bit mask of LASTTX field.                          */
  #define TWIM_INTENSET_LASTTX_Min (0x0UL)           /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTENSET_LASTTX_Max (0x1UL)           /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTENSET_LASTTX_Set (0x1UL)           /*!< Enable                                                               */
  #define TWIM_INTENSET_LASTTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_LASTTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to enable interrupt for event RXBUSERROR */
  #define TWIM_INTENSET_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define TWIM_INTENSET_RXBUSERROR_Msk (0x1UL << TWIM_INTENSET_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define TWIM_INTENSET_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTENSET_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTENSET_RXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIM_INTENSET_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to enable interrupt for event TXBUSERROR */
  #define TWIM_INTENSET_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define TWIM_INTENSET_TXBUSERROR_Msk (0x1UL << TWIM_INTENSET_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define TWIM_INTENSET_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTENSET_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTENSET_TXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIM_INTENSET_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TWIM_INTENCLR: Disable interrupt */
  #define TWIM_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWIM_INTENCLR_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIM_INTENCLR_STOPPED_Msk (0x1UL << TWIM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIM_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWIM_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to disable interrupt for event ERROR */
  #define TWIM_INTENCLR_ERROR_Pos (9UL)              /*!< Position of ERROR field.                                             */
  #define TWIM_INTENCLR_ERROR_Msk (0x1UL << TWIM_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIM_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIM_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

