tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SUSPENDED @Bit 18 : Write '1' to disable interrupt for event SUSPENDED */
  #define TWIM_INTENCLR_SUSPENDED_Pos (18UL)         /*!< Position of SUSPENDED field.                                         */
  #define TWIM_INTENCLR_SUSPENDED_Msk (0x1UL << TWIM_INTENCLR_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                 */
  #define TWIM_INTENCLR_SUSPENDED_Min (0x0UL)        /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENCLR_SUSPENDED_Max (0x1UL)        /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWIM_INTENCLR_SUSPENDED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIM_INTENCLR_SUSPENDED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_SUSPENDED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
  #define TWIM_INTENCLR_RXSTARTED_Pos (19UL)         /*!< Position of RXSTARTED field.                                         */
  #define TWIM_INTENCLR_RXSTARTED_Msk (0x1UL << TWIM_INTENCLR_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                 */
  #define TWIM_INTENCLR_RXSTARTED_Min (0x0UL)        /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIM_INTENCLR_RXSTARTED_Max (0x1UL)        /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIM_INTENCLR_RXSTARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIM_INTENCLR_RXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_RXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TXSTARTED @Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
  #define TWIM_INTENCLR_TXSTARTED_Pos (20UL)         /*!< Position of TXSTARTED field.                                         */
  #define TWIM_INTENCLR_TXSTARTED_Msk (0x1UL << TWIM_INTENCLR_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                 */
  #define TWIM_INTENCLR_TXSTARTED_Min (0x0UL)        /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIM_INTENCLR_TXSTARTED_Max (0x1UL)        /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIM_INTENCLR_TXSTARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIM_INTENCLR_TXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_TXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LASTRX @Bit 23 : Write '1' to disable interrupt for event LASTRX */
  #define TWIM_INTENCLR_LASTRX_Pos (23UL)            /*!< Position of LASTRX field.                                            */
  #define TWIM_INTENCLR_LASTRX_Msk (0x1UL << TWIM_INTENCLR_LASTRX_Pos) /*!< Bit mask of LASTRX field.                          */
  #define TWIM_INTENCLR_LASTRX_Min (0x0UL)           /*!< Min enumerator value of LASTRX field.                                */
  #define TWIM_INTENCLR_LASTRX_Max (0x1UL)           /*!< Max enumerator value of LASTRX field.                                */
  #define TWIM_INTENCLR_LASTRX_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWIM_INTENCLR_LASTRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_LASTRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* LASTTX @Bit 24 : Write '1' to disable interrupt for event LASTTX */
  #define TWIM_INTENCLR_LASTTX_Pos (24UL)            /*!< Position of LASTTX field.                                            */
  #define TWIM_INTENCLR_LASTTX_Msk (0x1UL << TWIM_INTENCLR_LASTTX_Pos) /*!< Bit mask of LASTTX field.                          */
  #define TWIM_INTENCLR_LASTTX_Min (0x0UL)           /*!< Min enumerator value of LASTTX field.                                */
  #define TWIM_INTENCLR_LASTTX_Max (0x1UL)           /*!< Max enumerator value of LASTTX field.                                */
  #define TWIM_INTENCLR_LASTTX_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWIM_INTENCLR_LASTTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_LASTTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to disable interrupt for event RXBUSERROR */
  #define TWIM_INTENCLR_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define TWIM_INTENCLR_RXBUSERROR_Msk (0x1UL << TWIM_INTENCLR_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define TWIM_INTENCLR_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTENCLR_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIM_INTENCLR_RXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIM_INTENCLR_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to disable interrupt for event TXBUSERROR */
  #define TWIM_INTENCLR_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define TWIM_INTENCLR_TXBUSERROR_Msk (0x1UL << TWIM_INTENCLR_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define TWIM_INTENCLR_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTENCLR_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIM_INTENCLR_TXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIM_INTENCLR_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TWIM_ERRORSRC: Error source */
  #define TWIM_ERRORSRC_ResetValue (0x00000000UL)    /*!< Reset value of ERRORSRC register.                                    */

