tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* OVERRUN @Bit 0 : Overrun error */
  #define TWIM_ERRORSRC_OVERRUN_Pos (0UL)            /*!< Position of OVERRUN field.                                           */
  #define TWIM_ERRORSRC_OVERRUN_Msk (0x1UL << TWIM_ERRORSRC_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.                       */
  #define TWIM_ERRORSRC_OVERRUN_Min (0x0UL)          /*!< Min enumerator value of OVERRUN field.                               */
  #define TWIM_ERRORSRC_OVERRUN_Max (0x1UL)          /*!< Max enumerator value of OVERRUN field.                               */
  #define TWIM_ERRORSRC_OVERRUN_NotReceived (0x0UL)  /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_OVERRUN_Received (0x1UL)     /*!< Error occurred                                                       */

/* ANACK @Bit 1 : NACK received after sending the address (write '1' to clear) */
  #define TWIM_ERRORSRC_ANACK_Pos (1UL)              /*!< Position of ANACK field.                                             */
  #define TWIM_ERRORSRC_ANACK_Msk (0x1UL << TWIM_ERRORSRC_ANACK_Pos) /*!< Bit mask of ANACK field.                             */
  #define TWIM_ERRORSRC_ANACK_Min (0x0UL)            /*!< Min enumerator value of ANACK field.                                 */
  #define TWIM_ERRORSRC_ANACK_Max (0x1UL)            /*!< Max enumerator value of ANACK field.                                 */
  #define TWIM_ERRORSRC_ANACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_ANACK_Received (0x1UL)       /*!< Error occurred                                                       */

/* DNACK @Bit 2 : NACK received after sending a data byte (write '1' to clear) */
  #define TWIM_ERRORSRC_DNACK_Pos (2UL)              /*!< Position of DNACK field.                                             */
  #define TWIM_ERRORSRC_DNACK_Msk (0x1UL << TWIM_ERRORSRC_DNACK_Pos) /*!< Bit mask of DNACK field.                             */
  #define TWIM_ERRORSRC_DNACK_Min (0x0UL)            /*!< Min enumerator value of DNACK field.                                 */
  #define TWIM_ERRORSRC_DNACK_Max (0x1UL)            /*!< Max enumerator value of DNACK field.                                 */
  #define TWIM_ERRORSRC_DNACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_DNACK_Received (0x1UL)       /*!< Error occurred                                                       */


/* TWIM_ENABLE: Enable TWIM */
  #define TWIM_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable TWIM */
  #define TWIM_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define TWIM_ENABLE_ENABLE_Msk (0xFUL << TWIM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define TWIM_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define TWIM_ENABLE_ENABLE_Max (0x6UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define TWIM_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable TWIM                                                         */
  #define TWIM_ENABLE_ENABLE_Enabled (0x6UL)         /*!< Enable TWIM                                                          */


/* TWIM_FREQUENCY: TWI frequency. Accuracy depends on the HFCLK source selected. */
  #define TWIM_FREQUENCY_ResetValue (0x04000000UL)   /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..31 : TWI master clock frequency */
  #define TWIM_FREQUENCY_FREQUENCY_Pos (0UL)         /*!< Position of FREQUENCY field.                                         */
  #define TWIM_FREQUENCY_FREQUENCY_Msk (0xFFFFFFFFUL << TWIM_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.        */
  #define TWIM_FREQUENCY_FREQUENCY_Min (0x1980000UL) /*!< Min enumerator value of FREQUENCY field.                             */
  #define TWIM_FREQUENCY_FREQUENCY_Max (0xFF00000UL) /*!< Max enumerator value of FREQUENCY field.                             */
  #define TWIM_FREQUENCY_FREQUENCY_K100 (0x01980000UL) /*!< 100 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K250 (0x04000000UL) /*!< 250 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K400 (0x06400000UL) /*!< 400 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K1000 (0x0FF00000UL) /*!< 1000 kbps                                                         */


/* TWIM_ADDRESS: Address used in the TWI transfer */
  #define TWIM_ADDRESS_ResetValue (0x00000000UL)     /*!< Reset value of ADDRESS register.                                     */

/* ADDRESS @Bits 0..6 : Address used in the TWI transfer */
  #define TWIM_ADDRESS_ADDRESS_Pos (0UL)             /*!< Position of ADDRESS field.                                           */
  #define TWIM_ADDRESS_ADDRESS_Msk (0x7FUL << TWIM_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct TWIS_PSEL ===================================================== */
/**
  * @brief PSEL [TWIS_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                               /*!< (@ 0x00000000) Pin select for SCL signal                             */
  __IOM uint32_t  SDA;                               /*!< (@ 0x00000004) Pin select for SDA signal                             */
} NRF_TWIS_PSEL_Type;                                /*!< Size = 8 (0x008)                                                     */

/* TWIS_PSEL_SCL: Pin select for SCL signal */
  #define TWIS_PSEL_SCL_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SCL register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SCL_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define TWIS_PSEL_SCL_PIN_Msk (0x1FUL << TWIS_PSEL_SCL_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define TWIS_PSEL_SCL_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define TWIS_PSEL_SCL_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define TWIS_PSEL_SCL_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define TWIS_PSEL_SCL_PORT_Msk (0xFUL << TWIS_PSEL_SCL_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define TWIS_PSEL_SCL_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define TWIS_PSEL_SCL_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SCL_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define TWIS_PSEL_SCL_CONNECT_Msk (0x1UL << TWIS_PSEL_SCL_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define TWIS_PSEL_SCL_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SCL_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SCL_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define TWIS_PSEL_SCL_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* TWIS_PSEL_SDA: Pin select for SDA signal */
  #define TWIS_PSEL_SDA_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SDA register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SDA_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define TWIS_PSEL_SDA_PIN_Msk (0x1FUL << TWIS_PSEL_SDA_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define TWIS_PSEL_SDA_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define TWIS_PSEL_SDA_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define TWIS_PSEL_SDA_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define TWIS_PSEL_SDA_PORT_Msk (0xFUL << TWIS_PSEL_SDA_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define TWIS_PSEL_SDA_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define TWIS_PSEL_SDA_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SDA_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define TWIS_PSEL_SDA_CONNECT_Msk (0x1UL << TWIS_PSEL_SDA_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define TWIS_PSEL_SDA_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SDA_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SDA_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define TWIS_PSEL_SDA_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ===================================================== Struct TWIS_RXD ===================================================== */
/**
  * @brief RXD [TWIS_RXD] RXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) RXD Data pointer                                      */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in RXD buffer                 */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last RXD
                                                                         transaction*/
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_TWIS_RXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* TWIS_RXD_PTR: RXD Data pointer */
  #define TWIS_RXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

