tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PTR @Bits 0..31 : RXD Data pointer */
  #define TWIS_RXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define TWIS_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << TWIS_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* TWIS_RXD_MAXCNT: Maximum number of bytes in RXD buffer */
  #define TWIS_RXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in RXD buffer */
  #define TWIS_RXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define TWIS_RXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIS_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define TWIS_RXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define TWIS_RXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


/* TWIS_RXD_AMOUNT: Number of bytes transferred in the last RXD transaction */
  #define TWIS_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last RXD transaction */
  #define TWIS_RXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define TWIS_RXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define TWIS_RXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define TWIS_RXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* TWIS_RXD_LIST: EasyDMA list type */
  #define TWIS_RXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..1 : List type */
  #define TWIS_RXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define TWIS_RXD_LIST_LIST_Msk (0x3UL << TWIS_RXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define TWIS_RXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define TWIS_RXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define TWIS_RXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define TWIS_RXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



/* ===================================================== Struct TWIS_TXD ===================================================== */
/**
  * @brief TXD [TWIS_TXD] TXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) TXD Data pointer                                      */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in TXD buffer                 */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last TXD
                                                                         transaction*/
  __IOM uint32_t  LIST;                              /*!< (@ 0x0000000C) EasyDMA list type                                     */
} NRF_TWIS_TXD_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* TWIS_TXD_PTR: TXD Data pointer */
  #define TWIS_TXD_PTR_ResetValue (0x00000000UL)     /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : TXD Data pointer */
  #define TWIS_TXD_PTR_PTR_Pos (0UL)                 /*!< Position of PTR field.                                               */
  #define TWIS_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << TWIS_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                              */


/* TWIS_TXD_MAXCNT: Maximum number of bytes in TXD buffer */
  #define TWIS_TXD_MAXCNT_ResetValue (0x00000000UL)  /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in TXD buffer */
  #define TWIS_TXD_MAXCNT_MAXCNT_Pos (0UL)           /*!< Position of MAXCNT field.                                            */
  #define TWIS_TXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIS_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                   */
  #define TWIS_TXD_MAXCNT_MAXCNT_Min (0x0001UL)      /*!< Min value of MAXCNT field.                                           */
  #define TWIS_TXD_MAXCNT_MAXCNT_Max (0x7FFFUL)      /*!< Max size of MAXCNT field.                                            */


/* TWIS_TXD_AMOUNT: Number of bytes transferred in the last TXD transaction */
  #define TWIS_TXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last TXD transaction */
  #define TWIS_TXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define TWIS_TXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                   */
  #define TWIS_TXD_AMOUNT_AMOUNT_Min (0x0001UL)      /*!< Min value of AMOUNT field.                                           */
  #define TWIS_TXD_AMOUNT_AMOUNT_Max (0x7FFFUL)      /*!< Max size of AMOUNT field.                                            */


/* TWIS_TXD_LIST: EasyDMA list type */
  #define TWIS_TXD_LIST_ResetValue (0x00000000UL)    /*!< Reset value of LIST register.                                        */

/* LIST @Bits 0..1 : List type */
  #define TWIS_TXD_LIST_LIST_Pos (0UL)               /*!< Position of LIST field.                                              */
  #define TWIS_TXD_LIST_LIST_Msk (0x3UL << TWIS_TXD_LIST_LIST_Pos) /*!< Bit mask of LIST field.                                */
  #define TWIS_TXD_LIST_LIST_Min (0x0UL)             /*!< Min enumerator value of LIST field.                                  */
  #define TWIS_TXD_LIST_LIST_Max (0x1UL)             /*!< Max enumerator value of LIST field.                                  */
  #define TWIS_TXD_LIST_LIST_Disabled (0x0UL)        /*!< Disable EasyDMA list                                                 */
  #define TWIS_TXD_LIST_LIST_ArrayList (0x1UL)       /*!< Use array list                                                       */



