tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* EVENTS_RXSTARTED @Bit 0 : Receive sequence started */
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos (0UL) /*!< Position of EVENTS_RXSTARTED field.                            */
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk (0x1UL << TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_RXSTARTED field.*/
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXSTARTED field.              */
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXSTARTED field.              */
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated (0x1UL) /*!< Event generated                                        */


/* TWIS_EVENTS_TXSTARTED: Transmit sequence started */
  #define TWIS_EVENTS_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXSTARTED register.                       */

/* EVENTS_TXSTARTED @Bit 0 : Transmit sequence started */
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos (0UL) /*!< Position of EVENTS_TXSTARTED field.                            */
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk (0x1UL << TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_TXSTARTED field.*/
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXSTARTED field.              */
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXSTARTED field.              */
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated (0x1UL) /*!< Event generated                                        */


/* TWIS_EVENTS_WRITE: Write command received */
  #define TWIS_EVENTS_WRITE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITE register.                               */

/* EVENTS_WRITE @Bit 0 : Write command received */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos (0UL)   /*!< Position of EVENTS_WRITE field.                                      */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Msk (0x1UL << TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos) /*!< Bit mask of EVENTS_WRITE field.*/
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITE field.                          */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITE field.                          */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Generated (0x1UL) /*!< Event generated                                                */


/* TWIS_EVENTS_READ: Read command received */
  #define TWIS_EVENTS_READ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READ register.                                 */

/* EVENTS_READ @Bit 0 : Read command received */
  #define TWIS_EVENTS_READ_EVENTS_READ_Pos (0UL)     /*!< Position of EVENTS_READ field.                                       */
  #define TWIS_EVENTS_READ_EVENTS_READ_Msk (0x1UL << TWIS_EVENTS_READ_EVENTS_READ_Pos) /*!< Bit mask of EVENTS_READ field.     */
  #define TWIS_EVENTS_READ_EVENTS_READ_Min (0x0UL)   /*!< Min enumerator value of EVENTS_READ field.                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_Max (0x1UL)   /*!< Max enumerator value of EVENTS_READ field.                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define TWIS_EVENTS_READ_EVENTS_READ_Generated (0x1UL) /*!< Event generated                                                  */


/* TWIS_EVENTS_RXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define TWIS_EVENTS_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXBUSERROR register.                     */

/* EVENTS_RXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos (0UL) /*!< Position of EVENTS_RXBUSERROR field.                         */
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Msk (0x1UL << TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_RXBUSERROR field.*/
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXBUSERROR field.           */
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXBUSERROR field.           */
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define TWIS_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* TWIS_EVENTS_TXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define TWIS_EVENTS_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXBUSERROR register.                     */

/* EVENTS_TXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos (0UL) /*!< Position of EVENTS_TXBUSERROR field.                         */
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Msk (0x1UL << TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_TXBUSERROR field.*/
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXBUSERROR field.           */
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXBUSERROR field.           */
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define TWIS_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Generated (0x1UL) /*!< Event generated                                      */


/* TWIS_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TWIS_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_STOPPED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_STOPPED_EN_Msk (0x1UL << TWIS_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TWIS_PUBLISH_STOPPED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STOPPED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_STOPPED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_STOPPED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWIS_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWIS_PUBLISH_ERROR_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWIS_PUBLISH_ERROR_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_ERROR_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_ERROR_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_ERROR_EN_Msk (0x1UL << TWIS_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWIS_PUBLISH_ERROR_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_ERROR_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_ERROR_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_ERROR_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_RXSTARTED: Publish configuration for event RXSTARTED */
  #define TWIS_PUBLISH_RXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXSTARTED register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RXSTARTED will publish to */
  #define TWIS_PUBLISH_RXSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_RXSTARTED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_RXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIS_PUBLISH_RXSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_RXSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_RXSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_RXSTARTED_EN_Msk (0x1UL << TWIS_PUBLISH_RXSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIS_PUBLISH_RXSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_RXSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_RXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_RXSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_TXSTARTED: Publish configuration for event TXSTARTED */
  #define TWIS_PUBLISH_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXSTARTED register.                     */

