tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event TXSTARTED will publish to */
  #define TWIS_PUBLISH_TXSTARTED_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_TXSTARTED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_TXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define TWIS_PUBLISH_TXSTARTED_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_TXSTARTED_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_TXSTARTED_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_TXSTARTED_EN_Msk (0x1UL << TWIS_PUBLISH_TXSTARTED_EN_Pos) /*!< Bit mask of EN field.                    */
  #define TWIS_PUBLISH_TXSTARTED_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_TXSTARTED_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_TXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_TXSTARTED_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_WRITE: Publish configuration for event WRITE */
  #define TWIS_PUBLISH_WRITE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WRITE register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event WRITE will publish to */
  #define TWIS_PUBLISH_WRITE_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_WRITE_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_WRITE_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWIS_PUBLISH_WRITE_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_WRITE_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_WRITE_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_WRITE_EN_Msk (0x1UL << TWIS_PUBLISH_WRITE_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWIS_PUBLISH_WRITE_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_WRITE_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_WRITE_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_WRITE_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_READ: Publish configuration for event READ */
  #define TWIS_PUBLISH_READ_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READ register.                               */

/* CHIDX @Bits 0..7 : DPPI channel that event READ will publish to */
  #define TWIS_PUBLISH_READ_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_READ_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_READ_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define TWIS_PUBLISH_READ_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_READ_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_READ_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_READ_EN_Msk (0x1UL << TWIS_PUBLISH_READ_EN_Pos) /*!< Bit mask of EN field.                              */
  #define TWIS_PUBLISH_READ_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_READ_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_READ_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define TWIS_PUBLISH_READ_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_RXBUSERROR: Publish configuration for event RXBUSERROR */
  #define TWIS_PUBLISH_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event RXBUSERROR will publish to */
  #define TWIS_PUBLISH_RXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_RXBUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_RXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TWIS_PUBLISH_RXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_RXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_RXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TWIS_PUBLISH_RXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_TXBUSERROR: Publish configuration for event TXBUSERROR */
  #define TWIS_PUBLISH_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXBUSERROR register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that event TXBUSERROR will publish to */
  #define TWIS_PUBLISH_TXBUSERROR_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_TXBUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_TXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TWIS_PUBLISH_TXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_TXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_TXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TWIS_PUBLISH_TXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TWIS_SHORTS: Shortcuts between local events and tasks */
  #define TWIS_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* WRITE_SUSPEND @Bit 13 : Shortcut between event WRITE and task SUSPEND */
  #define TWIS_SHORTS_WRITE_SUSPEND_Pos (13UL)       /*!< Position of WRITE_SUSPEND field.                                     */
  #define TWIS_SHORTS_WRITE_SUSPEND_Msk (0x1UL << TWIS_SHORTS_WRITE_SUSPEND_Pos) /*!< Bit mask of WRITE_SUSPEND field.         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Min (0x0UL)      /*!< Min enumerator value of WRITE_SUSPEND field.                         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Max (0x1UL)      /*!< Max enumerator value of WRITE_SUSPEND field.                         */
  #define TWIS_SHORTS_WRITE_SUSPEND_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define TWIS_SHORTS_WRITE_SUSPEND_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* READ_SUSPEND @Bit 14 : Shortcut between event READ and task SUSPEND */
  #define TWIS_SHORTS_READ_SUSPEND_Pos (14UL)        /*!< Position of READ_SUSPEND field.                                      */
  #define TWIS_SHORTS_READ_SUSPEND_Msk (0x1UL << TWIS_SHORTS_READ_SUSPEND_Pos) /*!< Bit mask of READ_SUSPEND field.            */
  #define TWIS_SHORTS_READ_SUSPEND_Min (0x0UL)       /*!< Min enumerator value of READ_SUSPEND field.                          */
  #define TWIS_SHORTS_READ_SUSPEND_Max (0x1UL)       /*!< Max enumerator value of READ_SUSPEND field.                          */
  #define TWIS_SHORTS_READ_SUSPEND_Disabled (0x0UL)  /*!< Disable shortcut                                                     */
  #define TWIS_SHORTS_READ_SUSPEND_Enabled (0x1UL)   /*!< Enable shortcut                                                      */


/* TWIS_INTEN: Enable or disable interrupt */
  #define TWIS_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

