tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define TWIS_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define TWIS_INTEN_STOPPED_Msk (0x1UL << TWIS_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define TWIS_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIS_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 9 : Enable or disable interrupt for event ERROR */
  #define TWIS_INTEN_ERROR_Pos (9UL)                 /*!< Position of ERROR field.                                             */
  #define TWIS_INTEN_ERROR_Msk (0x1UL << TWIS_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define TWIS_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* RXSTARTED @Bit 19 : Enable or disable interrupt for event RXSTARTED */
  #define TWIS_INTEN_RXSTARTED_Pos (19UL)            /*!< Position of RXSTARTED field.                                         */
  #define TWIS_INTEN_RXSTARTED_Msk (0x1UL << TWIS_INTEN_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                       */
  #define TWIS_INTEN_RXSTARTED_Min (0x0UL)           /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIS_INTEN_RXSTARTED_Max (0x1UL)           /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIS_INTEN_RXSTARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIS_INTEN_RXSTARTED_Enabled (0x1UL)       /*!< Enable                                                               */

/* TXSTARTED @Bit 20 : Enable or disable interrupt for event TXSTARTED */
  #define TWIS_INTEN_TXSTARTED_Pos (20UL)            /*!< Position of TXSTARTED field.                                         */
  #define TWIS_INTEN_TXSTARTED_Msk (0x1UL << TWIS_INTEN_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                       */
  #define TWIS_INTEN_TXSTARTED_Min (0x0UL)           /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIS_INTEN_TXSTARTED_Max (0x1UL)           /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIS_INTEN_TXSTARTED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TWIS_INTEN_TXSTARTED_Enabled (0x1UL)       /*!< Enable                                                               */

/* WRITE @Bit 25 : Enable or disable interrupt for event WRITE */
  #define TWIS_INTEN_WRITE_Pos (25UL)                /*!< Position of WRITE field.                                             */
  #define TWIS_INTEN_WRITE_Msk (0x1UL << TWIS_INTEN_WRITE_Pos) /*!< Bit mask of WRITE field.                                   */
  #define TWIS_INTEN_WRITE_Min (0x0UL)               /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Max (0x1UL)               /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_WRITE_Enabled (0x1UL)           /*!< Enable                                                               */

/* READ @Bit 26 : Enable or disable interrupt for event READ */
  #define TWIS_INTEN_READ_Pos (26UL)                 /*!< Position of READ field.                                              */
  #define TWIS_INTEN_READ_Msk (0x1UL << TWIS_INTEN_READ_Pos) /*!< Bit mask of READ field.                                      */
  #define TWIS_INTEN_READ_Min (0x0UL)                /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Max (0x1UL)                /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Disabled (0x0UL)           /*!< Disable                                                              */
  #define TWIS_INTEN_READ_Enabled (0x1UL)            /*!< Enable                                                               */

/* RXBUSERROR @Bit 29 : Enable or disable interrupt for event RXBUSERROR */
  #define TWIS_INTEN_RXBUSERROR_Pos (29UL)           /*!< Position of RXBUSERROR field.                                        */
  #define TWIS_INTEN_RXBUSERROR_Msk (0x1UL << TWIS_INTEN_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.                    */
  #define TWIS_INTEN_RXBUSERROR_Min (0x0UL)          /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTEN_RXBUSERROR_Max (0x1UL)          /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTEN_RXBUSERROR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_RXBUSERROR_Enabled (0x1UL)      /*!< Enable                                                               */

/* TXBUSERROR @Bit 30 : Enable or disable interrupt for event TXBUSERROR */
  #define TWIS_INTEN_TXBUSERROR_Pos (30UL)           /*!< Position of TXBUSERROR field.                                        */
  #define TWIS_INTEN_TXBUSERROR_Msk (0x1UL << TWIS_INTEN_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.                    */
  #define TWIS_INTEN_TXBUSERROR_Min (0x0UL)          /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTEN_TXBUSERROR_Max (0x1UL)          /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTEN_TXBUSERROR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_TXBUSERROR_Enabled (0x1UL)      /*!< Enable                                                               */


/* TWIS_INTENSET: Enable interrupt */
  #define TWIS_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIS_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIS_INTENSET_STOPPED_Msk (0x1UL << TWIS_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIS_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIS_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to enable interrupt for event ERROR */
  #define TWIS_INTENSET_ERROR_Pos (9UL)              /*!< Position of ERROR field.                                             */
  #define TWIS_INTENSET_ERROR_Msk (0x1UL << TWIS_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIS_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
  #define TWIS_INTENSET_RXSTARTED_Pos (19UL)         /*!< Position of RXSTARTED field.                                         */
  #define TWIS_INTENSET_RXSTARTED_Msk (0x1UL << TWIS_INTENSET_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                 */
  #define TWIS_INTENSET_RXSTARTED_Min (0x0UL)        /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIS_INTENSET_RXSTARTED_Max (0x1UL)        /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIS_INTENSET_RXSTARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIS_INTENSET_RXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_RXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

