tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXSTARTED @Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
  #define TWIS_INTENSET_TXSTARTED_Pos (20UL)         /*!< Position of TXSTARTED field.                                         */
  #define TWIS_INTENSET_TXSTARTED_Msk (0x1UL << TWIS_INTENSET_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                 */
  #define TWIS_INTENSET_TXSTARTED_Min (0x0UL)        /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIS_INTENSET_TXSTARTED_Max (0x1UL)        /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIS_INTENSET_TXSTARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define TWIS_INTENSET_TXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_TXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* WRITE @Bit 25 : Write '1' to enable interrupt for event WRITE */
  #define TWIS_INTENSET_WRITE_Pos (25UL)             /*!< Position of WRITE field.                                             */
  #define TWIS_INTENSET_WRITE_Msk (0x1UL << TWIS_INTENSET_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define TWIS_INTENSET_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_WRITE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_WRITE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* READ @Bit 26 : Write '1' to enable interrupt for event READ */
  #define TWIS_INTENSET_READ_Pos (26UL)              /*!< Position of READ field.                                              */
  #define TWIS_INTENSET_READ_Msk (0x1UL << TWIS_INTENSET_READ_Pos) /*!< Bit mask of READ field.                                */
  #define TWIS_INTENSET_READ_Min (0x0UL)             /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTENSET_READ_Max (0x1UL)             /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTENSET_READ_Set (0x1UL)             /*!< Enable                                                               */
  #define TWIS_INTENSET_READ_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_READ_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to enable interrupt for event RXBUSERROR */
  #define TWIS_INTENSET_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define TWIS_INTENSET_RXBUSERROR_Msk (0x1UL << TWIS_INTENSET_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define TWIS_INTENSET_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTENSET_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTENSET_RXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIS_INTENSET_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to enable interrupt for event TXBUSERROR */
  #define TWIS_INTENSET_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define TWIS_INTENSET_TXBUSERROR_Msk (0x1UL << TWIS_INTENSET_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define TWIS_INTENSET_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTENSET_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTENSET_TXBUSERROR_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIS_INTENSET_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TWIS_INTENCLR: Disable interrupt */
  #define TWIS_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWIS_INTENCLR_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIS_INTENCLR_STOPPED_Msk (0x1UL << TWIS_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIS_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWIS_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to disable interrupt for event ERROR */
  #define TWIS_INTENCLR_ERROR_Pos (9UL)              /*!< Position of ERROR field.                                             */
  #define TWIS_INTENCLR_ERROR_Msk (0x1UL << TWIS_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIS_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIS_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
  #define TWIS_INTENCLR_RXSTARTED_Pos (19UL)         /*!< Position of RXSTARTED field.                                         */
  #define TWIS_INTENCLR_RXSTARTED_Msk (0x1UL << TWIS_INTENCLR_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                 */
  #define TWIS_INTENCLR_RXSTARTED_Min (0x0UL)        /*!< Min enumerator value of RXSTARTED field.                             */
  #define TWIS_INTENCLR_RXSTARTED_Max (0x1UL)        /*!< Max enumerator value of RXSTARTED field.                             */
  #define TWIS_INTENCLR_RXSTARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIS_INTENCLR_RXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_RXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TXSTARTED @Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
  #define TWIS_INTENCLR_TXSTARTED_Pos (20UL)         /*!< Position of TXSTARTED field.                                         */
  #define TWIS_INTENCLR_TXSTARTED_Msk (0x1UL << TWIS_INTENCLR_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                 */
  #define TWIS_INTENCLR_TXSTARTED_Min (0x0UL)        /*!< Min enumerator value of TXSTARTED field.                             */
  #define TWIS_INTENCLR_TXSTARTED_Max (0x1UL)        /*!< Max enumerator value of TXSTARTED field.                             */
  #define TWIS_INTENCLR_TXSTARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define TWIS_INTENCLR_TXSTARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_TXSTARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

