tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* WRITE @Bit 25 : Write '1' to disable interrupt for event WRITE */
  #define TWIS_INTENCLR_WRITE_Pos (25UL)             /*!< Position of WRITE field.                                             */
  #define TWIS_INTENCLR_WRITE_Msk (0x1UL << TWIS_INTENCLR_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define TWIS_INTENCLR_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTENCLR_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTENCLR_WRITE_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIS_INTENCLR_WRITE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_WRITE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* READ @Bit 26 : Write '1' to disable interrupt for event READ */
  #define TWIS_INTENCLR_READ_Pos (26UL)              /*!< Position of READ field.                                              */
  #define TWIS_INTENCLR_READ_Msk (0x1UL << TWIS_INTENCLR_READ_Pos) /*!< Bit mask of READ field.                                */
  #define TWIS_INTENCLR_READ_Min (0x0UL)             /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTENCLR_READ_Max (0x1UL)             /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTENCLR_READ_Clear (0x1UL)           /*!< Disable                                                              */
  #define TWIS_INTENCLR_READ_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_READ_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to disable interrupt for event RXBUSERROR */
  #define TWIS_INTENCLR_RXBUSERROR_Pos (29UL)        /*!< Position of RXBUSERROR field.                                        */
  #define TWIS_INTENCLR_RXBUSERROR_Msk (0x1UL << TWIS_INTENCLR_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.              */
  #define TWIS_INTENCLR_RXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTENCLR_RXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of RXBUSERROR field.                            */
  #define TWIS_INTENCLR_RXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIS_INTENCLR_RXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_RXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to disable interrupt for event TXBUSERROR */
  #define TWIS_INTENCLR_TXBUSERROR_Pos (30UL)        /*!< Position of TXBUSERROR field.                                        */
  #define TWIS_INTENCLR_TXBUSERROR_Msk (0x1UL << TWIS_INTENCLR_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.              */
  #define TWIS_INTENCLR_TXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTENCLR_TXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of TXBUSERROR field.                            */
  #define TWIS_INTENCLR_TXBUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define TWIS_INTENCLR_TXBUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIS_INTENCLR_TXBUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TWIS_ERRORSRC: Error source */
  #define TWIS_ERRORSRC_ResetValue (0x00000000UL)    /*!< Reset value of ERRORSRC register.                                    */

/* OVERFLOW @Bit 0 : RX buffer overflow detected, and prevented */
  #define TWIS_ERRORSRC_OVERFLOW_Pos (0UL)           /*!< Position of OVERFLOW field.                                          */
  #define TWIS_ERRORSRC_OVERFLOW_Msk (0x1UL << TWIS_ERRORSRC_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                    */
  #define TWIS_ERRORSRC_OVERFLOW_Min (0x0UL)         /*!< Min enumerator value of OVERFLOW field.                              */
  #define TWIS_ERRORSRC_OVERFLOW_Max (0x1UL)         /*!< Max enumerator value of OVERFLOW field.                              */
  #define TWIS_ERRORSRC_OVERFLOW_NotDetected (0x0UL) /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_OVERFLOW_Detected (0x1UL)    /*!< Error occurred                                                       */

/* DNACK @Bit 2 : NACK sent after receiving a data byte */
  #define TWIS_ERRORSRC_DNACK_Pos (2UL)              /*!< Position of DNACK field.                                             */
  #define TWIS_ERRORSRC_DNACK_Msk (0x1UL << TWIS_ERRORSRC_DNACK_Pos) /*!< Bit mask of DNACK field.                             */
  #define TWIS_ERRORSRC_DNACK_Min (0x0UL)            /*!< Min enumerator value of DNACK field.                                 */
  #define TWIS_ERRORSRC_DNACK_Max (0x1UL)            /*!< Max enumerator value of DNACK field.                                 */
  #define TWIS_ERRORSRC_DNACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_DNACK_Received (0x1UL)       /*!< Error occurred                                                       */

/* OVERREAD @Bit 3 : TX buffer over-read detected, and prevented */
  #define TWIS_ERRORSRC_OVERREAD_Pos (3UL)           /*!< Position of OVERREAD field.                                          */
  #define TWIS_ERRORSRC_OVERREAD_Msk (0x1UL << TWIS_ERRORSRC_OVERREAD_Pos) /*!< Bit mask of OVERREAD field.                    */
  #define TWIS_ERRORSRC_OVERREAD_Min (0x0UL)         /*!< Min enumerator value of OVERREAD field.                              */
  #define TWIS_ERRORSRC_OVERREAD_Max (0x1UL)         /*!< Max enumerator value of OVERREAD field.                              */
  #define TWIS_ERRORSRC_OVERREAD_NotDetected (0x0UL) /*!< Error did not occur                                                  */
  #define TWIS_ERRORSRC_OVERREAD_Detected (0x1UL)    /*!< Error occurred                                                       */


/* TWIS_MATCH: Status register indicating which address had a match */
  #define TWIS_MATCH_ResetValue (0x00000000UL)       /*!< Reset value of MATCH register.                                       */

/* MATCH @Bit 0 : Indication of which address in ADDRESS that matched the incoming address */
  #define TWIS_MATCH_MATCH_Pos (0UL)                 /*!< Position of MATCH field.                                             */
  #define TWIS_MATCH_MATCH_Msk (0x1UL << TWIS_MATCH_MATCH_Pos) /*!< Bit mask of MATCH field.                                   */
  #define TWIS_MATCH_MATCH_Min (0x0UL)               /*!< Min value of MATCH field.                                            */
  #define TWIS_MATCH_MATCH_Max (0x1UL)               /*!< Max size of MATCH field.                                             */


