tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TWIS_ENABLE: Enable TWIS */
  #define TWIS_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable TWIS */
  #define TWIS_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define TWIS_ENABLE_ENABLE_Msk (0xFUL << TWIS_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define TWIS_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define TWIS_ENABLE_ENABLE_Max (0x9UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define TWIS_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable TWIS                                                         */
  #define TWIS_ENABLE_ENABLE_Enabled (0x9UL)         /*!< Enable TWIS                                                          */


/* TWIS_ADDRESS: TWI slave address n */
  #define TWIS_ADDRESS_MaxCount (2UL)                /*!< Max size of ADDRESS[2] array.                                        */
  #define TWIS_ADDRESS_MaxIndex (1UL)                /*!< Max index of ADDRESS[2] array.                                       */
  #define TWIS_ADDRESS_MinIndex (0UL)                /*!< Min index of ADDRESS[2] array.                                       */
  #define TWIS_ADDRESS_ResetValue (0x00000000UL)     /*!< Reset value of ADDRESS[2] register.                                  */

/* ADDRESS @Bits 0..6 : TWI slave address */
  #define TWIS_ADDRESS_ADDRESS_Pos (0UL)             /*!< Position of ADDRESS field.                                           */
  #define TWIS_ADDRESS_ADDRESS_Msk (0x7FUL << TWIS_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                        */


/* TWIS_CONFIG: Configuration register for the address match mechanism */
  #define TWIS_CONFIG_ResetValue (0x00000001UL)      /*!< Reset value of CONFIG register.                                      */

/* ADDRESS0 @Bit 0 : Enable or disable address matching on ADDRESS[0] */
  #define TWIS_CONFIG_ADDRESS0_Pos (0UL)             /*!< Position of ADDRESS0 field.                                          */
  #define TWIS_CONFIG_ADDRESS0_Msk (0x1UL << TWIS_CONFIG_ADDRESS0_Pos) /*!< Bit mask of ADDRESS0 field.                        */
  #define TWIS_CONFIG_ADDRESS0_Min (0x0UL)           /*!< Min enumerator value of ADDRESS0 field.                              */
  #define TWIS_CONFIG_ADDRESS0_Max (0x1UL)           /*!< Max enumerator value of ADDRESS0 field.                              */
  #define TWIS_CONFIG_ADDRESS0_Disabled (0x0UL)      /*!< Disabled                                                             */
  #define TWIS_CONFIG_ADDRESS0_Enabled (0x1UL)       /*!< Enabled                                                              */

/* ADDRESS1 @Bit 1 : Enable or disable address matching on ADDRESS[1] */
  #define TWIS_CONFIG_ADDRESS1_Pos (1UL)             /*!< Position of ADDRESS1 field.                                          */
  #define TWIS_CONFIG_ADDRESS1_Msk (0x1UL << TWIS_CONFIG_ADDRESS1_Pos) /*!< Bit mask of ADDRESS1 field.                        */
  #define TWIS_CONFIG_ADDRESS1_Min (0x0UL)           /*!< Min enumerator value of ADDRESS1 field.                              */
  #define TWIS_CONFIG_ADDRESS1_Max (0x1UL)           /*!< Max enumerator value of ADDRESS1 field.                              */
  #define TWIS_CONFIG_ADDRESS1_Disabled (0x0UL)      /*!< Disabled                                                             */
  #define TWIS_CONFIG_ADDRESS1_Enabled (0x1UL)       /*!< Enabled                                                              */


/* TWIS_ORC: Over-read character. Character sent out in case of an over-read of the transmit buffer. */
  #define TWIS_ORC_ResetValue (0x00000000UL)         /*!< Reset value of ORC register.                                         */

/* ORC @Bits 0..7 : Over-read character. Character sent out in case of an over-read of the transmit buffer. */
  #define TWIS_ORC_ORC_Pos (0UL)                     /*!< Position of ORC field.                                               */
  #define TWIS_ORC_ORC_Msk (0xFFUL << TWIS_ORC_ORC_Pos) /*!< Bit mask of ORC field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           UARTE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct UARTE_PSEL ==================================================== */
/**
  * @brief PSEL [UARTE_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RTS;                               /*!< (@ 0x00000000) Pin select for RTS signal                             */
  __IOM uint32_t  TXD;                               /*!< (@ 0x00000004) Pin select for TXD signal                             */
  __IOM uint32_t  CTS;                               /*!< (@ 0x00000008) Pin select for CTS signal                             */
  __IOM uint32_t  RXD;                               /*!< (@ 0x0000000C) Pin select for RXD signal                             */
} NRF_UARTE_PSEL_Type;                               /*!< Size = 16 (0x010)                                                    */

/* UARTE_PSEL_RTS: Pin select for RTS signal */
  #define UARTE_PSEL_RTS_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RTS register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_RTS_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define UARTE_PSEL_RTS_PIN_Msk (0x1FUL << UARTE_PSEL_RTS_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define UARTE_PSEL_RTS_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define UARTE_PSEL_RTS_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_RTS_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define UARTE_PSEL_RTS_PORT_Msk (0xFUL << UARTE_PSEL_RTS_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define UARTE_PSEL_RTS_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define UARTE_PSEL_RTS_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_RTS_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define UARTE_PSEL_RTS_CONNECT_Msk (0x1UL << UARTE_PSEL_RTS_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define UARTE_PSEL_RTS_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_RTS_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_RTS_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define UARTE_PSEL_RTS_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* UARTE_PSEL_TXD: Pin select for TXD signal */
  #define UARTE_PSEL_TXD_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of TXD register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_TXD_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define UARTE_PSEL_TXD_PIN_Msk (0x1FUL << UARTE_PSEL_TXD_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define UARTE_PSEL_TXD_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define UARTE_PSEL_TXD_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_TXD_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define UARTE_PSEL_TXD_PORT_Msk (0xFUL << UARTE_PSEL_TXD_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define UARTE_PSEL_TXD_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define UARTE_PSEL_TXD_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_TXD_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define UARTE_PSEL_TXD_CONNECT_Msk (0x1UL << UARTE_PSEL_TXD_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define UARTE_PSEL_TXD_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_TXD_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_TXD_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define UARTE_PSEL_TXD_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* UARTE_PSEL_CTS: Pin select for CTS signal */
  #define UARTE_PSEL_CTS_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of CTS register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_CTS_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define UARTE_PSEL_CTS_PIN_Msk (0x1FUL << UARTE_PSEL_CTS_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define UARTE_PSEL_CTS_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define UARTE_PSEL_CTS_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_CTS_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define UARTE_PSEL_CTS_PORT_Msk (0xFUL << UARTE_PSEL_CTS_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define UARTE_PSEL_CTS_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define UARTE_PSEL_CTS_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_CTS_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define UARTE_PSEL_CTS_CONNECT_Msk (0x1UL << UARTE_PSEL_CTS_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define UARTE_PSEL_CTS_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_CTS_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_CTS_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define UARTE_PSEL_CTS_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* UARTE_PSEL_RXD: Pin select for RXD signal */
  #define UARTE_PSEL_RXD_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RXD register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_RXD_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define UARTE_PSEL_RXD_PIN_Msk (0x1FUL << UARTE_PSEL_RXD_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define UARTE_PSEL_RXD_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define UARTE_PSEL_RXD_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_RXD_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define UARTE_PSEL_RXD_PORT_Msk (0xFUL << UARTE_PSEL_RXD_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define UARTE_PSEL_RXD_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define UARTE_PSEL_RXD_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_RXD_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define UARTE_PSEL_RXD_CONNECT_Msk (0x1UL << UARTE_PSEL_RXD_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define UARTE_PSEL_RXD_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_RXD_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define UARTE_PSEL_RXD_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define UARTE_PSEL_RXD_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */



/* ==================================================== Struct UARTE_RXD ===================================================== */
/**
  * @brief RXD [UARTE_RXD] RXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in receive buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
} NRF_UARTE_RXD_Type;                                /*!< Size = 12 (0x00C)                                                    */

/* UARTE_RXD_PTR: Data pointer */
  #define UARTE_RXD_PTR_ResetValue (0x00000000UL)    /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define UARTE_RXD_PTR_PTR_Pos (0UL)                /*!< Position of PTR field.                                               */
  #define UARTE_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                            */


