tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UARTE_RXD_MAXCNT: Maximum number of bytes in receive buffer */
  #define UARTE_RXD_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in receive buffer */
  #define UARTE_RXD_MAXCNT_MAXCNT_Pos (0UL)          /*!< Position of MAXCNT field.                                            */
  #define UARTE_RXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                 */
  #define UARTE_RXD_MAXCNT_MAXCNT_Min (0x0001UL)     /*!< Min value of MAXCNT field.                                           */
  #define UARTE_RXD_MAXCNT_MAXCNT_Max (0x7FFFUL)     /*!< Max size of MAXCNT field.                                            */


/* UARTE_RXD_AMOUNT: Number of bytes transferred in the last transaction */
  #define UARTE_RXD_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction */
  #define UARTE_RXD_AMOUNT_AMOUNT_Pos (0UL)          /*!< Position of AMOUNT field.                                            */
  #define UARTE_RXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                 */
  #define UARTE_RXD_AMOUNT_AMOUNT_Min (0x0001UL)     /*!< Min value of AMOUNT field.                                           */
  #define UARTE_RXD_AMOUNT_AMOUNT_Max (0x7FFFUL)     /*!< Max size of AMOUNT field.                                            */



/* ==================================================== Struct UARTE_TXD ===================================================== */
/**
  * @brief TXD [UARTE_TXD] TXD EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000008) Number of bytes transferred in the last transaction   */
} NRF_UARTE_TXD_Type;                                /*!< Size = 12 (0x00C)                                                    */

/* UARTE_TXD_PTR: Data pointer */
  #define UARTE_TXD_PTR_ResetValue (0x00000000UL)    /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Data pointer */
  #define UARTE_TXD_PTR_PTR_Pos (0UL)                /*!< Position of PTR field.                                               */
  #define UARTE_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                            */


/* UARTE_TXD_MAXCNT: Maximum number of bytes in transmit buffer */
  #define UARTE_TXD_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..14 : Maximum number of bytes in transmit buffer */
  #define UARTE_TXD_MAXCNT_MAXCNT_Pos (0UL)          /*!< Position of MAXCNT field.                                            */
  #define UARTE_TXD_MAXCNT_MAXCNT_Msk (0x7FFFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                 */
  #define UARTE_TXD_MAXCNT_MAXCNT_Min (0x0001UL)     /*!< Min value of MAXCNT field.                                           */
  #define UARTE_TXD_MAXCNT_MAXCNT_Max (0x7FFFUL)     /*!< Max size of MAXCNT field.                                            */


/* UARTE_TXD_AMOUNT: Number of bytes transferred in the last transaction */
  #define UARTE_TXD_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction */
  #define UARTE_TXD_AMOUNT_AMOUNT_Pos (0UL)          /*!< Position of AMOUNT field.                                            */
  #define UARTE_TXD_AMOUNT_AMOUNT_Msk (0x7FFFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                 */
  #define UARTE_TXD_AMOUNT_AMOUNT_Min (0x0001UL)     /*!< Min value of AMOUNT field.                                           */
  #define UARTE_TXD_AMOUNT_AMOUNT_Max (0x7FFFUL)     /*!< Max size of AMOUNT field.                                            */



/* =================================================== Struct UARTE_DMA_RX =================================================== */
/**
  * @brief RX [UARTE_DMA_RX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_UARTE_DMA_RX_Type;                             /*!< Size = 8 (0x008)                                                     */

/* UARTE_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


/* UARTE_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct UARTE_DMA_TX =================================================== */
/**
  * @brief TX [UARTE_DMA_TX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_UARTE_DMA_TX_Type;                             /*!< Size = 8 (0x008)                                                     */

/* UARTE_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.         */

/* ENABLE @Bit 0 : (unspecified) */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                     */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                       */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                */
  #define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                  */


