tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UARTE_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                 */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ==================================================== Struct UARTE_DMA ===================================================== */
/**
  * @brief DMA [UARTE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_UARTE_DMA_RX_Type RX;                    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UARTE_DMA_TX_Type TX;                    /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_UARTE_DMA_Type;                                /*!< Size = 16 (0x010)                                                    */

/* ====================================================== Struct UARTE ======================================================= */
/**
  * @brief UART with EasyDMA
  */
  typedef struct {                                   /*!< UARTE Structure                                                      */
    __OM uint32_t TASKS_STARTRX;                     /*!< (@ 0x00000000) Start UART receiver                                   */
    __OM uint32_t TASKS_STOPRX;                      /*!< (@ 0x00000004) Stop UART receiver                                    */
    __OM uint32_t TASKS_STARTTX;                     /*!< (@ 0x00000008) Start UART transmitter                                */
    __OM uint32_t TASKS_STOPTX;                      /*!< (@ 0x0000000C) Stop UART transmitter                                 */
    __IM uint32_t RESERVED[7];
    __OM uint32_t TASKS_FLUSHRX;                     /*!< (@ 0x0000002C) Flush RX FIFO into RX buffer                          */
    __IM uint32_t RESERVED1[20];
    __IOM uint32_t SUBSCRIBE_STARTRX;                /*!< (@ 0x00000080) Subscribe configuration for task STARTRX              */
    __IOM uint32_t SUBSCRIBE_STOPRX;                 /*!< (@ 0x00000084) Subscribe configuration for task STOPRX               */
    __IOM uint32_t SUBSCRIBE_STARTTX;                /*!< (@ 0x00000088) Subscribe configuration for task STARTTX              */
    __IOM uint32_t SUBSCRIBE_STOPTX;                 /*!< (@ 0x0000008C) Subscribe configuration for task STOPTX               */
    __IM uint32_t RESERVED2[7];
    __IOM uint32_t SUBSCRIBE_FLUSHRX;                /*!< (@ 0x000000AC) Subscribe configuration for task FLUSHRX              */
    __IM uint32_t RESERVED3[20];
    __IOM uint32_t EVENTS_CTS;                       /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.            */
    __IOM uint32_t EVENTS_NCTS;                      /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.     */
    __IOM uint32_t EVENTS_RXDRDY;                    /*!< (@ 0x00000108) Data received in RXD (but potentially not yet
                                                                         transferred to Data RAM)*/
    __IM uint32_t RESERVED4;
    __IOM uint32_t EVENTS_ENDRX;                     /*!< (@ 0x00000110) Receive buffer is filled up                           */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t EVENTS_TXDRDY;                    /*!< (@ 0x0000011C) Data sent from TXD                                    */
    __IOM uint32_t EVENTS_ENDTX;                     /*!< (@ 0x00000120) Last TX byte transmitted                              */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000124) Error detected                                        */
    __IM uint32_t RESERVED6[7];
    __IOM uint32_t EVENTS_RXTO;                      /*!< (@ 0x00000144) Receiver timeout                                      */
    __IM uint32_t RESERVED7;
    __IOM uint32_t EVENTS_RXSTARTED;                 /*!< (@ 0x0000014C) UART receiver has started                             */
    __IOM uint32_t EVENTS_TXSTARTED;                 /*!< (@ 0x00000150) UART transmitter has started                          */
    __IM uint32_t RESERVED8;
    __IOM uint32_t EVENTS_TXSTOPPED;                 /*!< (@ 0x00000158) Transmitter stopped                                   */
    __IM uint32_t RESERVED9[6];
    __IOM uint32_t EVENTS_RXBUSERROR;                /*!< (@ 0x00000174) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IOM uint32_t EVENTS_TXBUSERROR;                /*!< (@ 0x00000178) This event is generated if an error occurs during the
                                                                         bus transfer.*/
    __IM uint32_t RESERVED10;
    __IOM uint32_t PUBLISH_CTS;                      /*!< (@ 0x00000180) Publish configuration for event CTS                   */
    __IOM uint32_t PUBLISH_NCTS;                     /*!< (@ 0x00000184) Publish configuration for event NCTS                  */
    __IOM uint32_t PUBLISH_RXDRDY;                   /*!< (@ 0x00000188) Publish configuration for event RXDRDY                */
    __IM uint32_t RESERVED11;
    __IOM uint32_t PUBLISH_ENDRX;                    /*!< (@ 0x00000190) Publish configuration for event ENDRX                 */
    __IM uint32_t RESERVED12[2];
    __IOM uint32_t PUBLISH_TXDRDY;                   /*!< (@ 0x0000019C) Publish configuration for event TXDRDY                */
    __IOM uint32_t PUBLISH_ENDTX;                    /*!< (@ 0x000001A0) Publish configuration for event ENDTX                 */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x000001A4) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED13[7];
    __IOM uint32_t PUBLISH_RXTO;                     /*!< (@ 0x000001C4) Publish configuration for event RXTO                  */
    __IM uint32_t RESERVED14;
    __IOM uint32_t PUBLISH_RXSTARTED;                /*!< (@ 0x000001CC) Publish configuration for event RXSTARTED             */
    __IOM uint32_t PUBLISH_TXSTARTED;                /*!< (@ 0x000001D0) Publish configuration for event TXSTARTED             */
    __IM uint32_t RESERVED15;
    __IOM uint32_t PUBLISH_TXSTOPPED;                /*!< (@ 0x000001D8) Publish configuration for event TXSTOPPED             */
    __IM uint32_t RESERVED16[6];
    __IOM uint32_t PUBLISH_RXBUSERROR;               /*!< (@ 0x000001F4) Publish configuration for event RXBUSERROR            */
    __IOM uint32_t PUBLISH_TXBUSERROR;               /*!< (@ 0x000001F8) Publish configuration for event TXBUSERROR            */
    __IM uint32_t RESERVED17;
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED18[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED19[93];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x00000480) Error source                                          */
    __IM uint32_t RESERVED20[31];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable UART                                           */
    __IM uint32_t RESERVED21;
    __IOM NRF_UARTE_PSEL_Type PSEL;                  /*!< (@ 0x00000508) (unspecified)                                         */
    __IM uint32_t RESERVED22[3];
    __IOM uint32_t BAUDRATE;                         /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED23[3];
    __IOM NRF_UARTE_RXD_Type RXD;                    /*!< (@ 0x00000534) RXD EasyDMA channel                                   */
    __IM uint32_t RESERVED24;
    __IOM NRF_UARTE_TXD_Type TXD;                    /*!< (@ 0x00000544) TXD EasyDMA channel                                   */
    __IM uint32_t RESERVED25[7];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000056C) Configuration of parity and hardware flow control     */
    __IM uint32_t RESERVED26[16];
    __IOM NRF_UARTE_DMA_Type DMA;                    /*!< (@ 0x000005B0) (unspecified)                                         */
  } NRF_UARTE_Type;                                  /*!< Size = 1472 (0x5C0)                                                  */

/* UARTE_TASKS_STARTRX: Start UART receiver */
  #define UARTE_TASKS_STARTRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTRX register.                            */

/* TASKS_STARTRX @Bit 0 : Start UART receiver */
  #define UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos (0UL) /*!< Position of TASKS_STARTRX field.                                    */
  #define UARTE_TASKS_STARTRX_TASKS_STARTRX_Msk (0x1UL << UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos) /*!< Bit mask of TASKS_STARTRX
                                                                            field.*/
  #define UARTE_TASKS_STARTRX_TASKS_STARTRX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTRX field.                      */
  #define UARTE_TASKS_STARTRX_TASKS_STARTRX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTRX field.                      */
  #define UARTE_TASKS_STARTRX_TASKS_STARTRX_Trigger (0x1UL) /*!< Trigger task                                                  */


/* UARTE_TASKS_STOPRX: Stop UART receiver */
  #define UARTE_TASKS_STOPRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPRX register.                              */

