tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TASKS_STOPRX @Bit 0 : Stop UART receiver */
  #define UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos (0UL)  /*!< Position of TASKS_STOPRX field.                                      */
  #define UARTE_TASKS_STOPRX_TASKS_STOPRX_Msk (0x1UL << UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos) /*!< Bit mask of TASKS_STOPRX
                                                                            field.*/
  #define UARTE_TASKS_STOPRX_TASKS_STOPRX_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPRX field.                         */
  #define UARTE_TASKS_STOPRX_TASKS_STOPRX_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPRX field.                         */
  #define UARTE_TASKS_STOPRX_TASKS_STOPRX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* UARTE_TASKS_STARTTX: Start UART transmitter */
  #define UARTE_TASKS_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTTX register.                            */

/* TASKS_STARTTX @Bit 0 : Start UART transmitter */
  #define UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL) /*!< Position of TASKS_STARTTX field.                                    */
  #define UARTE_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX
                                                                            field.*/
  #define UARTE_TASKS_STARTTX_TASKS_STARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTTX field.                      */
  #define UARTE_TASKS_STARTTX_TASKS_STARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTTX field.                      */
  #define UARTE_TASKS_STARTTX_TASKS_STARTTX_Trigger (0x1UL) /*!< Trigger task                                                  */


/* UARTE_TASKS_STOPTX: Stop UART transmitter */
  #define UARTE_TASKS_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPTX register.                              */

/* TASKS_STOPTX @Bit 0 : Stop UART transmitter */
  #define UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos (0UL)  /*!< Position of TASKS_STOPTX field.                                      */
  #define UARTE_TASKS_STOPTX_TASKS_STOPTX_Msk (0x1UL << UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos) /*!< Bit mask of TASKS_STOPTX
                                                                            field.*/
  #define UARTE_TASKS_STOPTX_TASKS_STOPTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPTX field.                         */
  #define UARTE_TASKS_STOPTX_TASKS_STOPTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPTX field.                         */
  #define UARTE_TASKS_STOPTX_TASKS_STOPTX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* UARTE_TASKS_FLUSHRX: Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSHRX register.                            */

/* TASKS_FLUSHRX @Bit 0 : Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos (0UL) /*!< Position of TASKS_FLUSHRX field.                                    */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Msk (0x1UL << UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos) /*!< Bit mask of TASKS_FLUSHRX
                                                                            field.*/
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Min (0x1UL) /*!< Min enumerator value of TASKS_FLUSHRX field.                      */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Max (0x1UL) /*!< Max enumerator value of TASKS_FLUSHRX field.                      */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Trigger (0x1UL) /*!< Trigger task                                                  */


/* UARTE_SUBSCRIBE_STARTRX: Subscribe configuration for task STARTRX */
  #define UARTE_SUBSCRIBE_STARTRX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTRX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTRX will subscribe to */
  #define UARTE_SUBSCRIBE_STARTRX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_STARTRX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_STARTRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_SUBSCRIBE_STARTRX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_STARTRX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_STARTRX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define UARTE_SUBSCRIBE_STARTRX_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* UARTE_SUBSCRIBE_STOPRX: Subscribe configuration for task STOPRX */
  #define UARTE_SUBSCRIBE_STOPRX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOPRX register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task STOPRX will subscribe to */
  #define UARTE_SUBSCRIBE_STOPRX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_STOPRX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_STOPRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define UARTE_SUBSCRIBE_STOPRX_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_STOPRX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_STOPRX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define UARTE_SUBSCRIBE_STOPRX_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* UARTE_SUBSCRIBE_STARTTX: Subscribe configuration for task STARTTX */
  #define UARTE_SUBSCRIBE_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTTX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTTX will subscribe to */
  #define UARTE_SUBSCRIBE_STARTTX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_STARTTX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_STARTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_SUBSCRIBE_STARTTX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_STARTTX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_STARTTX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define UARTE_SUBSCRIBE_STARTTX_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* UARTE_SUBSCRIBE_STOPTX: Subscribe configuration for task STOPTX */
  #define UARTE_SUBSCRIBE_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOPTX register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task STOPTX will subscribe to */
  #define UARTE_SUBSCRIBE_STOPTX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_STOPTX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_STOPTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define UARTE_SUBSCRIBE_STOPTX_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_STOPTX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_STOPTX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define UARTE_SUBSCRIBE_STOPTX_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* UARTE_SUBSCRIBE_FLUSHRX: Subscribe configuration for task FLUSHRX */
  #define UARTE_SUBSCRIBE_FLUSHRX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_FLUSHRX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task FLUSHRX will subscribe to */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_FLUSHRX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


