tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UARTE_EVENTS_RXTO: Receiver timeout */
  #define UARTE_EVENTS_RXTO_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXTO register.                                */

/* EVENTS_RXTO @Bit 0 : Receiver timeout */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos (0UL)    /*!< Position of EVENTS_RXTO field.                                       */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Msk (0x1UL << UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos) /*!< Bit mask of EVENTS_RXTO field.   */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Min (0x0UL)  /*!< Min enumerator value of EVENTS_RXTO field.                           */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Max (0x1UL)  /*!< Max enumerator value of EVENTS_RXTO field.                           */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Generated (0x1UL) /*!< Event generated                                                 */


/* UARTE_EVENTS_RXSTARTED: UART receiver has started */
  #define UARTE_EVENTS_RXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXSTARTED register.                      */

/* EVENTS_RXSTARTED @Bit 0 : UART receiver has started */
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos (0UL) /*!< Position of EVENTS_RXSTARTED field.                           */
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk (0x1UL << UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_RXSTARTED field.*/
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXSTARTED field.             */
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXSTARTED field.             */
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated (0x1UL) /*!< Event generated                                       */


/* UARTE_EVENTS_TXSTARTED: UART transmitter has started */
  #define UARTE_EVENTS_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXSTARTED register.                      */

/* EVENTS_TXSTARTED @Bit 0 : UART transmitter has started */
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos (0UL) /*!< Position of EVENTS_TXSTARTED field.                           */
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk (0x1UL << UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_TXSTARTED field.*/
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXSTARTED field.             */
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXSTARTED field.             */
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated (0x1UL) /*!< Event generated                                       */


/* UARTE_EVENTS_TXSTOPPED: Transmitter stopped */
  #define UARTE_EVENTS_TXSTOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXSTOPPED register.                      */

/* EVENTS_TXSTOPPED @Bit 0 : Transmitter stopped */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos (0UL) /*!< Position of EVENTS_TXSTOPPED field.                           */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Msk (0x1UL << UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_TXSTOPPED field.*/
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXSTOPPED field.             */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXSTOPPED field.             */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Generated (0x1UL) /*!< Event generated                                       */


/* UARTE_EVENTS_RXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define UARTE_EVENTS_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXBUSERROR register.                    */

/* EVENTS_RXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos (0UL) /*!< Position of EVENTS_RXBUSERROR field.                        */
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Msk (0x1UL << UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_RXBUSERROR field.*/
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXBUSERROR field.          */
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXBUSERROR field.          */
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define UARTE_EVENTS_RXBUSERROR_EVENTS_RXBUSERROR_Generated (0x1UL) /*!< Event generated                                     */


/* UARTE_EVENTS_TXBUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define UARTE_EVENTS_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXBUSERROR register.                    */

/* EVENTS_TXBUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos (0UL) /*!< Position of EVENTS_TXBUSERROR field.                        */
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Msk (0x1UL << UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_TXBUSERROR field.*/
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXBUSERROR field.          */
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXBUSERROR field.          */
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define UARTE_EVENTS_TXBUSERROR_EVENTS_TXBUSERROR_Generated (0x1UL) /*!< Event generated                                     */


