tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UARTE_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define UARTE_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define UARTE_PUBLISH_ERROR_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define UARTE_PUBLISH_ERROR_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_ERROR_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_ERROR_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_ERROR_EN_Msk (0x1UL << UARTE_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                          */
  #define UARTE_PUBLISH_ERROR_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_ERROR_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_ERROR_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_ERROR_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_RXTO: Publish configuration for event RXTO */
  #define UARTE_PUBLISH_RXTO_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXTO register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event RXTO will publish to */
  #define UARTE_PUBLISH_RXTO_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RXTO_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXTO_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define UARTE_PUBLISH_RXTO_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_RXTO_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXTO_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RXTO_EN_Msk (0x1UL << UARTE_PUBLISH_RXTO_EN_Pos) /*!< Bit mask of EN field.                            */
  #define UARTE_PUBLISH_RXTO_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXTO_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXTO_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define UARTE_PUBLISH_RXTO_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_RXSTARTED: Publish configuration for event RXSTARTED */
  #define UARTE_PUBLISH_RXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXSTARTED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RXSTARTED will publish to */
  #define UARTE_PUBLISH_RXSTARTED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RXSTARTED_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_PUBLISH_RXSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_RXSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXSTARTED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RXSTARTED_EN_Msk (0x1UL << UARTE_PUBLISH_RXSTARTED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_PUBLISH_RXSTARTED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXSTARTED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define UARTE_PUBLISH_RXSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_TXSTARTED: Publish configuration for event TXSTARTED */
  #define UARTE_PUBLISH_TXSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXSTARTED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event TXSTARTED will publish to */
  #define UARTE_PUBLISH_TXSTARTED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_TXSTARTED_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_PUBLISH_TXSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_TXSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXSTARTED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_TXSTARTED_EN_Msk (0x1UL << UARTE_PUBLISH_TXSTARTED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_PUBLISH_TXSTARTED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTARTED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define UARTE_PUBLISH_TXSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_TXSTOPPED: Publish configuration for event TXSTOPPED */
  #define UARTE_PUBLISH_TXSTOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXSTOPPED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event TXSTOPPED will publish to */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Msk (0x1UL << UARTE_PUBLISH_TXSTOPPED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* UARTE_PUBLISH_RXBUSERROR: Publish configuration for event RXBUSERROR */
  #define UARTE_PUBLISH_RXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXBUSERROR register.                  */

