tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RXBUSERROR will publish to */
  #define UARTE_PUBLISH_RXBUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_RXBUSERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define UARTE_PUBLISH_RXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define UARTE_PUBLISH_RXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Msk (0x1UL << UARTE_PUBLISH_RXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define UARTE_PUBLISH_RXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* UARTE_PUBLISH_TXBUSERROR: Publish configuration for event TXBUSERROR */
  #define UARTE_PUBLISH_TXBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXBUSERROR register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event TXBUSERROR will publish to */
  #define UARTE_PUBLISH_TXBUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_TXBUSERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXBUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define UARTE_PUBLISH_TXBUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define UARTE_PUBLISH_TXBUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Msk (0x1UL << UARTE_PUBLISH_TXBUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define UARTE_PUBLISH_TXBUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* UARTE_SHORTS: Shortcuts between local events and tasks */
  #define UARTE_SHORTS_ResetValue (0x00000000UL)     /*!< Reset value of SHORTS register.                                      */

/* ENDRX_STARTRX @Bit 5 : Shortcut between event ENDRX and task STARTRX */
  #define UARTE_SHORTS_ENDRX_STARTRX_Pos (5UL)       /*!< Position of ENDRX_STARTRX field.                                     */
  #define UARTE_SHORTS_ENDRX_STARTRX_Msk (0x1UL << UARTE_SHORTS_ENDRX_STARTRX_Pos) /*!< Bit mask of ENDRX_STARTRX field.       */
  #define UARTE_SHORTS_ENDRX_STARTRX_Min (0x0UL)     /*!< Min enumerator value of ENDRX_STARTRX field.                         */
  #define UARTE_SHORTS_ENDRX_STARTRX_Max (0x1UL)     /*!< Max enumerator value of ENDRX_STARTRX field.                         */
  #define UARTE_SHORTS_ENDRX_STARTRX_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define UARTE_SHORTS_ENDRX_STARTRX_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* ENDRX_STOPRX @Bit 6 : Shortcut between event ENDRX and task STOPRX */
  #define UARTE_SHORTS_ENDRX_STOPRX_Pos (6UL)        /*!< Position of ENDRX_STOPRX field.                                      */
  #define UARTE_SHORTS_ENDRX_STOPRX_Msk (0x1UL << UARTE_SHORTS_ENDRX_STOPRX_Pos) /*!< Bit mask of ENDRX_STOPRX field.          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Min (0x0UL)      /*!< Min enumerator value of ENDRX_STOPRX field.                          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Max (0x1UL)      /*!< Max enumerator value of ENDRX_STOPRX field.                          */
  #define UARTE_SHORTS_ENDRX_STOPRX_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define UARTE_SHORTS_ENDRX_STOPRX_Enabled (0x1UL)  /*!< Enable shortcut                                                      */


/* UARTE_INTEN: Enable or disable interrupt */
  #define UARTE_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CTS @Bit 0 : Enable or disable interrupt for event CTS */
  #define UARTE_INTEN_CTS_Pos (0UL)                  /*!< Position of CTS field.                                               */
  #define UARTE_INTEN_CTS_Msk (0x1UL << UARTE_INTEN_CTS_Pos) /*!< Bit mask of CTS field.                                       */
  #define UARTE_INTEN_CTS_Min (0x0UL)                /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTEN_CTS_Max (0x1UL)                /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTEN_CTS_Disabled (0x0UL)           /*!< Disable                                                              */
  #define UARTE_INTEN_CTS_Enabled (0x1UL)            /*!< Enable                                                               */

/* NCTS @Bit 1 : Enable or disable interrupt for event NCTS */
  #define UARTE_INTEN_NCTS_Pos (1UL)                 /*!< Position of NCTS field.                                              */
  #define UARTE_INTEN_NCTS_Msk (0x1UL << UARTE_INTEN_NCTS_Pos) /*!< Bit mask of NCTS field.                                    */
  #define UARTE_INTEN_NCTS_Min (0x0UL)               /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTEN_NCTS_Max (0x1UL)               /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTEN_NCTS_Disabled (0x0UL)          /*!< Disable                                                              */
  #define UARTE_INTEN_NCTS_Enabled (0x1UL)           /*!< Enable                                                               */

