tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RXDRDY @Bit 2 : Enable or disable interrupt for event RXDRDY */
  #define UARTE_INTEN_RXDRDY_Pos (2UL)               /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTEN_RXDRDY_Msk (0x1UL << UARTE_INTEN_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                              */
  #define UARTE_INTEN_RXDRDY_Min (0x0UL)             /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTEN_RXDRDY_Max (0x1UL)             /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTEN_RXDRDY_Disabled (0x0UL)        /*!< Disable                                                              */
  #define UARTE_INTEN_RXDRDY_Enabled (0x1UL)         /*!< Enable                                                               */

/* ENDRX @Bit 4 : Enable or disable interrupt for event ENDRX */
  #define UARTE_INTEN_ENDRX_Pos (4UL)                /*!< Position of ENDRX field.                                             */
  #define UARTE_INTEN_ENDRX_Msk (0x1UL << UARTE_INTEN_ENDRX_Pos) /*!< Bit mask of ENDRX field.                                 */
  #define UARTE_INTEN_ENDRX_Min (0x0UL)              /*!< Min enumerator value of ENDRX field.                                 */
  #define UARTE_INTEN_ENDRX_Max (0x1UL)              /*!< Max enumerator value of ENDRX field.                                 */
  #define UARTE_INTEN_ENDRX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define UARTE_INTEN_ENDRX_Enabled (0x1UL)          /*!< Enable                                                               */

/* TXDRDY @Bit 7 : Enable or disable interrupt for event TXDRDY */
  #define UARTE_INTEN_TXDRDY_Pos (7UL)               /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTEN_TXDRDY_Msk (0x1UL << UARTE_INTEN_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                              */
  #define UARTE_INTEN_TXDRDY_Min (0x0UL)             /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTEN_TXDRDY_Max (0x1UL)             /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTEN_TXDRDY_Disabled (0x0UL)        /*!< Disable                                                              */
  #define UARTE_INTEN_TXDRDY_Enabled (0x1UL)         /*!< Enable                                                               */

/* ENDTX @Bit 8 : Enable or disable interrupt for event ENDTX */
  #define UARTE_INTEN_ENDTX_Pos (8UL)                /*!< Position of ENDTX field.                                             */
  #define UARTE_INTEN_ENDTX_Msk (0x1UL << UARTE_INTEN_ENDTX_Pos) /*!< Bit mask of ENDTX field.                                 */
  #define UARTE_INTEN_ENDTX_Min (0x0UL)              /*!< Min enumerator value of ENDTX field.                                 */
  #define UARTE_INTEN_ENDTX_Max (0x1UL)              /*!< Max enumerator value of ENDTX field.                                 */
  #define UARTE_INTEN_ENDTX_Disabled (0x0UL)         /*!< Disable                                                              */
  #define UARTE_INTEN_ENDTX_Enabled (0x1UL)          /*!< Enable                                                               */

/* ERROR @Bit 9 : Enable or disable interrupt for event ERROR */
  #define UARTE_INTEN_ERROR_Pos (9UL)                /*!< Position of ERROR field.                                             */
  #define UARTE_INTEN_ERROR_Msk (0x1UL << UARTE_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Min (0x0UL)              /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Max (0x1UL)              /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Disabled (0x0UL)         /*!< Disable                                                              */
  #define UARTE_INTEN_ERROR_Enabled (0x1UL)          /*!< Enable                                                               */

/* RXTO @Bit 17 : Enable or disable interrupt for event RXTO */
  #define UARTE_INTEN_RXTO_Pos (17UL)                /*!< Position of RXTO field.                                              */
  #define UARTE_INTEN_RXTO_Msk (0x1UL << UARTE_INTEN_RXTO_Pos) /*!< Bit mask of RXTO field.                                    */
  #define UARTE_INTEN_RXTO_Min (0x0UL)               /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTEN_RXTO_Max (0x1UL)               /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTEN_RXTO_Disabled (0x0UL)          /*!< Disable                                                              */
  #define UARTE_INTEN_RXTO_Enabled (0x1UL)           /*!< Enable                                                               */

/* RXSTARTED @Bit 19 : Enable or disable interrupt for event RXSTARTED */
  #define UARTE_INTEN_RXSTARTED_Pos (19UL)           /*!< Position of RXSTARTED field.                                         */
  #define UARTE_INTEN_RXSTARTED_Msk (0x1UL << UARTE_INTEN_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.                     */
  #define UARTE_INTEN_RXSTARTED_Min (0x0UL)          /*!< Min enumerator value of RXSTARTED field.                             */
  #define UARTE_INTEN_RXSTARTED_Max (0x1UL)          /*!< Max enumerator value of RXSTARTED field.                             */
  #define UARTE_INTEN_RXSTARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define UARTE_INTEN_RXSTARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* TXSTARTED @Bit 20 : Enable or disable interrupt for event TXSTARTED */
  #define UARTE_INTEN_TXSTARTED_Pos (20UL)           /*!< Position of TXSTARTED field.                                         */
  #define UARTE_INTEN_TXSTARTED_Msk (0x1UL << UARTE_INTEN_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.                     */
  #define UARTE_INTEN_TXSTARTED_Min (0x0UL)          /*!< Min enumerator value of TXSTARTED field.                             */
  #define UARTE_INTEN_TXSTARTED_Max (0x1UL)          /*!< Max enumerator value of TXSTARTED field.                             */
  #define UARTE_INTEN_TXSTARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define UARTE_INTEN_TXSTARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* TXSTOPPED @Bit 22 : Enable or disable interrupt for event TXSTOPPED */
  #define UARTE_INTEN_TXSTOPPED_Pos (22UL)           /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTEN_TXSTOPPED_Msk (0x1UL << UARTE_INTEN_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.                     */
  #define UARTE_INTEN_TXSTOPPED_Min (0x0UL)          /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTEN_TXSTOPPED_Max (0x1UL)          /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTEN_TXSTOPPED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define UARTE_INTEN_TXSTOPPED_Enabled (0x1UL)      /*!< Enable                                                               */

/* RXBUSERROR @Bit 29 : Enable or disable interrupt for event RXBUSERROR */
  #define UARTE_INTEN_RXBUSERROR_Pos (29UL)          /*!< Position of RXBUSERROR field.                                        */
  #define UARTE_INTEN_RXBUSERROR_Msk (0x1UL << UARTE_INTEN_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.                  */
  #define UARTE_INTEN_RXBUSERROR_Min (0x0UL)         /*!< Min enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTEN_RXBUSERROR_Max (0x1UL)         /*!< Max enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTEN_RXBUSERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define UARTE_INTEN_RXBUSERROR_Enabled (0x1UL)     /*!< Enable                                                               */

/* TXBUSERROR @Bit 30 : Enable or disable interrupt for event TXBUSERROR */
  #define UARTE_INTEN_TXBUSERROR_Pos (30UL)          /*!< Position of TXBUSERROR field.                                        */
  #define UARTE_INTEN_TXBUSERROR_Msk (0x1UL << UARTE_INTEN_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.                  */
  #define UARTE_INTEN_TXBUSERROR_Min (0x0UL)         /*!< Min enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTEN_TXBUSERROR_Max (0x1UL)         /*!< Max enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTEN_TXBUSERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define UARTE_INTEN_TXBUSERROR_Enabled (0x1UL)     /*!< Enable                                                               */


/* UARTE_INTENSET: Enable interrupt */
  #define UARTE_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* CTS @Bit 0 : Write '1' to enable interrupt for event CTS */
  #define UARTE_INTENSET_CTS_Pos (0UL)               /*!< Position of CTS field.                                               */
  #define UARTE_INTENSET_CTS_Msk (0x1UL << UARTE_INTENSET_CTS_Pos) /*!< Bit mask of CTS field.                                 */
  #define UARTE_INTENSET_CTS_Min (0x0UL)             /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTENSET_CTS_Max (0x1UL)             /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTENSET_CTS_Set (0x1UL)             /*!< Enable                                                               */
  #define UARTE_INTENSET_CTS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_CTS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* NCTS @Bit 1 : Write '1' to enable interrupt for event NCTS */
  #define UARTE_INTENSET_NCTS_Pos (1UL)              /*!< Position of NCTS field.                                              */
  #define UARTE_INTENSET_NCTS_Msk (0x1UL << UARTE_INTENSET_NCTS_Pos) /*!< Bit mask of NCTS field.                              */
  #define UARTE_INTENSET_NCTS_Min (0x0UL)            /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTENSET_NCTS_Max (0x1UL)            /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTENSET_NCTS_Set (0x1UL)            /*!< Enable                                                               */
  #define UARTE_INTENSET_NCTS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_NCTS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

