tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RXDRDY @Bit 2 : Write '1' to enable interrupt for event RXDRDY */
  #define UARTE_INTENSET_RXDRDY_Pos (2UL)            /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTENSET_RXDRDY_Msk (0x1UL << UARTE_INTENSET_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                        */
  #define UARTE_INTENSET_RXDRDY_Min (0x0UL)          /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTENSET_RXDRDY_Max (0x1UL)          /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTENSET_RXDRDY_Set (0x1UL)          /*!< Enable                                                               */
  #define UARTE_INTENSET_RXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to enable interrupt for event ENDRX */
  #define UARTE_INTENSET_ENDRX_Pos (4UL)             /*!< Position of ENDRX field.                                             */
  #define UARTE_INTENSET_ENDRX_Msk (0x1UL << UARTE_INTENSET_ENDRX_Pos) /*!< Bit mask of ENDRX field.                           */
  #define UARTE_INTENSET_ENDRX_Min (0x0UL)           /*!< Min enumerator value of ENDRX field.                                 */
  #define UARTE_INTENSET_ENDRX_Max (0x1UL)           /*!< Max enumerator value of ENDRX field.                                 */
  #define UARTE_INTENSET_ENDRX_Set (0x1UL)           /*!< Enable                                                               */
  #define UARTE_INTENSET_ENDRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_ENDRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXDRDY @Bit 7 : Write '1' to enable interrupt for event TXDRDY */
  #define UARTE_INTENSET_TXDRDY_Pos (7UL)            /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTENSET_TXDRDY_Msk (0x1UL << UARTE_INTENSET_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                        */
  #define UARTE_INTENSET_TXDRDY_Min (0x0UL)          /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTENSET_TXDRDY_Max (0x1UL)          /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTENSET_TXDRDY_Set (0x1UL)          /*!< Enable                                                               */
  #define UARTE_INTENSET_TXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDTX @Bit 8 : Write '1' to enable interrupt for event ENDTX */
  #define UARTE_INTENSET_ENDTX_Pos (8UL)             /*!< Position of ENDTX field.                                             */
  #define UARTE_INTENSET_ENDTX_Msk (0x1UL << UARTE_INTENSET_ENDTX_Pos) /*!< Bit mask of ENDTX field.                           */
  #define UARTE_INTENSET_ENDTX_Min (0x0UL)           /*!< Min enumerator value of ENDTX field.                                 */
  #define UARTE_INTENSET_ENDTX_Max (0x1UL)           /*!< Max enumerator value of ENDTX field.                                 */
  #define UARTE_INTENSET_ENDTX_Set (0x1UL)           /*!< Enable                                                               */
  #define UARTE_INTENSET_ENDTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_ENDTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to enable interrupt for event ERROR */
  #define UARTE_INTENSET_ERROR_Pos (9UL)             /*!< Position of ERROR field.                                             */
  #define UARTE_INTENSET_ERROR_Msk (0x1UL << UARTE_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define UARTE_INTENSET_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTENSET_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTENSET_ERROR_Set (0x1UL)           /*!< Enable                                                               */
  #define UARTE_INTENSET_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXTO @Bit 17 : Write '1' to enable interrupt for event RXTO */
  #define UARTE_INTENSET_RXTO_Pos (17UL)             /*!< Position of RXTO field.                                              */
  #define UARTE_INTENSET_RXTO_Msk (0x1UL << UARTE_INTENSET_RXTO_Pos) /*!< Bit mask of RXTO field.                              */
  #define UARTE_INTENSET_RXTO_Min (0x0UL)            /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTENSET_RXTO_Max (0x1UL)            /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTENSET_RXTO_Set (0x1UL)            /*!< Enable                                                               */
  #define UARTE_INTENSET_RXTO_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXTO_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
  #define UARTE_INTENSET_RXSTARTED_Pos (19UL)        /*!< Position of RXSTARTED field.                                         */
  #define UARTE_INTENSET_RXSTARTED_Msk (0x1UL << UARTE_INTENSET_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.               */
  #define UARTE_INTENSET_RXSTARTED_Min (0x0UL)       /*!< Min enumerator value of RXSTARTED field.                             */
  #define UARTE_INTENSET_RXSTARTED_Max (0x1UL)       /*!< Max enumerator value of RXSTARTED field.                             */
  #define UARTE_INTENSET_RXSTARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define UARTE_INTENSET_RXSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

