tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXSTARTED @Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
  #define UARTE_INTENSET_TXSTARTED_Pos (20UL)        /*!< Position of TXSTARTED field.                                         */
  #define UARTE_INTENSET_TXSTARTED_Msk (0x1UL << UARTE_INTENSET_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.               */
  #define UARTE_INTENSET_TXSTARTED_Min (0x0UL)       /*!< Min enumerator value of TXSTARTED field.                             */
  #define UARTE_INTENSET_TXSTARTED_Max (0x1UL)       /*!< Max enumerator value of TXSTARTED field.                             */
  #define UARTE_INTENSET_TXSTARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define UARTE_INTENSET_TXSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXSTOPPED @Bit 22 : Write '1' to enable interrupt for event TXSTOPPED */
  #define UARTE_INTENSET_TXSTOPPED_Pos (22UL)        /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTENSET_TXSTOPPED_Msk (0x1UL << UARTE_INTENSET_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.               */
  #define UARTE_INTENSET_TXSTOPPED_Min (0x0UL)       /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENSET_TXSTOPPED_Max (0x1UL)       /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENSET_TXSTOPPED_Set (0x1UL)       /*!< Enable                                                               */
  #define UARTE_INTENSET_TXSTOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXSTOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to enable interrupt for event RXBUSERROR */
  #define UARTE_INTENSET_RXBUSERROR_Pos (29UL)       /*!< Position of RXBUSERROR field.                                        */
  #define UARTE_INTENSET_RXBUSERROR_Msk (0x1UL << UARTE_INTENSET_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.            */
  #define UARTE_INTENSET_RXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTENSET_RXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTENSET_RXBUSERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define UARTE_INTENSET_RXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXBUSERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to enable interrupt for event TXBUSERROR */
  #define UARTE_INTENSET_TXBUSERROR_Pos (30UL)       /*!< Position of TXBUSERROR field.                                        */
  #define UARTE_INTENSET_TXBUSERROR_Msk (0x1UL << UARTE_INTENSET_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.            */
  #define UARTE_INTENSET_TXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTENSET_TXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTENSET_TXBUSERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define UARTE_INTENSET_TXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXBUSERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* UARTE_INTENCLR: Disable interrupt */
  #define UARTE_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CTS @Bit 0 : Write '1' to disable interrupt for event CTS */
  #define UARTE_INTENCLR_CTS_Pos (0UL)               /*!< Position of CTS field.                                               */
  #define UARTE_INTENCLR_CTS_Msk (0x1UL << UARTE_INTENCLR_CTS_Pos) /*!< Bit mask of CTS field.                                 */
  #define UARTE_INTENCLR_CTS_Min (0x0UL)             /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTENCLR_CTS_Max (0x1UL)             /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTENCLR_CTS_Clear (0x1UL)           /*!< Disable                                                              */
  #define UARTE_INTENCLR_CTS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_CTS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* NCTS @Bit 1 : Write '1' to disable interrupt for event NCTS */
  #define UARTE_INTENCLR_NCTS_Pos (1UL)              /*!< Position of NCTS field.                                              */
  #define UARTE_INTENCLR_NCTS_Msk (0x1UL << UARTE_INTENCLR_NCTS_Pos) /*!< Bit mask of NCTS field.                              */
  #define UARTE_INTENCLR_NCTS_Min (0x0UL)            /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTENCLR_NCTS_Max (0x1UL)            /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTENCLR_NCTS_Clear (0x1UL)          /*!< Disable                                                              */
  #define UARTE_INTENCLR_NCTS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_NCTS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXDRDY @Bit 2 : Write '1' to disable interrupt for event RXDRDY */
  #define UARTE_INTENCLR_RXDRDY_Pos (2UL)            /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTENCLR_RXDRDY_Msk (0x1UL << UARTE_INTENCLR_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                        */
  #define UARTE_INTENCLR_RXDRDY_Min (0x0UL)          /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTENCLR_RXDRDY_Max (0x1UL)          /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTENCLR_RXDRDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 4 : Write '1' to disable interrupt for event ENDRX */
  #define UARTE_INTENCLR_ENDRX_Pos (4UL)             /*!< Position of ENDRX field.                                             */
  #define UARTE_INTENCLR_ENDRX_Msk (0x1UL << UARTE_INTENCLR_ENDRX_Pos) /*!< Bit mask of ENDRX field.                           */
  #define UARTE_INTENCLR_ENDRX_Min (0x0UL)           /*!< Min enumerator value of ENDRX field.                                 */
  #define UARTE_INTENCLR_ENDRX_Max (0x1UL)           /*!< Max enumerator value of ENDRX field.                                 */
  #define UARTE_INTENCLR_ENDRX_Clear (0x1UL)         /*!< Disable                                                              */
  #define UARTE_INTENCLR_ENDRX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_ENDRX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXDRDY @Bit 7 : Write '1' to disable interrupt for event TXDRDY */
  #define UARTE_INTENCLR_TXDRDY_Pos (7UL)            /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTENCLR_TXDRDY_Msk (0x1UL << UARTE_INTENCLR_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                        */
  #define UARTE_INTENCLR_TXDRDY_Min (0x0UL)          /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTENCLR_TXDRDY_Max (0x1UL)          /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTENCLR_TXDRDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDTX @Bit 8 : Write '1' to disable interrupt for event ENDTX */
  #define UARTE_INTENCLR_ENDTX_Pos (8UL)             /*!< Position of ENDTX field.                                             */
  #define UARTE_INTENCLR_ENDTX_Msk (0x1UL << UARTE_INTENCLR_ENDTX_Pos) /*!< Bit mask of ENDTX field.                           */
  #define UARTE_INTENCLR_ENDTX_Min (0x0UL)           /*!< Min enumerator value of ENDTX field.                                 */
  #define UARTE_INTENCLR_ENDTX_Max (0x1UL)           /*!< Max enumerator value of ENDTX field.                                 */
  #define UARTE_INTENCLR_ENDTX_Clear (0x1UL)         /*!< Disable                                                              */
  #define UARTE_INTENCLR_ENDTX_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_ENDTX_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to disable interrupt for event ERROR */
  #define UARTE_INTENCLR_ERROR_Pos (9UL)             /*!< Position of ERROR field.                                             */
  #define UARTE_INTENCLR_ERROR_Msk (0x1UL << UARTE_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define UARTE_INTENCLR_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTENCLR_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTENCLR_ERROR_Clear (0x1UL)         /*!< Disable                                                              */
  #define UARTE_INTENCLR_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

