tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RXTO @Bit 17 : Write '1' to disable interrupt for event RXTO */
  #define UARTE_INTENCLR_RXTO_Pos (17UL)             /*!< Position of RXTO field.                                              */
  #define UARTE_INTENCLR_RXTO_Msk (0x1UL << UARTE_INTENCLR_RXTO_Pos) /*!< Bit mask of RXTO field.                              */
  #define UARTE_INTENCLR_RXTO_Min (0x0UL)            /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTENCLR_RXTO_Max (0x1UL)            /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTENCLR_RXTO_Clear (0x1UL)          /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXTO_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXTO_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXSTARTED @Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
  #define UARTE_INTENCLR_RXSTARTED_Pos (19UL)        /*!< Position of RXSTARTED field.                                         */
  #define UARTE_INTENCLR_RXSTARTED_Msk (0x1UL << UARTE_INTENCLR_RXSTARTED_Pos) /*!< Bit mask of RXSTARTED field.               */
  #define UARTE_INTENCLR_RXSTARTED_Min (0x0UL)       /*!< Min enumerator value of RXSTARTED field.                             */
  #define UARTE_INTENCLR_RXSTARTED_Max (0x1UL)       /*!< Max enumerator value of RXSTARTED field.                             */
  #define UARTE_INTENCLR_RXSTARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXSTARTED @Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
  #define UARTE_INTENCLR_TXSTARTED_Pos (20UL)        /*!< Position of TXSTARTED field.                                         */
  #define UARTE_INTENCLR_TXSTARTED_Msk (0x1UL << UARTE_INTENCLR_TXSTARTED_Pos) /*!< Bit mask of TXSTARTED field.               */
  #define UARTE_INTENCLR_TXSTARTED_Min (0x0UL)       /*!< Min enumerator value of TXSTARTED field.                             */
  #define UARTE_INTENCLR_TXSTARTED_Max (0x1UL)       /*!< Max enumerator value of TXSTARTED field.                             */
  #define UARTE_INTENCLR_TXSTARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TXSTOPPED @Bit 22 : Write '1' to disable interrupt for event TXSTOPPED */
  #define UARTE_INTENCLR_TXSTOPPED_Pos (22UL)        /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTENCLR_TXSTOPPED_Msk (0x1UL << UARTE_INTENCLR_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.               */
  #define UARTE_INTENCLR_TXSTOPPED_Min (0x0UL)       /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENCLR_TXSTOPPED_Max (0x1UL)       /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENCLR_TXSTOPPED_Clear (0x1UL)     /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXSTOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXSTOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXBUSERROR @Bit 29 : Write '1' to disable interrupt for event RXBUSERROR */
  #define UARTE_INTENCLR_RXBUSERROR_Pos (29UL)       /*!< Position of RXBUSERROR field.                                        */
  #define UARTE_INTENCLR_RXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_RXBUSERROR_Pos) /*!< Bit mask of RXBUSERROR field.            */
  #define UARTE_INTENCLR_RXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTENCLR_RXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of RXBUSERROR field.                            */
  #define UARTE_INTENCLR_RXBUSERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXBUSERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* TXBUSERROR @Bit 30 : Write '1' to disable interrupt for event TXBUSERROR */
  #define UARTE_INTENCLR_TXBUSERROR_Pos (30UL)       /*!< Position of TXBUSERROR field.                                        */
  #define UARTE_INTENCLR_TXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_TXBUSERROR_Pos) /*!< Bit mask of TXBUSERROR field.            */
  #define UARTE_INTENCLR_TXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTENCLR_TXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of TXBUSERROR field.                            */
  #define UARTE_INTENCLR_TXBUSERROR_Clear (0x1UL)    /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXBUSERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* UARTE_ERRORSRC: Error source */
  #define UARTE_ERRORSRC_ResetValue (0x00000000UL)   /*!< Reset value of ERRORSRC register.                                    */

