tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UARTE_CONFIG: Configuration of parity and hardware flow control */
  #define UARTE_CONFIG_ResetValue (0x00000000UL)     /*!< Reset value of CONFIG register.                                      */

/* HWFC @Bit 0 : Hardware flow control */
  #define UARTE_CONFIG_HWFC_Pos (0UL)                /*!< Position of HWFC field.                                              */
  #define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos) /*!< Bit mask of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Min (0x0UL)              /*!< Min enumerator value of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Max (0x1UL)              /*!< Max enumerator value of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Disabled (0x0UL)         /*!< Disabled                                                             */
  #define UARTE_CONFIG_HWFC_Enabled (0x1UL)          /*!< Enabled                                                              */

/* PARITY @Bits 1..3 : Parity */
  #define UARTE_CONFIG_PARITY_Pos (1UL)              /*!< Position of PARITY field.                                            */
  #define UARTE_CONFIG_PARITY_Msk (0x7UL << UARTE_CONFIG_PARITY_Pos) /*!< Bit mask of PARITY field.                            */
  #define UARTE_CONFIG_PARITY_Min (0x0UL)            /*!< Min enumerator value of PARITY field.                                */
  #define UARTE_CONFIG_PARITY_Max (0x7UL)            /*!< Max enumerator value of PARITY field.                                */
  #define UARTE_CONFIG_PARITY_Excluded (0x0UL)       /*!< Exclude parity bit                                                   */
  #define UARTE_CONFIG_PARITY_Included (0x7UL)       /*!< Include even parity bit                                              */

/* STOP @Bit 4 : Stop bits */
  #define UARTE_CONFIG_STOP_Pos (4UL)                /*!< Position of STOP field.                                              */
  #define UARTE_CONFIG_STOP_Msk (0x1UL << UARTE_CONFIG_STOP_Pos) /*!< Bit mask of STOP field.                                  */
  #define UARTE_CONFIG_STOP_Min (0x0UL)              /*!< Min enumerator value of STOP field.                                  */
  #define UARTE_CONFIG_STOP_Max (0x1UL)              /*!< Max enumerator value of STOP field.                                  */
  #define UARTE_CONFIG_STOP_One (0x0UL)              /*!< One stop bit                                                         */
  #define UARTE_CONFIG_STOP_Two (0x1UL)              /*!< Two stop bits                                                        */

/* PARITYTYPE @Bit 8 : Even or odd parity type */
  #define UARTE_CONFIG_PARITYTYPE_Pos (8UL)          /*!< Position of PARITYTYPE field.                                        */
  #define UARTE_CONFIG_PARITYTYPE_Msk (0x1UL << UARTE_CONFIG_PARITYTYPE_Pos) /*!< Bit mask of PARITYTYPE field.                */
  #define UARTE_CONFIG_PARITYTYPE_Min (0x0UL)        /*!< Min enumerator value of PARITYTYPE field.                            */
  #define UARTE_CONFIG_PARITYTYPE_Max (0x1UL)        /*!< Max enumerator value of PARITYTYPE field.                            */
  #define UARTE_CONFIG_PARITYTYPE_Even (0x0UL)       /*!< Even parity                                                          */
  #define UARTE_CONFIG_PARITYTYPE_Odd (0x1UL)        /*!< Odd parity                                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           UICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct UICR_MEM ===================================================== */
/**
  * @brief MEM [UICR_MEM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Memory configuration of the memory region             */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size of the memory region                             */
} NRF_UICR_MEM_Type;                                 /*!< Size = 8 (0x008)                                                     */
  #define UICR_MEM_MaxCount (16UL)                   /*!< Size of MEM[16] array.                                               */
  #define UICR_MEM_MaxIndex (15UL)                   /*!< Max index of MEM[16] array.                                          */
  #define UICR_MEM_MinIndex (0UL)                    /*!< Min index of MEM[16] array.                                          */

/* UICR_MEM_CONFIG: Memory configuration of the memory region */
  #define UICR_MEM_CONFIG_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of CONFIG register.                                      */

/* READ @Bit 0 : (unspecified) */
  #define UICR_MEM_CONFIG_READ_Pos (0UL)             /*!< Position of READ field.                                              */
  #define UICR_MEM_CONFIG_READ_Msk (0x1UL << UICR_MEM_CONFIG_READ_Pos) /*!< Bit mask of READ field.                            */
  #define UICR_MEM_CONFIG_READ_Min (0x0UL)           /*!< Min enumerator value of READ field.                                  */
  #define UICR_MEM_CONFIG_READ_Max (0x1UL)           /*!< Max enumerator value of READ field.                                  */
  #define UICR_MEM_CONFIG_READ_NotAllowed (0x1UL)    /*!< Read access to MEM[n] is not allowed                                 */
  #define UICR_MEM_CONFIG_READ_Allowed (0x0UL)       /*!< Read access to MEM[n] is allowed                                     */

/* WRITE @Bit 1 : (unspecified) */
  #define UICR_MEM_CONFIG_WRITE_Pos (1UL)            /*!< Position of WRITE field.                                             */
  #define UICR_MEM_CONFIG_WRITE_Msk (0x1UL << UICR_MEM_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                         */
  #define UICR_MEM_CONFIG_WRITE_Min (0x0UL)          /*!< Min enumerator value of WRITE field.                                 */
  #define UICR_MEM_CONFIG_WRITE_Max (0x1UL)          /*!< Max enumerator value of WRITE field.                                 */
  #define UICR_MEM_CONFIG_WRITE_NotAllowed (0x1UL)   /*!< Write access to MEM[n] is not allowed                                */
  #define UICR_MEM_CONFIG_WRITE_Allowed (0x0UL)      /*!< Write access to MEM[n] is allowed                                    */

/* EXECUTE @Bit 2 : (unspecified) */
  #define UICR_MEM_CONFIG_EXECUTE_Pos (2UL)          /*!< Position of EXECUTE field.                                           */
  #define UICR_MEM_CONFIG_EXECUTE_Msk (0x1UL << UICR_MEM_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.                   */
  #define UICR_MEM_CONFIG_EXECUTE_Min (0x0UL)        /*!< Min enumerator value of EXECUTE field.                               */
  #define UICR_MEM_CONFIG_EXECUTE_Max (0x1UL)        /*!< Max enumerator value of EXECUTE field.                               */
  #define UICR_MEM_CONFIG_EXECUTE_NotAllowed (0x1UL) /*!< SW execution from MEM[n] is not allowed                              */
  #define UICR_MEM_CONFIG_EXECUTE_Allowed (0x0UL)    /*!< SW execution from MEM[n] is allowed                                  */

/* SECURE @Bit 3 : (unspecified) */
  #define UICR_MEM_CONFIG_SECURE_Pos (3UL)           /*!< Position of SECURE field.                                            */
  #define UICR_MEM_CONFIG_SECURE_Msk (0x1UL << UICR_MEM_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.                      */
  #define UICR_MEM_CONFIG_SECURE_Min (0x0UL)         /*!< Min enumerator value of SECURE field.                                */
  #define UICR_MEM_CONFIG_SECURE_Max (0x1UL)         /*!< Max enumerator value of SECURE field.                                */
  #define UICR_MEM_CONFIG_SECURE_Secure (0x1UL)      /*!< Non-secure access to MEM[n] is not allowed                           */
  #define UICR_MEM_CONFIG_SECURE_NonSecure (0x0UL)   /*!< Non-secure access to MEM[n] is allowed                               */

