tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NSC @Bit 4 : (unspecified) */
  #define UICR_MEM_CONFIG_NSC_Pos (4UL)              /*!< Position of NSC field.                                               */
  #define UICR_MEM_CONFIG_NSC_Msk (0x1UL << UICR_MEM_CONFIG_NSC_Pos) /*!< Bit mask of NSC field.                               */
  #define UICR_MEM_CONFIG_NSC_Min (0x0UL)            /*!< Min enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Max (0x1UL)            /*!< Max enumerator value of NSC field.                                   */
  #define UICR_MEM_CONFIG_NSC_Disabled (0x1UL)       /*!< Memory region is not non-secure callable                             */
  #define UICR_MEM_CONFIG_NSC_Enabled (0x0UL)        /*!< Memory region is non-secure callable                                 */

/* OWNERID @Bits 8..11 : Memory owner identification */
  #define UICR_MEM_CONFIG_OWNERID_Pos (8UL)          /*!< Position of OWNERID field.                                           */
  #define UICR_MEM_CONFIG_OWNERID_Msk (0xFUL << UICR_MEM_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.                   */
  #define UICR_MEM_CONFIG_OWNERID_Min (0x0UL)        /*!< Min value of OWNERID field.                                          */
  #define UICR_MEM_CONFIG_OWNERID_Max (0xFUL)        /*!< Max size of OWNERID field.                                           */

/* ADDRESS @Bits 12..31 : Memory region start address, bits [31:12] */
  #define UICR_MEM_CONFIG_ADDRESS_Pos (12UL)         /*!< Position of ADDRESS field.                                           */
  #define UICR_MEM_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_MEM_CONFIG_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.               */


/* UICR_MEM_SIZE: Size of the memory region */
  #define UICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SIZE register.                                        */

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define UICR_MEM_SIZE_SIZE_Pos (0UL)               /*!< Position of SIZE field.                                              */
  #define UICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_MEM_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.                         */



/* =================================================== Struct UICR_PERIPH ==================================================== */
/**
  * @brief PERIPH [UICR_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Peripheral configuration                              */
} NRF_UICR_PERIPH_Type;                              /*!< Size = 4 (0x004)                                                     */
  #define UICR_PERIPH_MaxCount (192UL)               /*!< Size of PERIPH[192] array.                                           */
  #define UICR_PERIPH_MaxIndex (191UL)               /*!< Max index of PERIPH[192] array.                                      */
  #define UICR_PERIPH_MinIndex (0UL)                 /*!< Min index of PERIPH[192] array.                                      */

/* UICR_PERIPH_CONFIG: Peripheral configuration */
  #define UICR_PERIPH_CONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG register.                                    */

/* SECURE @Bit 3 : Peripheral security mapping */
  #define UICR_PERIPH_CONFIG_SECURE_Pos (3UL)        /*!< Position of SECURE field.                                            */
  #define UICR_PERIPH_CONFIG_SECURE_Msk (0x1UL << UICR_PERIPH_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.                */
  #define UICR_PERIPH_CONFIG_SECURE_Min (0x0UL)      /*!< Min enumerator value of SECURE field.                                */
  #define UICR_PERIPH_CONFIG_SECURE_Max (0x1UL)      /*!< Max enumerator value of SECURE field.                                */
  #define UICR_PERIPH_CONFIG_SECURE_Secure (0x1UL)   /*!< Peripheral is mapped in secure peripheral address space              */
  #define UICR_PERIPH_CONFIG_SECURE_NonSecure (0x0UL) /*!< Peripheral is mapped in non-secure peripheral address space.        */

/* DMASEC @Bit 5 : Security attribution for the DMA transfer */
  #define UICR_PERIPH_CONFIG_DMASEC_Pos (5UL)        /*!< Position of DMASEC field.                                            */
  #define UICR_PERIPH_CONFIG_DMASEC_Msk (0x1UL << UICR_PERIPH_CONFIG_DMASEC_Pos) /*!< Bit mask of DMASEC field.                */
  #define UICR_PERIPH_CONFIG_DMASEC_Min (0x0UL)      /*!< Min enumerator value of DMASEC field.                                */
  #define UICR_PERIPH_CONFIG_DMASEC_Max (0x1UL)      /*!< Max enumerator value of DMASEC field.                                */
  #define UICR_PERIPH_CONFIG_DMASEC_Secure (0x1UL)   /*!< DMA transfers initiated by this peripheral have the secure attribute
                                                          set*/
  #define UICR_PERIPH_CONFIG_DMASEC_NonSecure (0x0UL) /*!< DMA transfers initiated by this peripheral have the non-secure
                                                           attribute set*/

/* PROCESSOR @Bits 8..11 : Processor ID of the processor that will receive the peripheral IRQ */
  #define UICR_PERIPH_CONFIG_PROCESSOR_Pos (8UL)     /*!< Position of PROCESSOR field.                                         */
  #define UICR_PERIPH_CONFIG_PROCESSOR_Msk (0xFUL << UICR_PERIPH_CONFIG_PROCESSOR_Pos) /*!< Bit mask of PROCESSOR field.       */

/* ADDRESS @Bits 12..31 : Peripheral address, bits [31:12] */
  #define UICR_PERIPH_CONFIG_ADDRESS_Pos (12UL)      /*!< Position of ADDRESS field.                                           */
  #define UICR_PERIPH_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_PERIPH_CONFIG_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.         */



/* ================================================== Struct UICR_GPIOTE_CH ================================================== */
/**
  * @brief CH [UICR_GPIOTE_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the channels of GPIOTE[n]        */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the channels of GPIOTE[n]      */
} NRF_UICR_GPIOTE_CH_Type;                           /*!< Size = 8 (0x008)                                                     */

/* UICR_GPIOTE_CH_OWN: Request ownership of the channels of GPIOTE[n] */
  #define UICR_GPIOTE_CH_OWN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OWN register.                                       */

/* CH0 @Bit 0 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH0_Pos (0UL)           /*!< Position of CH0 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH0_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH0_Pos) /*!< Bit mask of CH0 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH0_Min (0x0UL)         /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH0_Max (0x1UL)         /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH0_NotOwn (0x1UL)      /*!< Do not own the channel 0                                             */
  #define UICR_GPIOTE_CH_OWN_CH0_Own (0x0UL)         /*!< Own the channel 0                                                    */

/* CH1 @Bit 1 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH1_Pos (1UL)           /*!< Position of CH1 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH1_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH1_Pos) /*!< Bit mask of CH1 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH1_Min (0x0UL)         /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH1_Max (0x1UL)         /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH1_NotOwn (0x1UL)      /*!< Do not own the channel 1                                             */
  #define UICR_GPIOTE_CH_OWN_CH1_Own (0x0UL)         /*!< Own the channel 1                                                    */

/* CH2 @Bit 2 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH2_Pos (2UL)           /*!< Position of CH2 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH2_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH2_Pos) /*!< Bit mask of CH2 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH2_Min (0x0UL)         /*!< Min enumerator value of CH2 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH2_Max (0x1UL)         /*!< Max enumerator value of CH2 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH2_NotOwn (0x1UL)      /*!< Do not own the channel 2                                             */
  #define UICR_GPIOTE_CH_OWN_CH2_Own (0x0UL)         /*!< Own the channel 2                                                    */

/* CH3 @Bit 3 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH3_Pos (3UL)           /*!< Position of CH3 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH3_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH3_Pos) /*!< Bit mask of CH3 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH3_Min (0x0UL)         /*!< Min enumerator value of CH3 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH3_Max (0x1UL)         /*!< Max enumerator value of CH3 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH3_NotOwn (0x1UL)      /*!< Do not own the channel 3                                             */
  #define UICR_GPIOTE_CH_OWN_CH3_Own (0x0UL)         /*!< Own the channel 3                                                    */

/* CH4 @Bit 4 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH4_Pos (4UL)           /*!< Position of CH4 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH4_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH4_Pos) /*!< Bit mask of CH4 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH4_Min (0x0UL)         /*!< Min enumerator value of CH4 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH4_Max (0x1UL)         /*!< Max enumerator value of CH4 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH4_NotOwn (0x1UL)      /*!< Do not own the channel 4                                             */
  #define UICR_GPIOTE_CH_OWN_CH4_Own (0x0UL)         /*!< Own the channel 4                                                    */

/* CH5 @Bit 5 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH5_Pos (5UL)           /*!< Position of CH5 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH5_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH5_Pos) /*!< Bit mask of CH5 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH5_Min (0x0UL)         /*!< Min enumerator value of CH5 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH5_Max (0x1UL)         /*!< Max enumerator value of CH5 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH5_NotOwn (0x1UL)      /*!< Do not own the channel 5                                             */
  #define UICR_GPIOTE_CH_OWN_CH5_Own (0x0UL)         /*!< Own the channel 5                                                    */

/* CH6 @Bit 6 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH6_Pos (6UL)           /*!< Position of CH6 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH6_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH6_Pos) /*!< Bit mask of CH6 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH6_Min (0x0UL)         /*!< Min enumerator value of CH6 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH6_Max (0x1UL)         /*!< Max enumerator value of CH6 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH6_NotOwn (0x1UL)      /*!< Do not own the channel 6                                             */
  #define UICR_GPIOTE_CH_OWN_CH6_Own (0x0UL)         /*!< Own the channel 6                                                    */

/* CH7 @Bit 7 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH7_Pos (7UL)           /*!< Position of CH7 field.                                               */
  #define UICR_GPIOTE_CH_OWN_CH7_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH7_Pos) /*!< Bit mask of CH7 field.                         */
  #define UICR_GPIOTE_CH_OWN_CH7_Min (0x0UL)         /*!< Min enumerator value of CH7 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH7_Max (0x1UL)         /*!< Max enumerator value of CH7 field.                                   */
  #define UICR_GPIOTE_CH_OWN_CH7_NotOwn (0x1UL)      /*!< Do not own the channel 7                                             */
  #define UICR_GPIOTE_CH_OWN_CH7_Own (0x0UL)         /*!< Own the channel 7                                                    */

