tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INT24 @Bit 24 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Pos (24UL) /*!< Position of INT24 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Pos) /*!< Bit mask of
                                                                            INT24 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Min (0x0UL) /*!< Min enumerator value of INT24 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Max (0x1UL) /*!< Max enumerator value of INT24 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Secure (0x1UL) /*!< The interrupt 24 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_NonSecure (0x0UL) /*!< The interrupt 24 is non-secure                         */

/* INT25 @Bit 25 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Pos (25UL) /*!< Position of INT25 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Pos) /*!< Bit mask of
                                                                            INT25 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Min (0x0UL) /*!< Min enumerator value of INT25 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Max (0x1UL) /*!< Max enumerator value of INT25 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Secure (0x1UL) /*!< The interrupt 25 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_NonSecure (0x0UL) /*!< The interrupt 25 is non-secure                         */

/* INT26 @Bit 26 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Pos (26UL) /*!< Position of INT26 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Pos) /*!< Bit mask of
                                                                            INT26 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Min (0x0UL) /*!< Min enumerator value of INT26 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Max (0x1UL) /*!< Max enumerator value of INT26 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Secure (0x1UL) /*!< The interrupt 26 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_NonSecure (0x0UL) /*!< The interrupt 26 is non-secure                         */

/* INT27 @Bit 27 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Pos (27UL) /*!< Position of INT27 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Pos) /*!< Bit mask of
                                                                            INT27 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Min (0x0UL) /*!< Min enumerator value of INT27 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Max (0x1UL) /*!< Max enumerator value of INT27 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Secure (0x1UL) /*!< The interrupt 27 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_NonSecure (0x0UL) /*!< The interrupt 27 is non-secure                         */

/* INT28 @Bit 28 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Pos (28UL) /*!< Position of INT28 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Pos) /*!< Bit mask of
                                                                            INT28 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Min (0x0UL) /*!< Min enumerator value of INT28 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Max (0x1UL) /*!< Max enumerator value of INT28 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Secure (0x1UL) /*!< The interrupt 28 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_NonSecure (0x0UL) /*!< The interrupt 28 is non-secure                         */

/* INT29 @Bit 29 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Pos (29UL) /*!< Position of INT29 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Pos) /*!< Bit mask of
                                                                            INT29 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Min (0x0UL) /*!< Min enumerator value of INT29 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Max (0x1UL) /*!< Max enumerator value of INT29 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_Secure (0x1UL) /*!< The interrupt 29 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT29_NonSecure (0x0UL) /*!< The interrupt 29 is non-secure                         */

/* INT30 @Bit 30 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Pos (30UL) /*!< Position of INT30 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Pos) /*!< Bit mask of
                                                                            INT30 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Min (0x0UL) /*!< Min enumerator value of INT30 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Max (0x1UL) /*!< Max enumerator value of INT30 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_Secure (0x1UL) /*!< The interrupt 30 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT30_NonSecure (0x0UL) /*!< The interrupt 30 is non-secure                         */

/* INT31 @Bit 31 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Pos (31UL) /*!< Position of INT31 field.                                      */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Pos) /*!< Bit mask of
                                                                            INT31 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Min (0x0UL) /*!< Min enumerator value of INT31 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Max (0x1UL) /*!< Max enumerator value of INT31 field.                         */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_Secure (0x1UL) /*!< The interrupt 31 is secure                                */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT31_NonSecure (0x0UL) /*!< The interrupt 31 is non-secure                         */



/* ================================================= Struct UICR_IPCT_LOCAL ================================================== */
/**
  * @brief LOCAL [UICR_IPCT_LOCAL] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_IPCT_LOCAL_CH_Type CH;              /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_IPCT_LOCAL_INTERRUPT_Type INTERRUPT; /*!< (@ 0x00000004) (unspecified)                                        */
} NRF_UICR_IPCT_LOCAL_Type;                          /*!< Size = 8 (0x008)                                                     */


/* =============================================== Struct UICR_IPCT_GLOBAL_CH ================================================ */
/**
  * @brief CH [UICR_IPCT_GLOBAL_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the channels of IPCT[n] in Global
                                                                         domain*/
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the channels of IPCT[n] in
                                                                         Global domain*/
} NRF_UICR_IPCT_GLOBAL_CH_Type;                      /*!< Size = 8 (0x008)                                                     */

/* UICR_IPCT_GLOBAL_CH_OWN: Request ownership of the channels of IPCT[n] in Global domain */
  #define UICR_IPCT_GLOBAL_CH_OWN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OWN register.                                  */

/* CH0 @Bit 0 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_NotOwn (0x1UL) /*!< Do not own the channel 0                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH0_Own (0x0UL)    /*!< Own the channel 0                                                    */

/* CH1 @Bit 1 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_NotOwn (0x1UL) /*!< Do not own the channel 1                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH1_Own (0x0UL)    /*!< Own the channel 1                                                    */

/* CH2 @Bit 2 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_Pos (2UL)      /*!< Position of CH2 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH2_Pos) /*!< Bit mask of CH2 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_Min (0x0UL)    /*!< Min enumerator value of CH2 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_Max (0x1UL)    /*!< Max enumerator value of CH2 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_NotOwn (0x1UL) /*!< Do not own the channel 2                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH2_Own (0x0UL)    /*!< Own the channel 2                                                    */

/* CH3 @Bit 3 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_Pos (3UL)      /*!< Position of CH3 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH3_Pos) /*!< Bit mask of CH3 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_Min (0x0UL)    /*!< Min enumerator value of CH3 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_Max (0x1UL)    /*!< Max enumerator value of CH3 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_NotOwn (0x1UL) /*!< Do not own the channel 3                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH3_Own (0x0UL)    /*!< Own the channel 3                                                    */

/* CH4 @Bit 4 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_Pos (4UL)      /*!< Position of CH4 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH4_Pos) /*!< Bit mask of CH4 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_Min (0x0UL)    /*!< Min enumerator value of CH4 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_Max (0x1UL)    /*!< Max enumerator value of CH4 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_NotOwn (0x1UL) /*!< Do not own the channel 4                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH4_Own (0x0UL)    /*!< Own the channel 4                                                    */

/* CH5 @Bit 5 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_Pos (5UL)      /*!< Position of CH5 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH5_Pos) /*!< Bit mask of CH5 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_Min (0x0UL)    /*!< Min enumerator value of CH5 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_Max (0x1UL)    /*!< Max enumerator value of CH5 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_NotOwn (0x1UL) /*!< Do not own the channel 5                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH5_Own (0x0UL)    /*!< Own the channel 5                                                    */

/* CH6 @Bit 6 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_Pos (6UL)      /*!< Position of CH6 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH6_Pos) /*!< Bit mask of CH6 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_Min (0x0UL)    /*!< Min enumerator value of CH6 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_Max (0x1UL)    /*!< Max enumerator value of CH6 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_NotOwn (0x1UL) /*!< Do not own the channel 6                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH6_Own (0x0UL)    /*!< Own the channel 6                                                    */

/* CH7 @Bit 7 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_Pos (7UL)      /*!< Position of CH7 field.                                               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH7_Pos) /*!< Bit mask of CH7 field.               */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_Min (0x0UL)    /*!< Min enumerator value of CH7 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_Max (0x1UL)    /*!< Max enumerator value of CH7 field.                                   */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_NotOwn (0x1UL) /*!< Do not own the channel 7                                             */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH7_Own (0x0UL)    /*!< Own the channel 7                                                    */

