tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH17 @Bit 17 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_Pos (17UL) /*!< Position of CH17 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH17_Pos) /*!< Bit mask of CH17 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_Min (0x0UL) /*!< Min enumerator value of CH17 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_Max (0x1UL) /*!< Max enumerator value of CH17 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_Secure (0x1UL) /*!< The channel 17 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH17_NonSecure (0x0UL) /*!< The channel 17 is non-secure                                  */

/* CH18 @Bit 18 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_Pos (18UL) /*!< Position of CH18 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH18_Pos) /*!< Bit mask of CH18 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_Min (0x0UL) /*!< Min enumerator value of CH18 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_Max (0x1UL) /*!< Max enumerator value of CH18 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_Secure (0x1UL) /*!< The channel 18 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH18_NonSecure (0x0UL) /*!< The channel 18 is non-secure                                  */

/* CH19 @Bit 19 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_Pos (19UL) /*!< Position of CH19 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH19_Pos) /*!< Bit mask of CH19 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_Min (0x0UL) /*!< Min enumerator value of CH19 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_Max (0x1UL) /*!< Max enumerator value of CH19 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_Secure (0x1UL) /*!< The channel 19 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH19_NonSecure (0x0UL) /*!< The channel 19 is non-secure                                  */

/* CH20 @Bit 20 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_Pos (20UL) /*!< Position of CH20 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH20_Pos) /*!< Bit mask of CH20 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_Min (0x0UL) /*!< Min enumerator value of CH20 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_Max (0x1UL) /*!< Max enumerator value of CH20 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_Secure (0x1UL) /*!< The channel 20 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH20_NonSecure (0x0UL) /*!< The channel 20 is non-secure                                  */

/* CH21 @Bit 21 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_Pos (21UL) /*!< Position of CH21 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH21_Pos) /*!< Bit mask of CH21 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_Min (0x0UL) /*!< Min enumerator value of CH21 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_Max (0x1UL) /*!< Max enumerator value of CH21 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_Secure (0x1UL) /*!< The channel 21 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH21_NonSecure (0x0UL) /*!< The channel 21 is non-secure                                  */

/* CH22 @Bit 22 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_Pos (22UL) /*!< Position of CH22 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH22_Pos) /*!< Bit mask of CH22 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_Min (0x0UL) /*!< Min enumerator value of CH22 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_Max (0x1UL) /*!< Max enumerator value of CH22 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_Secure (0x1UL) /*!< The channel 22 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH22_NonSecure (0x0UL) /*!< The channel 22 is non-secure                                  */

/* CH23 @Bit 23 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_Pos (23UL) /*!< Position of CH23 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH23_Pos) /*!< Bit mask of CH23 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_Min (0x0UL) /*!< Min enumerator value of CH23 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_Max (0x1UL) /*!< Max enumerator value of CH23 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_Secure (0x1UL) /*!< The channel 23 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH23_NonSecure (0x0UL) /*!< The channel 23 is non-secure                                  */

/* CH24 @Bit 24 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_Pos (24UL) /*!< Position of CH24 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH24_Pos) /*!< Bit mask of CH24 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_Min (0x0UL) /*!< Min enumerator value of CH24 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_Max (0x1UL) /*!< Max enumerator value of CH24 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_Secure (0x1UL) /*!< The channel 24 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH24_NonSecure (0x0UL) /*!< The channel 24 is non-secure                                  */

/* CH25 @Bit 25 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_Pos (25UL) /*!< Position of CH25 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH25_Pos) /*!< Bit mask of CH25 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_Min (0x0UL) /*!< Min enumerator value of CH25 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_Max (0x1UL) /*!< Max enumerator value of CH25 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_Secure (0x1UL) /*!< The channel 25 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH25_NonSecure (0x0UL) /*!< The channel 25 is non-secure                                  */

/* CH26 @Bit 26 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_Pos (26UL) /*!< Position of CH26 field.                                              */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH26_Pos) /*!< Bit mask of CH26 field.      */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_Min (0x0UL) /*!< Min enumerator value of CH26 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_Max (0x1UL) /*!< Max enumerator value of CH26 field.                                 */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_Secure (0x1UL) /*!< The channel 26 is secure                                         */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH26_NonSecure (0x0UL) /*!< The channel 26 is non-secure                                  */

