tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INT16 @Bit 16 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Pos (16UL) /*!< Position of INT16 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Pos) /*!< Bit mask of INT16
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Min (0x0UL) /*!< Min enumerator value of INT16 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Max (0x1UL) /*!< Max enumerator value of INT16 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_NotOwn (0x1UL) /*!< Do not own the interrupt 16                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Own (0x0UL) /*!< Own the interrupt 16                                           */

/* INT17 @Bit 17 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Pos (17UL) /*!< Position of INT17 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Pos) /*!< Bit mask of INT17
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Min (0x0UL) /*!< Min enumerator value of INT17 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Max (0x1UL) /*!< Max enumerator value of INT17 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_NotOwn (0x1UL) /*!< Do not own the interrupt 17                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Own (0x0UL) /*!< Own the interrupt 17                                           */

/* INT18 @Bit 18 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Pos (18UL) /*!< Position of INT18 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Pos) /*!< Bit mask of INT18
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Min (0x0UL) /*!< Min enumerator value of INT18 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Max (0x1UL) /*!< Max enumerator value of INT18 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_NotOwn (0x1UL) /*!< Do not own the interrupt 18                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Own (0x0UL) /*!< Own the interrupt 18                                           */

/* INT19 @Bit 19 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Pos (19UL) /*!< Position of INT19 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Pos) /*!< Bit mask of INT19
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Min (0x0UL) /*!< Min enumerator value of INT19 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Max (0x1UL) /*!< Max enumerator value of INT19 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_NotOwn (0x1UL) /*!< Do not own the interrupt 19                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Own (0x0UL) /*!< Own the interrupt 19                                           */

/* INT20 @Bit 20 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Pos (20UL) /*!< Position of INT20 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Pos) /*!< Bit mask of INT20
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Min (0x0UL) /*!< Min enumerator value of INT20 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Max (0x1UL) /*!< Max enumerator value of INT20 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_NotOwn (0x1UL) /*!< Do not own the interrupt 20                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Own (0x0UL) /*!< Own the interrupt 20                                           */

/* INT21 @Bit 21 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Pos (21UL) /*!< Position of INT21 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Pos) /*!< Bit mask of INT21
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Min (0x0UL) /*!< Min enumerator value of INT21 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Max (0x1UL) /*!< Max enumerator value of INT21 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_NotOwn (0x1UL) /*!< Do not own the interrupt 21                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Own (0x0UL) /*!< Own the interrupt 21                                           */

/* INT22 @Bit 22 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Pos (22UL) /*!< Position of INT22 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Pos) /*!< Bit mask of INT22
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Min (0x0UL) /*!< Min enumerator value of INT22 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Max (0x1UL) /*!< Max enumerator value of INT22 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_NotOwn (0x1UL) /*!< Do not own the interrupt 22                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT22_Own (0x0UL) /*!< Own the interrupt 22                                           */

/* INT23 @Bit 23 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Pos (23UL) /*!< Position of INT23 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Pos) /*!< Bit mask of INT23
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Min (0x0UL) /*!< Min enumerator value of INT23 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Max (0x1UL) /*!< Max enumerator value of INT23 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_NotOwn (0x1UL) /*!< Do not own the interrupt 23                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT23_Own (0x0UL) /*!< Own the interrupt 23                                           */

