tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INT24 @Bit 24 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Pos (24UL) /*!< Position of INT24 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Pos) /*!< Bit mask of INT24
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Min (0x0UL) /*!< Min enumerator value of INT24 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Max (0x1UL) /*!< Max enumerator value of INT24 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_NotOwn (0x1UL) /*!< Do not own the interrupt 24                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT24_Own (0x0UL) /*!< Own the interrupt 24                                           */

/* INT25 @Bit 25 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Pos (25UL) /*!< Position of INT25 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Pos) /*!< Bit mask of INT25
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Min (0x0UL) /*!< Min enumerator value of INT25 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Max (0x1UL) /*!< Max enumerator value of INT25 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_NotOwn (0x1UL) /*!< Do not own the interrupt 25                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT25_Own (0x0UL) /*!< Own the interrupt 25                                           */

/* INT26 @Bit 26 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Pos (26UL) /*!< Position of INT26 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Pos) /*!< Bit mask of INT26
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Min (0x0UL) /*!< Min enumerator value of INT26 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Max (0x1UL) /*!< Max enumerator value of INT26 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_NotOwn (0x1UL) /*!< Do not own the interrupt 26                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT26_Own (0x0UL) /*!< Own the interrupt 26                                           */

/* INT27 @Bit 27 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Pos (27UL) /*!< Position of INT27 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Pos) /*!< Bit mask of INT27
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Min (0x0UL) /*!< Min enumerator value of INT27 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Max (0x1UL) /*!< Max enumerator value of INT27 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_NotOwn (0x1UL) /*!< Do not own the interrupt 27                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT27_Own (0x0UL) /*!< Own the interrupt 27                                           */

/* INT28 @Bit 28 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Pos (28UL) /*!< Position of INT28 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Pos) /*!< Bit mask of INT28
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Min (0x0UL) /*!< Min enumerator value of INT28 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Max (0x1UL) /*!< Max enumerator value of INT28 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_NotOwn (0x1UL) /*!< Do not own the interrupt 28                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT28_Own (0x0UL) /*!< Own the interrupt 28                                           */

/* INT29 @Bit 29 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Pos (29UL) /*!< Position of INT29 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Pos) /*!< Bit mask of INT29
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Min (0x0UL) /*!< Min enumerator value of INT29 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Max (0x1UL) /*!< Max enumerator value of INT29 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_NotOwn (0x1UL) /*!< Do not own the interrupt 29                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT29_Own (0x0UL) /*!< Own the interrupt 29                                           */

/* INT30 @Bit 30 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Pos (30UL) /*!< Position of INT30 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Pos) /*!< Bit mask of INT30
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Min (0x0UL) /*!< Min enumerator value of INT30 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Max (0x1UL) /*!< Max enumerator value of INT30 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_NotOwn (0x1UL) /*!< Do not own the interrupt 30                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT30_Own (0x0UL) /*!< Own the interrupt 30                                           */

/* INT31 @Bit 31 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Pos (31UL) /*!< Position of INT31 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Pos) /*!< Bit mask of INT31
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Min (0x0UL) /*!< Min enumerator value of INT31 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Max (0x1UL) /*!< Max enumerator value of INT31 field.                           */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_NotOwn (0x1UL) /*!< Do not own the interrupt 31                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT31_Own (0x0UL) /*!< Own the interrupt 31                                           */


/* UICR_IPCT_GLOBAL_INTERRUPT_SECURE: Request permission for the interrupts of IPCT[n] in Global domain */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of SECURE register.                     */

/* INT0 @Bit 0 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Pos (0UL) /*!< Position of INT0 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Pos) /*!< Bit mask of INT0
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Min (0x0UL) /*!< Min enumerator value of INT0 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Max (0x1UL) /*!< Max enumerator value of INT0 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_Secure (0x1UL) /*!< The interrupt 0 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT0_NonSecure (0x0UL) /*!< The interrupt 0 is non-secure                          */

/* INT1 @Bit 1 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Pos (1UL) /*!< Position of INT1 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Pos) /*!< Bit mask of INT1
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Min (0x0UL) /*!< Min enumerator value of INT1 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Max (0x1UL) /*!< Max enumerator value of INT1 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_Secure (0x1UL) /*!< The interrupt 1 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT1_NonSecure (0x0UL) /*!< The interrupt 1 is non-secure                          */

/* INT2 @Bit 2 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Pos (2UL) /*!< Position of INT2 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Pos) /*!< Bit mask of INT2
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Min (0x0UL) /*!< Min enumerator value of INT2 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Max (0x1UL) /*!< Max enumerator value of INT2 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_Secure (0x1UL) /*!< The interrupt 2 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT2_NonSecure (0x0UL) /*!< The interrupt 2 is non-secure                          */

/* INT3 @Bit 3 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Pos (3UL) /*!< Position of INT3 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Pos) /*!< Bit mask of INT3
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Min (0x0UL) /*!< Min enumerator value of INT3 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Max (0x1UL) /*!< Max enumerator value of INT3 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_Secure (0x1UL) /*!< The interrupt 3 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT3_NonSecure (0x0UL) /*!< The interrupt 3 is non-secure                          */

