tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INT4 @Bit 4 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Pos (4UL) /*!< Position of INT4 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Pos) /*!< Bit mask of INT4
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Min (0x0UL) /*!< Min enumerator value of INT4 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Max (0x1UL) /*!< Max enumerator value of INT4 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_Secure (0x1UL) /*!< The interrupt 4 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT4_NonSecure (0x0UL) /*!< The interrupt 4 is non-secure                          */

/* INT5 @Bit 5 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Pos (5UL) /*!< Position of INT5 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Pos) /*!< Bit mask of INT5
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Min (0x0UL) /*!< Min enumerator value of INT5 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Max (0x1UL) /*!< Max enumerator value of INT5 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_Secure (0x1UL) /*!< The interrupt 5 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT5_NonSecure (0x0UL) /*!< The interrupt 5 is non-secure                          */

/* INT6 @Bit 6 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Pos (6UL) /*!< Position of INT6 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Pos) /*!< Bit mask of INT6
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Min (0x0UL) /*!< Min enumerator value of INT6 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Max (0x1UL) /*!< Max enumerator value of INT6 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_Secure (0x1UL) /*!< The interrupt 6 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT6_NonSecure (0x0UL) /*!< The interrupt 6 is non-secure                          */

/* INT7 @Bit 7 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Pos (7UL) /*!< Position of INT7 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Pos) /*!< Bit mask of INT7
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Min (0x0UL) /*!< Min enumerator value of INT7 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Max (0x1UL) /*!< Max enumerator value of INT7 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_Secure (0x1UL) /*!< The interrupt 7 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT7_NonSecure (0x0UL) /*!< The interrupt 7 is non-secure                          */

/* INT8 @Bit 8 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Pos (8UL) /*!< Position of INT8 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Pos) /*!< Bit mask of INT8
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Min (0x0UL) /*!< Min enumerator value of INT8 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Max (0x1UL) /*!< Max enumerator value of INT8 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_Secure (0x1UL) /*!< The interrupt 8 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT8_NonSecure (0x0UL) /*!< The interrupt 8 is non-secure                          */

/* INT9 @Bit 9 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Pos (9UL) /*!< Position of INT9 field.                                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Pos) /*!< Bit mask of INT9
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Min (0x0UL) /*!< Min enumerator value of INT9 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Max (0x1UL) /*!< Max enumerator value of INT9 field.                          */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_Secure (0x1UL) /*!< The interrupt 9 is secure                                 */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT9_NonSecure (0x0UL) /*!< The interrupt 9 is non-secure                          */

/* INT10 @Bit 10 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Pos (10UL) /*!< Position of INT10 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Pos) /*!< Bit mask of
                                                                            INT10 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Min (0x0UL) /*!< Min enumerator value of INT10 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Max (0x1UL) /*!< Max enumerator value of INT10 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_Secure (0x1UL) /*!< The interrupt 10 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT10_NonSecure (0x0UL) /*!< The interrupt 10 is non-secure                        */

/* INT11 @Bit 11 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Pos (11UL) /*!< Position of INT11 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Pos) /*!< Bit mask of
                                                                            INT11 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Min (0x0UL) /*!< Min enumerator value of INT11 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Max (0x1UL) /*!< Max enumerator value of INT11 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_Secure (0x1UL) /*!< The interrupt 11 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT11_NonSecure (0x0UL) /*!< The interrupt 11 is non-secure                        */

/* INT12 @Bit 12 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Pos (12UL) /*!< Position of INT12 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Pos) /*!< Bit mask of
                                                                            INT12 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Min (0x0UL) /*!< Min enumerator value of INT12 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Max (0x1UL) /*!< Max enumerator value of INT12 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_Secure (0x1UL) /*!< The interrupt 12 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT12_NonSecure (0x0UL) /*!< The interrupt 12 is non-secure                        */

/* INT13 @Bit 13 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Pos (13UL) /*!< Position of INT13 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Pos) /*!< Bit mask of
                                                                            INT13 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Min (0x0UL) /*!< Min enumerator value of INT13 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Max (0x1UL) /*!< Max enumerator value of INT13 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_Secure (0x1UL) /*!< The interrupt 13 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT13_NonSecure (0x0UL) /*!< The interrupt 13 is non-secure                        */

/* INT14 @Bit 14 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Pos (14UL) /*!< Position of INT14 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Pos) /*!< Bit mask of
                                                                            INT14 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Min (0x0UL) /*!< Min enumerator value of INT14 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Max (0x1UL) /*!< Max enumerator value of INT14 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_Secure (0x1UL) /*!< The interrupt 14 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT14_NonSecure (0x0UL) /*!< The interrupt 14 is non-secure                        */

/* INT15 @Bit 15 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Pos (15UL) /*!< Position of INT15 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Pos) /*!< Bit mask of
                                                                            INT15 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Min (0x0UL) /*!< Min enumerator value of INT15 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Max (0x1UL) /*!< Max enumerator value of INT15 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_Secure (0x1UL) /*!< The interrupt 15 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT15_NonSecure (0x0UL) /*!< The interrupt 15 is non-secure                        */

