tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INT24 @Bit 24 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Pos (24UL) /*!< Position of INT24 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Pos) /*!< Bit mask of
                                                                            INT24 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Min (0x0UL) /*!< Min enumerator value of INT24 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Max (0x1UL) /*!< Max enumerator value of INT24 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_Secure (0x1UL) /*!< The interrupt 24 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT24_NonSecure (0x0UL) /*!< The interrupt 24 is non-secure                        */

/* INT25 @Bit 25 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Pos (25UL) /*!< Position of INT25 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Pos) /*!< Bit mask of
                                                                            INT25 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Min (0x0UL) /*!< Min enumerator value of INT25 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Max (0x1UL) /*!< Max enumerator value of INT25 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_Secure (0x1UL) /*!< The interrupt 25 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT25_NonSecure (0x0UL) /*!< The interrupt 25 is non-secure                        */

/* INT26 @Bit 26 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Pos (26UL) /*!< Position of INT26 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Pos) /*!< Bit mask of
                                                                            INT26 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Min (0x0UL) /*!< Min enumerator value of INT26 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Max (0x1UL) /*!< Max enumerator value of INT26 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_Secure (0x1UL) /*!< The interrupt 26 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT26_NonSecure (0x0UL) /*!< The interrupt 26 is non-secure                        */

/* INT27 @Bit 27 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Pos (27UL) /*!< Position of INT27 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Pos) /*!< Bit mask of
                                                                            INT27 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Min (0x0UL) /*!< Min enumerator value of INT27 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Max (0x1UL) /*!< Max enumerator value of INT27 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_Secure (0x1UL) /*!< The interrupt 27 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT27_NonSecure (0x0UL) /*!< The interrupt 27 is non-secure                        */

/* INT28 @Bit 28 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Pos (28UL) /*!< Position of INT28 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Pos) /*!< Bit mask of
                                                                            INT28 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Min (0x0UL) /*!< Min enumerator value of INT28 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Max (0x1UL) /*!< Max enumerator value of INT28 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_Secure (0x1UL) /*!< The interrupt 28 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT28_NonSecure (0x0UL) /*!< The interrupt 28 is non-secure                        */

/* INT29 @Bit 29 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Pos (29UL) /*!< Position of INT29 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Pos) /*!< Bit mask of
                                                                            INT29 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Min (0x0UL) /*!< Min enumerator value of INT29 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Max (0x1UL) /*!< Max enumerator value of INT29 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Secure (0x1UL) /*!< The interrupt 29 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_NonSecure (0x0UL) /*!< The interrupt 29 is non-secure                        */

/* INT30 @Bit 30 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Pos (30UL) /*!< Position of INT30 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Pos) /*!< Bit mask of
                                                                            INT30 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Min (0x0UL) /*!< Min enumerator value of INT30 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Max (0x1UL) /*!< Max enumerator value of INT30 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Secure (0x1UL) /*!< The interrupt 30 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_NonSecure (0x0UL) /*!< The interrupt 30 is non-secure                        */

/* INT31 @Bit 31 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Pos (31UL) /*!< Position of INT31 field.                                     */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Pos) /*!< Bit mask of
                                                                            INT31 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Min (0x0UL) /*!< Min enumerator value of INT31 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Max (0x1UL) /*!< Max enumerator value of INT31 field.                        */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Secure (0x1UL) /*!< The interrupt 31 is secure                               */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_NonSecure (0x0UL) /*!< The interrupt 31 is non-secure                        */



/* ================================================= Struct UICR_IPCT_GLOBAL ================================================= */
/**
  * @brief GLOBAL [UICR_IPCT_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the IPCT instance associated with
                                                                         IPCT[n].GLOBAL*/
  __IOM NRF_UICR_IPCT_GLOBAL_CH_Type CH;             /*!< (@ 0x00000004) (unspecified)                                         */
  __IOM NRF_UICR_IPCT_GLOBAL_INTERRUPT_Type INTERRUPT; /*!< (@ 0x0000000C) (unspecified)                                       */
} NRF_UICR_IPCT_GLOBAL_Type;                         /*!< Size = 20 (0x014)                                                    */
