tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
  #define UICR_IPCT_GLOBAL_MaxCount (2UL)            /*!< Size of GLOBAL[2] array.                                             */
  #define UICR_IPCT_GLOBAL_MaxIndex (1UL)            /*!< Max index of GLOBAL[2] array.                                        */
  #define UICR_IPCT_GLOBAL_MinIndex (0UL)            /*!< Min index of GLOBAL[2] array.                                        */

/* UICR_IPCT_GLOBAL_INSTANCE: Address of the IPCT instance associated with IPCT[n].GLOBAL */
  #define UICR_IPCT_GLOBAL_INSTANCE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of INSTANCE register.                           */

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                          */
  #define UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ==================================================== Struct UICR_IPCT ===================================================== */
/**
  * @brief IPCT [UICR_IPCT] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_IPCT_LOCAL_Type LOCAL;              /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_IPCT_GLOBAL_Type GLOBAL[2];         /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_UICR_IPCT_Type;                                /*!< Size = 48 (0x030)                                                    */


/* ============================================= Struct UICR_DPPI_LOCAL_CH_LINK ============================================== */
/**
  * @brief LINK [UICR_DPPI_LOCAL_CH_LINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIR;                               /*!< (@ 0x00000000) Request linking the channels of DPPI[n] in local domain
                                                                         as source or sink*/
  __IOM uint32_t  EN;                                /*!< (@ 0x00000004) Request linking of the channels of DPPI[n] in the local
                                                                         domain*/
} NRF_UICR_DPPI_LOCAL_CH_LINK_Type;                  /*!< Size = 8 (0x008)                                                     */

/* UICR_DPPI_LOCAL_CH_LINK_DIR: Request linking the channels of DPPI[n] in local domain as source or sink */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIR register.                              */

/* CH0 @Bit 0 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Pos (0UL)  /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Pos) /*!< Bit mask of CH0 field.       */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Source (0x1UL) /*!< The channel 0 is linked as source                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Sink (0x0UL) /*!< The channel 0 is linked as sink                                    */

/* CH1 @Bit 1 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Pos (1UL)  /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Pos) /*!< Bit mask of CH1 field.       */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Source (0x1UL) /*!< The channel 1 is linked as source                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Sink (0x0UL) /*!< The channel 1 is linked as sink                                    */

/* CH2 @Bit 2 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Pos (2UL)  /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Pos) /*!< Bit mask of CH2 field.       */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Min (0x0UL) /*!< Min enumerator value of CH2 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Max (0x1UL) /*!< Max enumerator value of CH2 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Source (0x1UL) /*!< The channel 2 is linked as source                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Sink (0x0UL) /*!< The channel 2 is linked as sink                                    */

/* CH3 @Bit 3 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Pos (3UL)  /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Pos) /*!< Bit mask of CH3 field.       */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Min (0x0UL) /*!< Min enumerator value of CH3 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Max (0x1UL) /*!< Max enumerator value of CH3 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Source (0x1UL) /*!< The channel 3 is linked as source                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Sink (0x0UL) /*!< The channel 3 is linked as sink                                    */

/* CH4 @Bit 4 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Pos (4UL)  /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Pos) /*!< Bit mask of CH4 field.       */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Min (0x0UL) /*!< Min enumerator value of CH4 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Max (0x1UL) /*!< Max enumerator value of CH4 field.                                  */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Source (0x1UL) /*!< The channel 4 is linked as source                                */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Sink (0x0UL) /*!< The channel 4 is linked as sink                                    */

