tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH0 @Bit 0 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Pos (0UL) /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Pos) /*!< Bit mask of CH0 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Min (0x0UL) /*!< Min enumerator value of CH0 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Max (0x1UL) /*!< Max enumerator value of CH0 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Source (0x1UL) /*!< The channel 0 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Sink (0x0UL) /*!< The channel 0 is linked as sink                                   */

/* CH1 @Bit 1 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Pos (1UL) /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Pos) /*!< Bit mask of CH1 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Min (0x0UL) /*!< Min enumerator value of CH1 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Max (0x1UL) /*!< Max enumerator value of CH1 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Source (0x1UL) /*!< The channel 1 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Sink (0x0UL) /*!< The channel 1 is linked as sink                                   */

/* CH2 @Bit 2 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Pos (2UL) /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Pos) /*!< Bit mask of CH2 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Min (0x0UL) /*!< Min enumerator value of CH2 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Max (0x1UL) /*!< Max enumerator value of CH2 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Source (0x1UL) /*!< The channel 2 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Sink (0x0UL) /*!< The channel 2 is linked as sink                                   */

/* CH3 @Bit 3 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Pos (3UL) /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Pos) /*!< Bit mask of CH3 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Min (0x0UL) /*!< Min enumerator value of CH3 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Max (0x1UL) /*!< Max enumerator value of CH3 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Source (0x1UL) /*!< The channel 3 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Sink (0x0UL) /*!< The channel 3 is linked as sink                                   */

/* CH4 @Bit 4 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Pos (4UL) /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Pos) /*!< Bit mask of CH4 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Min (0x0UL) /*!< Min enumerator value of CH4 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Max (0x1UL) /*!< Max enumerator value of CH4 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Source (0x1UL) /*!< The channel 4 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Sink (0x0UL) /*!< The channel 4 is linked as sink                                   */

/* CH5 @Bit 5 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Pos (5UL) /*!< Position of CH5 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Pos) /*!< Bit mask of CH5 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Min (0x0UL) /*!< Min enumerator value of CH5 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Max (0x1UL) /*!< Max enumerator value of CH5 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Source (0x1UL) /*!< The channel 5 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Sink (0x0UL) /*!< The channel 5 is linked as sink                                   */

/* CH6 @Bit 6 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Pos (6UL) /*!< Position of CH6 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Pos) /*!< Bit mask of CH6 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Min (0x0UL) /*!< Min enumerator value of CH6 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Max (0x1UL) /*!< Max enumerator value of CH6 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Source (0x1UL) /*!< The channel 6 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH6_Sink (0x0UL) /*!< The channel 6 is linked as sink                                   */

/* CH7 @Bit 7 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Pos (7UL) /*!< Position of CH7 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Pos) /*!< Bit mask of CH7 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Min (0x0UL) /*!< Min enumerator value of CH7 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Max (0x1UL) /*!< Max enumerator value of CH7 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Source (0x1UL) /*!< The channel 7 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH7_Sink (0x0UL) /*!< The channel 7 is linked as sink                                   */

/* CH8 @Bit 8 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Pos (8UL) /*!< Position of CH8 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Pos) /*!< Bit mask of CH8 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Min (0x0UL) /*!< Min enumerator value of CH8 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Max (0x1UL) /*!< Max enumerator value of CH8 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Source (0x1UL) /*!< The channel 8 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH8_Sink (0x0UL) /*!< The channel 8 is linked as sink                                   */

/* CH9 @Bit 9 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Pos (9UL) /*!< Position of CH9 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Pos) /*!< Bit mask of CH9 field.     */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Min (0x0UL) /*!< Min enumerator value of CH9 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Max (0x1UL) /*!< Max enumerator value of CH9 field.                                 */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Source (0x1UL) /*!< The channel 9 is linked as source                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH9_Sink (0x0UL) /*!< The channel 9 is linked as sink                                   */

/* CH10 @Bit 10 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Pos (10UL) /*!< Position of CH10 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Pos) /*!< Bit mask of CH10 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Min (0x0UL) /*!< Min enumerator value of CH10 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Max (0x1UL) /*!< Max enumerator value of CH10 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Source (0x1UL) /*!< The channel 10 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH10_Sink (0x0UL) /*!< The channel 10 is linked as sink                                 */

/* CH11 @Bit 11 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Pos (11UL) /*!< Position of CH11 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Pos) /*!< Bit mask of CH11 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Min (0x0UL) /*!< Min enumerator value of CH11 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Max (0x1UL) /*!< Max enumerator value of CH11 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Source (0x1UL) /*!< The channel 11 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH11_Sink (0x0UL) /*!< The channel 11 is linked as sink                                 */

/* CH12 @Bit 12 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Pos (12UL) /*!< Position of CH12 field.                                            */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Pos) /*!< Bit mask of CH12 field.  */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Min (0x0UL) /*!< Min enumerator value of CH12 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Max (0x1UL) /*!< Max enumerator value of CH12 field.                               */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Source (0x1UL) /*!< The channel 12 is linked as source                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH12_Sink (0x0UL) /*!< The channel 12 is linked as sink                                 */

