tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH30 @Bit 30 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Pos (30UL) /*!< Position of CH30 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Pos) /*!< Bit mask of CH30 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Min (0x0UL) /*!< Min enumerator value of CH30 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Max (0x1UL) /*!< Max enumerator value of CH30 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Disabled (0x1UL) /*!< The channel 30 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH30_Enabled (0x0UL) /*!< The channel 30 is enabled                                      */

/* CH31 @Bit 31 : Link enable */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Pos (31UL) /*!< Position of CH31 field.                                             */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Pos) /*!< Bit mask of CH31 field.    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Min (0x0UL) /*!< Min enumerator value of CH31 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Max (0x1UL) /*!< Max enumerator value of CH31 field.                                */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Disabled (0x1UL) /*!< The channel 31 is disabled                                    */
  #define UICR_DPPI_GLOBAL_CH_LINK_EN_CH31_Enabled (0x0UL) /*!< The channel 31 is enabled                                      */



/* =============================================== Struct UICR_DPPI_GLOBAL_CH ================================================ */
/**
  * @brief CH [UICR_DPPI_GLOBAL_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the channels of DPPI[n] in Global
                                                                         Domain*/
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the channels of DPPI[n] in
                                                                         Global domain*/
  __IOM NRF_UICR_DPPI_GLOBAL_CH_LINK_Type LINK;      /*!< (@ 0x00000008) (unspecified)                                         */
} NRF_UICR_DPPI_GLOBAL_CH_Type;                      /*!< Size = 16 (0x010)                                                    */

/* UICR_DPPI_GLOBAL_CH_OWN: Request ownership of the channels of DPPI[n] in Global Domain */
  #define UICR_DPPI_GLOBAL_CH_OWN_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OWN register.                                  */

/* CH0 @Bit 0 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_NotOwn (0x1UL) /*!< Do not own the channel 0                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH0_Own (0x0UL)    /*!< Own the channel 0                                                    */

/* CH1 @Bit 1 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_NotOwn (0x1UL) /*!< Do not own the channel 1                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH1_Own (0x0UL)    /*!< Own the channel 1                                                    */

/* CH2 @Bit 2 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_Pos (2UL)      /*!< Position of CH2 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH2_Pos) /*!< Bit mask of CH2 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_Min (0x0UL)    /*!< Min enumerator value of CH2 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_Max (0x1UL)    /*!< Max enumerator value of CH2 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_NotOwn (0x1UL) /*!< Do not own the channel 2                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH2_Own (0x0UL)    /*!< Own the channel 2                                                    */

/* CH3 @Bit 3 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_Pos (3UL)      /*!< Position of CH3 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH3_Pos) /*!< Bit mask of CH3 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_Min (0x0UL)    /*!< Min enumerator value of CH3 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_Max (0x1UL)    /*!< Max enumerator value of CH3 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_NotOwn (0x1UL) /*!< Do not own the channel 3                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH3_Own (0x0UL)    /*!< Own the channel 3                                                    */

/* CH4 @Bit 4 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_Pos (4UL)      /*!< Position of CH4 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH4_Pos) /*!< Bit mask of CH4 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_Min (0x0UL)    /*!< Min enumerator value of CH4 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_Max (0x1UL)    /*!< Max enumerator value of CH4 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_NotOwn (0x1UL) /*!< Do not own the channel 4                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH4_Own (0x0UL)    /*!< Own the channel 4                                                    */

/* CH5 @Bit 5 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_Pos (5UL)      /*!< Position of CH5 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH5_Pos) /*!< Bit mask of CH5 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_Min (0x0UL)    /*!< Min enumerator value of CH5 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_Max (0x1UL)    /*!< Max enumerator value of CH5 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_NotOwn (0x1UL) /*!< Do not own the channel 5                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH5_Own (0x0UL)    /*!< Own the channel 5                                                    */

/* CH6 @Bit 6 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_Pos (6UL)      /*!< Position of CH6 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH6_Pos) /*!< Bit mask of CH6 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_Min (0x0UL)    /*!< Min enumerator value of CH6 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_Max (0x1UL)    /*!< Max enumerator value of CH6 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_NotOwn (0x1UL) /*!< Do not own the channel 6                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH6_Own (0x0UL)    /*!< Own the channel 6                                                    */

/* CH7 @Bit 7 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_Pos (7UL)      /*!< Position of CH7 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH7_Pos) /*!< Bit mask of CH7 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_Min (0x0UL)    /*!< Min enumerator value of CH7 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_Max (0x1UL)    /*!< Max enumerator value of CH7 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_NotOwn (0x1UL) /*!< Do not own the channel 7                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH7_Own (0x0UL)    /*!< Own the channel 7                                                    */

