tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* CH8 @Bit 8 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_Pos (8UL)      /*!< Position of CH8 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH8_Pos) /*!< Bit mask of CH8 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_Min (0x0UL)    /*!< Min enumerator value of CH8 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_Max (0x1UL)    /*!< Max enumerator value of CH8 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_NotOwn (0x1UL) /*!< Do not own the channel 8                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH8_Own (0x0UL)    /*!< Own the channel 8                                                    */

/* CH9 @Bit 9 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_Pos (9UL)      /*!< Position of CH9 field.                                               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH9_Pos) /*!< Bit mask of CH9 field.               */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_Min (0x0UL)    /*!< Min enumerator value of CH9 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_Max (0x1UL)    /*!< Max enumerator value of CH9 field.                                   */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_NotOwn (0x1UL) /*!< Do not own the channel 9                                             */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH9_Own (0x0UL)    /*!< Own the channel 9                                                    */

/* CH10 @Bit 10 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_Pos (10UL)    /*!< Position of CH10 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH10_Pos) /*!< Bit mask of CH10 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_Min (0x0UL)   /*!< Min enumerator value of CH10 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_Max (0x1UL)   /*!< Max enumerator value of CH10 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_NotOwn (0x1UL) /*!< Do not own the channel 10                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH10_Own (0x0UL)   /*!< Own the channel 10                                                   */

/* CH11 @Bit 11 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_Pos (11UL)    /*!< Position of CH11 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH11_Pos) /*!< Bit mask of CH11 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_Min (0x0UL)   /*!< Min enumerator value of CH11 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_Max (0x1UL)   /*!< Max enumerator value of CH11 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_NotOwn (0x1UL) /*!< Do not own the channel 11                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH11_Own (0x0UL)   /*!< Own the channel 11                                                   */

/* CH12 @Bit 12 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_Pos (12UL)    /*!< Position of CH12 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH12_Pos) /*!< Bit mask of CH12 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_Min (0x0UL)   /*!< Min enumerator value of CH12 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_Max (0x1UL)   /*!< Max enumerator value of CH12 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_NotOwn (0x1UL) /*!< Do not own the channel 12                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH12_Own (0x0UL)   /*!< Own the channel 12                                                   */

/* CH13 @Bit 13 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_Pos (13UL)    /*!< Position of CH13 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH13_Pos) /*!< Bit mask of CH13 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_Min (0x0UL)   /*!< Min enumerator value of CH13 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_Max (0x1UL)   /*!< Max enumerator value of CH13 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_NotOwn (0x1UL) /*!< Do not own the channel 13                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH13_Own (0x0UL)   /*!< Own the channel 13                                                   */

/* CH14 @Bit 14 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_Pos (14UL)    /*!< Position of CH14 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH14_Pos) /*!< Bit mask of CH14 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_Min (0x0UL)   /*!< Min enumerator value of CH14 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_Max (0x1UL)   /*!< Max enumerator value of CH14 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_NotOwn (0x1UL) /*!< Do not own the channel 14                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH14_Own (0x0UL)   /*!< Own the channel 14                                                   */

/* CH15 @Bit 15 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_Pos (15UL)    /*!< Position of CH15 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH15_Pos) /*!< Bit mask of CH15 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_Min (0x0UL)   /*!< Min enumerator value of CH15 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_Max (0x1UL)   /*!< Max enumerator value of CH15 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_NotOwn (0x1UL) /*!< Do not own the channel 15                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH15_Own (0x0UL)   /*!< Own the channel 15                                                   */

/* CH16 @Bit 16 : Channel number */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_Pos (16UL)    /*!< Position of CH16 field.                                              */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_OWN_CH16_Pos) /*!< Bit mask of CH16 field.            */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_Min (0x0UL)   /*!< Min enumerator value of CH16 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_Max (0x1UL)   /*!< Max enumerator value of CH16 field.                                  */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_NotOwn (0x1UL) /*!< Do not own the channel 16                                           */
  #define UICR_DPPI_GLOBAL_CH_OWN_CH16_Own (0x0UL)   /*!< Own the channel 16                                                   */

