tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UICR_TRACE_PORTCONFIG: Trace port speed configuration */
  #define UICR_TRACE_PORTCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PORTCONFIG register.                             */

/* PORTCONFIG @Bits 0..1 : (unspecified) */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos (0UL) /*!< Position of PORTCONFIG field.                                        */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Msk (0x3UL << UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos) /*!< Bit mask of PORTCONFIG
                                                                            field.*/
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Min (0x0UL) /*!< Min enumerator value of PORTCONFIG field.                          */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Max (0x3UL) /*!< Max enumerator value of PORTCONFIG field.                          */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_FullSpeed (0x3UL) /*!< Full speed                                                   */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_HalfSpeed (0x2UL) /*!< Half speed                                                   */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_QuarterSpeed (0x1UL) /*!< One quarter speed                                         */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_EightSpeed (0x0UL) /*!< One eigth speed                                             */


/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User information configuration registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_MEM_Type MEM[16];                 /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[32];
    __IOM NRF_UICR_PERIPH_Type PERIPH[192];          /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED1[32];
    __IOM NRF_UICR_GPIOTE_Type GPIOTE[4];            /*!< (@ 0x00000480) (unspecified)                                         */
    __IOM NRF_UICR_IPCT_Type IPCT;                   /*!< (@ 0x000004B0) (unspecified)                                         */
    __IOM NRF_UICR_DPPI_Type DPPI;                   /*!< (@ 0x000004E0) (unspecified)                                         */
    __IM uint32_t RESERVED2[2];
    __IOM NRF_UICR_GRTC_Type GRTC;                   /*!< (@ 0x00000660) (unspecified)                                         */
    __IM uint32_t RESERVED3[6];
    __IOM uint32_t IPCMAP[16];                       /*!< (@ 0x00000680) Request configuration for the channel n of IPCMAP     */
    __IM uint32_t RESERVED4[16];
    __IOM NRF_UICR_MAILBOX_Type MAILBOX[8];          /*!< (@ 0x00000700) (unspecified)                                         */
    __IOM NRF_UICR_TRACE_Type TRACE;                 /*!< (@ 0x00000740) (unspecified)                                         */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t INITSVTOR;                        /*!< (@ 0x00000780) Initial value of the secure VTOR (Vector Table Offset
                                                                         Register) after CPU reset.*/
    __IOM uint32_t INITNSVTOR;                       /*!< (@ 0x00000784) Initial value of the non-secure VTOR (Vector Table
                                                                         Offset Register).*/
    __IM uint32_t RESERVED6[29];
    __IOM uint32_t PTREXTUICR;                       /*!< (@ 0x000007FC) Pointer to extended UICR.                             */
  } NRF_UICR_Type;                                   /*!< Size = 2048 (0x800)                                                  */

/* UICR_IPCMAP: Request configuration for the channel n of IPCMAP */
  #define UICR_IPCMAP_MaxCount (16UL)                /*!< Max size of IPCMAP[16] array.                                        */
  #define UICR_IPCMAP_MaxIndex (15UL)                /*!< Max index of IPCMAP[16] array.                                       */
  #define UICR_IPCMAP_MinIndex (0UL)                 /*!< Min index of IPCMAP[16] array.                                       */
  #define UICR_IPCMAP_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of IPCMAP[16] register.                                  */

/* IPCTCHSINK @Bits 0..7 : IPCT channel number (sink side) */
  #define UICR_IPCMAP_IPCTCHSINK_Pos (0UL)           /*!< Position of IPCTCHSINK field.                                        */
  #define UICR_IPCMAP_IPCTCHSINK_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSINK_Pos) /*!< Bit mask of IPCTCHSINK field.                 */

/* DOMAINIDSINK @Bits 8..11 : Domain ID (sink side) */
  #define UICR_IPCMAP_DOMAINIDSINK_Pos (8UL)         /*!< Position of DOMAINIDSINK field.                                      */
  #define UICR_IPCMAP_DOMAINIDSINK_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSINK_Pos) /*!< Bit mask of DOMAINIDSINK field.            */

/* IPCTCHSOURCE @Bits 16..23 : IPCT channel number (source side) */
  #define UICR_IPCMAP_IPCTCHSOURCE_Pos (16UL)        /*!< Position of IPCTCHSOURCE field.                                      */
  #define UICR_IPCMAP_IPCTCHSOURCE_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSOURCE_Pos) /*!< Bit mask of IPCTCHSOURCE field.           */

/* DOMAINIDSOURCE @Bits 24..27 : Domain ID (source side) */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Pos (24UL)      /*!< Position of DOMAINIDSOURCE field.                                    */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSOURCE_Pos) /*!< Bit mask of DOMAINIDSOURCE field.      */


/* UICR_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define UICR_INITSVTOR_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of INITSVTOR register.                                   */

/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITSVTOR_INITSVTOR_Pos (0UL)         /*!< Position of INITSVTOR field.                                         */
  #define UICR_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << UICR_INITSVTOR_INITSVTOR_Pos) /*!< Bit mask of INITSVTOR field.        */


