tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* UICR_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define UICR_INITNSVTOR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of INITNSVTOR register.                                  */

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITNSVTOR_INITNSVTOR_Pos (0UL)       /*!< Position of INITNSVTOR field.                                        */
  #define UICR_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << UICR_INITNSVTOR_INITNSVTOR_Pos) /*!< Bit mask of INITNSVTOR field.   */


/* UICR_PTREXTUICR: Pointer to extended UICR. */
  #define UICR_PTREXTUICR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of PTREXTUICR register.                                  */

/* PTREXTUICR @Bits 0..31 : Pointer to extended UICR. */
  #define UICR_PTREXTUICR_PTREXTUICR_Pos (0UL)       /*!< Position of PTREXTUICR field.                                        */
  #define UICR_PTREXTUICR_PTREXTUICR_Msk (0xFFFFFFFFUL << UICR_PTREXTUICR_PTREXTUICR_Pos) /*!< Bit mask of PTREXTUICR field.   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {                                   /*!< USBHS Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the USB peripheral.                             */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at USBHS
                                                                         core*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable USB peripheral.                                */
  } NRF_USBHS_Type;                                  /*!< Size = 1028 (0x404)                                                  */

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* USBHS_EVENTS_CORE: Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Pos (0UL)    /*!< Position of EVENTS_CORE field.                                       */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << USBHS_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.   */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                 */


/* USBHS_INTEN: Enable or disable interrupt */
  #define USBHS_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define USBHS_INTEN_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define USBHS_INTEN_CORE_Msk (0x1UL << USBHS_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define USBHS_INTEN_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_INTEN_CORE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define USBHS_INTEN_CORE_Enabled (0x1UL)           /*!< Enable                                                               */


/* USBHS_INTENSET: Enable interrupt */
  #define USBHS_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

