tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NYETMSK @Bit 6 : NYET Response Received Interrupt Mask (NyetMsk) */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Pos (6UL)      /*!< Position of NYETMSK field.                                           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NYETMSK_Pos) /*!< Bit mask of NYETMSK field.           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Min (0x0UL)    /*!< Min enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Max (0x1UL)    /*!< Max enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_MASK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_INTMSK_NYETMSK_NOMASK (0x1UL) /*!< (unspecified)                                                        */

/* XACTERRMSK @Bit 7 : Transaction Error Mask (XactErrMsk) */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Pos (7UL)   /*!< Position of XACTERRMSK field.                                        */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XACTERRMSK_Pos) /*!< Bit mask of XACTERRMSK field.  */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Min (0x0UL) /*!< Min enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Max (0x1UL) /*!< Max enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_MASK (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_NOMASK (0x1UL) /*!< (unspecified)                                                     */

/* BBLERRMSK @Bit 8 : Babble Error Mask (BblErrMsk) */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Pos (8UL)    /*!< Position of BBLERRMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_BBLERRMSK_Pos) /*!< Bit mask of BBLERRMSK field.     */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Min (0x0UL)  /*!< Min enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Max (0x1UL)  /*!< Max enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_MASK (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_NOMASK (0x1UL) /*!< (unspecified)                                                      */

/* FRMOVRUNMSK @Bit 9 : Frame Overrun Mask (FrmOvrunMsk) */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos (9UL)  /*!< Position of FRMOVRUNMSK field.                                       */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos) /*!< Bit mask of FRMOVRUNMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Min (0x0UL) /*!< Min enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Max (0x1UL) /*!< Max enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_MASK (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_NOMASK (0x1UL) /*!< (unspecified)                                                    */

/* DATATGLERRMSK @Bit 10 : Data Toggle Error Mask (DataTglErrMsk) */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos (10UL) /*!< Position of DATATGLERRMSK field.                                   */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos) /*!< Bit mask of DATATGLERRMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Min (0x0UL) /*!< Min enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Max (0x1UL) /*!< Max enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_MASK (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_NOMASK (0x1UL) /*!< (unspecified)                                                  */


/* USBHSCORE_HC_TSIZ: Host Channel n Transfer Size Register */
  #define USBHSCORE_HC_TSIZ_ResetValue (0x00000000UL) /*!< Reset value of TSIZ register.                                       */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Pos (0UL)       /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_HC_TSIZ_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.        */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Pos (19UL)        /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Msk (0x3FFUL << USBHSCORE_HC_TSIZ_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.                */

/* PID @Bits 29..30 : PID (Pid) */
  #define USBHSCORE_HC_TSIZ_PID_Pos (29UL)           /*!< Position of PID field.                                               */
  #define USBHSCORE_HC_TSIZ_PID_Msk (0x3UL << USBHSCORE_HC_TSIZ_PID_Pos) /*!< Bit mask of PID field.                           */
  #define USBHSCORE_HC_TSIZ_PID_Min (0x0UL)          /*!< Min enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_Max (0x3UL)          /*!< Max enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_DATA0 (0x0UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_TSIZ_PID_DATA2 (0x1UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_TSIZ_PID_DATA1 (0x2UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_TSIZ_PID_MDATA (0x3UL)        /*!< (unspecified)                                                        */

/* DOPNG @Bit 31 : Do Ping (DoPng) */
  #define USBHSCORE_HC_TSIZ_DOPNG_Pos (31UL)         /*!< Position of DOPNG field.                                             */
  #define USBHSCORE_HC_TSIZ_DOPNG_Msk (0x1UL << USBHSCORE_HC_TSIZ_DOPNG_Pos) /*!< Bit mask of DOPNG field.                     */
  #define USBHSCORE_HC_TSIZ_DOPNG_Min (0x0UL)        /*!< Min enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_Max (0x1UL)        /*!< Max enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_NOPING (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HC_TSIZ_DOPNG_PING (0x1UL)       /*!< (unspecified)                                                        */


/* USBHSCORE_HC_DMA: Host Channel n DMA Address Register */
  #define USBHSCORE_HC_DMA_ResetValue (0x00000000UL) /*!< Reset value of DMA register.                                         */

/* DMAADDR @Bits 0..31 : In Buffer DMA Mode: */
  #define USBHSCORE_HC_DMA_DMAADDR_Pos (0UL)         /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_HC_DMA_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_HC_DMA_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.          */



/* ============================================== Struct USBHSCORE_DWCOTGDFIFO =============================================== */
/**
  * @brief DWCOTGDFIFO [USBHSCORE_DWCOTGDFIFO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[1025];                        /*!< (@ 0x00000000) Data buffer for FIFO n                                */
} NRF_USBHSCORE_DWCOTGDFIFO_Type;                    /*!< Size = 4100 (0x1004)                                                 */
  #define USBHSCORE_DWCOTGDFIFO_MaxCount (16UL)      /*!< Size of DWCOTGDFIFO[16] array.                                       */
  #define USBHSCORE_DWCOTGDFIFO_MaxIndex (15UL)      /*!< Max index of DWCOTGDFIFO[16] array.                                  */
  #define USBHSCORE_DWCOTGDFIFO_MinIndex (0UL)       /*!< Min index of DWCOTGDFIFO[16] array.                                  */


/* ======================================== Struct USBHSCORE_DWCOTGDFIFODIRECTACCESS ========================================= */
/**
  * @brief DWCOTGDFIFODIRECTACCESS [USBHSCORE_DWCOTGDFIFODIRECTACCESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[4097];                        /*!< (@ 0x00000000) Data buffer FIFO Direct Access                        */
} NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type;        /*!< Size = 16388 (0x4004)                                                */

