tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* ==================================================== Struct USBHSCORE ===================================================== */
/**
  * @brief USBHSCORE
  */
  typedef struct {                                   /*!< USBHSCORE Structure                                                  */
    __IOM uint32_t GOTGCTL;                          /*!< (@ 0x00000000) OTG Control and Status Register                       */
    __IOM uint32_t GOTGINT;                          /*!< (@ 0x00000004) OTG Interrupt Register                                */
    __IOM uint32_t GAHBCFG;                          /*!< (@ 0x00000008) AHB Configuration Register                            */
    __IOM uint32_t GUSBCFG;                          /*!< (@ 0x0000000C) USB Configuration Register                            */
    __IOM uint32_t GRSTCTL;                          /*!< (@ 0x00000010) Reset Register                                        */
    __IOM uint32_t GINTSTS;                          /*!< (@ 0x00000014) Interrupt Register                                    */
    __IOM uint32_t GINTMSK;                          /*!< (@ 0x00000018) Interrupt Mask Register                               */
    __IOM uint32_t GRXSTSR;                          /*!< (@ 0x0000001C) Receive Status Debug Read Register                    */
    __IOM uint32_t GRXSTSP;                          /*!< (@ 0x00000020) Receive Status Read/Pop Register                      */
    __IOM uint32_t GRXFSIZ;                          /*!< (@ 0x00000024) Receive FIFO Size Register                            */
    __IOM uint32_t GNPTXFSIZ;                        /*!< (@ 0x00000028) Non-periodic Transmit FIFO Size Register              */
    __IOM uint32_t GNPTXSTS;                         /*!< (@ 0x0000002C) Non-periodic Transmit FIFO/Queue Status Register      */
    __IM uint32_t RESERVED[2];
    __IOM uint32_t GGPIO;                            /*!< (@ 0x00000038) General Purpose Input/Output Register                 */
    __IOM uint32_t GUID;                             /*!< (@ 0x0000003C) User ID Register                                      */
    __IOM uint32_t GSNPSID;                          /*!< (@ 0x00000040) Synopsys ID Register                                  */
    __IOM uint32_t GHWCFG1;                          /*!< (@ 0x00000044) User Hardware Configuration 1 Register                */
    __IOM uint32_t GHWCFG2;                          /*!< (@ 0x00000048) User Hardware Configuration 2 Register                */
    __IOM uint32_t GHWCFG3;                          /*!< (@ 0x0000004C) User Hardware Configuration 3 Register                */
    __IOM uint32_t GHWCFG4;                          /*!< (@ 0x00000050) User Hardware Configuration 4 Register                */
    __IOM uint32_t GLPMCFG;                          /*!< (@ 0x00000054) LPM Config Register                                   */
    __IOM uint32_t GPWRDN;                           /*!< (@ 0x00000058) Global Power Down register                            */
    __IOM uint32_t GDFIFOCFG;                        /*!< (@ 0x0000005C) Global DFIFO Configuration Register                   */
    __IM uint32_t RESERVED1[2];
    __IOM uint32_t GINTMSK2;                         /*!< (@ 0x00000068) Interrupt Mask Register 2                             */
    __IOM uint32_t GINTSTS2;                         /*!< (@ 0x0000006C) Interrupt Register 2                                  */
    __IM uint32_t RESERVED2[36];
    __IOM uint32_t HPTXFSIZ;                         /*!< (@ 0x00000100) Host Periodic Transmit FIFO Size Register             */
    __IOM uint32_t DIEPTXF1;                         /*!< (@ 0x00000104) Device IN Endpoint Transmit FIFO Size Register 1      */
    __IOM uint32_t DIEPTXF2;                         /*!< (@ 0x00000108) Device IN Endpoint Transmit FIFO Size Register 2      */
    __IOM uint32_t DIEPTXF3;                         /*!< (@ 0x0000010C) Device IN Endpoint Transmit FIFO Size Register 3      */
    __IOM uint32_t DIEPTXF4;                         /*!< (@ 0x00000110) Device IN Endpoint Transmit FIFO Size Register 4      */
    __IOM uint32_t DIEPTXF5;                         /*!< (@ 0x00000114) Device IN Endpoint Transmit FIFO Size Register 5      */
    __IOM uint32_t DIEPTXF6;                         /*!< (@ 0x00000118) Device IN Endpoint Transmit FIFO Size Register 6      */
    __IOM uint32_t DIEPTXF7;                         /*!< (@ 0x0000011C) Device IN Endpoint Transmit FIFO Size Register 7      */
    __IM uint32_t RESERVED3[184];
    __IOM uint32_t HCFG;                             /*!< (@ 0x00000400) Host Configuration Register                           */
    __IOM uint32_t HFIR;                             /*!< (@ 0x00000404) Host Frame Interval Register                          */
    __IOM uint32_t HFNUM;                            /*!< (@ 0x00000408) Host Frame Number/Frame Time Remaining Register       */
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t HAINT;                            /*!< (@ 0x00000414) Host All Channels Interrupt Register                  */
    __IOM uint32_t HAINTMSK;                         /*!< (@ 0x00000418) Host All Channels Interrupt Mask Register             */
    __IM uint32_t RESERVED5[9];
    __IOM uint32_t HPRT;                             /*!< (@ 0x00000440) Host Port Control and Status Register                 */
    __IM uint32_t RESERVED6[47];
    __IOM NRF_USBHSCORE_HC_Type HC[16];              /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[64];
    __IOM uint32_t DCFG;                             /*!< (@ 0x00000800) Device Configuration Register                         */
    __IOM uint32_t DCTL;                             /*!< (@ 0x00000804) Device Control Register                               */
    __IOM uint32_t DSTS;                             /*!< (@ 0x00000808) Device Status Register                                */
    __IM uint32_t RESERVED8;
    __IOM uint32_t DIEPMSK;                          /*!< (@ 0x00000810) Device IN Endpoint Common Interrupt Mask Register     */
    __IOM uint32_t DOEPMSK;                          /*!< (@ 0x00000814) Device OUT Endpoint Common Interrupt Mask Register    */
    __IOM uint32_t DAINT;                            /*!< (@ 0x00000818) Device All Endpoints Interrupt Register               */
    __IOM uint32_t DAINTMSK;                         /*!< (@ 0x0000081C) Device All Endpoints Interrupt Mask Register          */
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t DVBUSDIS;                         /*!< (@ 0x00000828) Device VBUS Discharge Time Register                   */
    __IOM uint32_t DVBUSPULSE;                       /*!< (@ 0x0000082C) Device VBUS Pulsing Time Register                     */
    __IOM uint32_t DTHRCTL;                          /*!< (@ 0x00000830) Device Threshold Control Register                     */
    __IOM uint32_t DIEPEMPMSK;                       /*!< (@ 0x00000834) Device IN Endpoint FIFO Empty Interrupt Mask Register */
    __IM uint32_t RESERVED10[50];
    __IOM uint32_t DIEPCTL0;                         /*!< (@ 0x00000900) Device Control IN Endpoint 0 Control Register         */
    __IM uint32_t RESERVED11;
    __IOM uint32_t DIEPINT0;                         /*!< (@ 0x00000908) Device IN Endpoint 0 Interrupt Register               */
    __IM uint32_t RESERVED12;
    __IOM uint32_t DIEPTSIZ0;                        /*!< (@ 0x00000910) Device IN Endpoint 0 Transfer Size Register           */
    __IOM uint32_t DIEPDMA0;                         /*!< (@ 0x00000914) Device IN Endpoint 0 DMA Address Register             */
    __IOM uint32_t DTXFSTS0;                         /*!< (@ 0x00000918) Device IN Endpoint Transmit FIFO Status Register 0    */
    __IM uint32_t RESERVED13;
    __IOM uint32_t DIEPCTL1;                         /*!< (@ 0x00000920) Device Control IN Endpoint 1 Control Register         */
    __IM uint32_t RESERVED14;
    __IOM uint32_t DIEPINT1;                         /*!< (@ 0x00000928) Device IN Endpoint 1 Interrupt Register               */
    __IM uint32_t RESERVED15;
    __IOM uint32_t DIEPTSIZ1;                        /*!< (@ 0x00000930) Device IN Endpoint 1 Transfer Size Register           */
    __IOM uint32_t DIEPDMA1;                         /*!< (@ 0x00000934) Device IN Endpoint 1 DMA Address Register             */
    __IOM uint32_t DTXFSTS1;                         /*!< (@ 0x00000938) This register reflects the status of the IN Endpoint
                                                                         Transmit FIFO Status Register 1 of the Device
                                                                         controller.*/
    __IM uint32_t RESERVED16;
    __IOM uint32_t DIEPCTL2;                         /*!< (@ 0x00000940) Device Control IN Endpoint 2 Control Register         */
    __IM uint32_t RESERVED17;
    __IOM uint32_t DIEPINT2;                         /*!< (@ 0x00000948) Device IN Endpoint 2 Interrupt Register               */
    __IM uint32_t RESERVED18;
    __IOM uint32_t DIEPTSIZ2;                        /*!< (@ 0x00000950) Device IN Endpoint 2 Transfer Size Register           */
    __IOM uint32_t DIEPDMA2;                         /*!< (@ 0x00000954) Device IN Endpoint 2 DMA Address Register             */
    __IOM uint32_t DTXFSTS2;                         /*!< (@ 0x00000958) Device IN Endpoint Transmit FIFO Status Register 2    */
    __IM uint32_t RESERVED19;
    __IOM uint32_t DIEPCTL3;                         /*!< (@ 0x00000960) Device Control IN Endpoint 3 Control Register         */
    __IM uint32_t RESERVED20;
    __IOM uint32_t DIEPINT3;                         /*!< (@ 0x00000968) Device IN Endpoint 3 Interrupt Register               */
    __IM uint32_t RESERVED21;
    __IOM uint32_t DIEPTSIZ3;                        /*!< (@ 0x00000970) Device IN Endpoint 3 Transfer Size Register           */
    __IOM uint32_t DIEPDMA3;                         /*!< (@ 0x00000974) Device IN Endpoint 3 DMA Address Register             */
    __IOM uint32_t DTXFSTS3;                         /*!< (@ 0x00000978) Device IN Endpoint Transmit FIFO Status Register 3    */
    __IM uint32_t RESERVED22;
    __IOM uint32_t DIEPCTL4;                         /*!< (@ 0x00000980) Device Control IN Endpoint 4 Control Register         */
    __IM uint32_t RESERVED23;
    __IOM uint32_t DIEPINT4;                         /*!< (@ 0x00000988) Device IN Endpoint 4 Interrupt Register               */
    __IM uint32_t RESERVED24;
    __IOM uint32_t DIEPTSIZ4;                        /*!< (@ 0x00000990) Device IN Endpoint 4 Transfer Size Register           */
    __IOM uint32_t DIEPDMA4;                         /*!< (@ 0x00000994) Device IN Endpoint 4 DMA Address Register             */
    __IOM uint32_t DTXFSTS4;                         /*!< (@ 0x00000998) Device IN Endpoint Transmit FIFO Status Register 4    */
    __IM uint32_t RESERVED25;
    __IOM uint32_t DIEPCTL5;                         /*!< (@ 0x000009A0) Device Control IN Endpoint 5 Control Register         */
    __IM uint32_t RESERVED26;
    __IOM uint32_t DIEPINT5;                         /*!< (@ 0x000009A8) Device IN Endpoint 5 Interrupt Register               */
    __IM uint32_t RESERVED27;
    __IOM uint32_t DIEPTSIZ5;                        /*!< (@ 0x000009B0) Device IN Endpoint 5 Transfer Size Register           */
    __IOM uint32_t DIEPDMA5;                         /*!< (@ 0x000009B4) Device IN Endpoint 5 DMA Address Register             */
    __IOM uint32_t DTXFSTS5;                         /*!< (@ 0x000009B8) Device IN Endpoint Transmit FIFO Status Register 5    */
    __IM uint32_t RESERVED28;
    __IOM uint32_t DIEPCTL6;                         /*!< (@ 0x000009C0) Device Control IN Endpoint 6 Control Register         */
    __IM uint32_t RESERVED29;
    __IOM uint32_t DIEPINT6;                         /*!< (@ 0x000009C8) Device IN Endpoint 6 Interrupt Register               */
    __IM uint32_t RESERVED30;
    __IOM uint32_t DIEPTSIZ6;                        /*!< (@ 0x000009D0) Device IN Endpoint 6 Transfer Size Register           */
    __IOM uint32_t DIEPDMA6;                         /*!< (@ 0x000009D4) Device IN Endpoint 6 DMA Address Register             */
    __IOM uint32_t DTXFSTS6;                         /*!< (@ 0x000009D8) Device IN Endpoint Transmit FIFO Status Register 6    */
    __IM uint32_t RESERVED31;
    __IOM uint32_t DIEPCTL7;                         /*!< (@ 0x000009E0) Device Control IN Endpoint 7 Control Register         */
    __IM uint32_t RESERVED32;
    __IOM uint32_t DIEPINT7;                         /*!< (@ 0x000009E8) Device IN Endpoint 7 Interrupt Register               */
    __IM uint32_t RESERVED33;
    __IOM uint32_t DIEPTSIZ7;                        /*!< (@ 0x000009F0) Device IN Endpoint 7 Transfer Size Register           */
    __IOM uint32_t DIEPDMA7;                         /*!< (@ 0x000009F4) Device IN Endpoint 7 DMA Address Register             */
    __IOM uint32_t DTXFSTS7;                         /*!< (@ 0x000009F8) Device IN Endpoint Transmit FIFO Status Register 7    */
    __IM uint32_t RESERVED34;
    __IOM uint32_t DIEPCTL8;                         /*!< (@ 0x00000A00) Device Control IN Endpoint 8 Control Register         */
    __IM uint32_t RESERVED35;
    __IOM uint32_t DIEPINT8;                         /*!< (@ 0x00000A08) Device IN Endpoint 8 Interrupt Register               */
    __IM uint32_t RESERVED36;
    __IOM uint32_t DIEPTSIZ8;                        /*!< (@ 0x00000A10) Device IN Endpoint 8 Transfer Size Register           */
    __IOM uint32_t DIEPDMA8;                         /*!< (@ 0x00000A14) Device IN Endpoint 8 DMA Address Register             */
    __IOM uint32_t DTXFSTS8;                         /*!< (@ 0x00000A18) Device IN Endpoint Transmit FIFO Status Register 8    */
    __IM uint32_t RESERVED37;
    __IOM uint32_t DIEPCTL9;                         /*!< (@ 0x00000A20) Device Control IN Endpoint 9 Control Register         */
    __IM uint32_t RESERVED38;
    __IOM uint32_t DIEPINT9;                         /*!< (@ 0x00000A28) Device IN Endpoint 9 Interrupt Register               */
    __IM uint32_t RESERVED39;
    __IOM uint32_t DIEPTSIZ9;                        /*!< (@ 0x00000A30) Device IN Endpoint 9 Transfer Size Register           */
    __IOM uint32_t DIEPDMA9;                         /*!< (@ 0x00000A34) Device IN Endpoint 9 DMA Address Register             */
    __IOM uint32_t DTXFSTS9;                         /*!< (@ 0x00000A38) Device IN Endpoint Transmit FIFO Status Register 9    */
    __IM uint32_t RESERVED40;
    __IOM uint32_t DIEPCTL10;                        /*!< (@ 0x00000A40) Device Control IN Endpoint 10 Control Register        */
    __IM uint32_t RESERVED41;
    __IOM uint32_t DIEPINT10;                        /*!< (@ 0x00000A48) Device IN Endpoint 10 Interrupt Register              */
    __IM uint32_t RESERVED42;
    __IOM uint32_t DIEPTSIZ10;                       /*!< (@ 0x00000A50) Device IN Endpoint 10 Transfer Size Register          */
    __IOM uint32_t DIEPDMA10;                        /*!< (@ 0x00000A54) Device IN Endpoint 10 DMA Address Register            */
    __IOM uint32_t DTXFSTS10;                        /*!< (@ 0x00000A58) Device IN Endpoint Transmit FIFO Status Register 10   */
    __IM uint32_t RESERVED43;
    __IOM uint32_t DIEPCTL11;                        /*!< (@ 0x00000A60) Device Control IN Endpoint 11 Control Register        */
    __IM uint32_t RESERVED44;
    __IOM uint32_t DIEPINT11;                        /*!< (@ 0x00000A68) Device IN Endpoint 11 Interrupt Register              */
    __IM uint32_t RESERVED45;
    __IOM uint32_t DIEPTSIZ11;                       /*!< (@ 0x00000A70) Device IN Endpoint 11 Transfer Size Register          */
    __IOM uint32_t DIEPDMA11;                        /*!< (@ 0x00000A74) Device IN Endpoint 11 DMA Address Register            */
    __IOM uint32_t DTXFSTS11;                        /*!< (@ 0x00000A78) Device IN Endpoint Transmit FIFO Status Register 11   */
    __IM uint32_t RESERVED46[33];
    __IOM uint32_t DOEPCTL0;                         /*!< (@ 0x00000B00) Device Control OUT Endpoint 0 Control Register        */
    __IM uint32_t RESERVED47;
    __IOM uint32_t DOEPINT0;                         /*!< (@ 0x00000B08) Device OUT Endpoint 0 Interrupt Register              */
    __IM uint32_t RESERVED48;
    __IOM uint32_t DOEPTSIZ0;                        /*!< (@ 0x00000B10) Device OUT Endpoint 0 Transfer Size Register          */
    __IOM uint32_t DOEPDMA0;                         /*!< (@ 0x00000B14) Device OUT Endpoint 0 DMA Address Register            */
    __IM uint32_t RESERVED49[2];
    __IOM uint32_t DOEPCTL1;                         /*!< (@ 0x00000B20) Device Control OUT Endpoint 1 Control Register        */
    __IM uint32_t RESERVED50;
    __IOM uint32_t DOEPINT1;                         /*!< (@ 0x00000B28) Device OUT Endpoint 1 Interrupt Register              */
    __IM uint32_t RESERVED51;
    __IOM uint32_t DOEPTSIZ1;                        /*!< (@ 0x00000B30) Device OUT Endpoint 1 Transfer Size Register          */
    __IOM uint32_t DOEPDMA1;                         /*!< (@ 0x00000B34) Device OUT Endpoint 1 DMA Address Register            */
    __IM uint32_t RESERVED52[2];
    __IOM uint32_t DOEPCTL2;                         /*!< (@ 0x00000B40) Device Control OUT Endpoint 2 Control Register        */
    __IM uint32_t RESERVED53;
    __IOM uint32_t DOEPINT2;                         /*!< (@ 0x00000B48) Device OUT Endpoint 2 Interrupt Register              */
    __IM uint32_t RESERVED54;
    __IOM uint32_t DOEPTSIZ2;                        /*!< (@ 0x00000B50) Device OUT Endpoint 2 Transfer Size Register          */
    __IOM uint32_t DOEPDMA2;                         /*!< (@ 0x00000B54) Device OUT Endpoint 2 DMA Address Register            */
    __IM uint32_t RESERVED55[2];
    __IOM uint32_t DOEPCTL3;                         /*!< (@ 0x00000B60) Device Control OUT Endpoint 3 Control Register        */
    __IM uint32_t RESERVED56;
    __IOM uint32_t DOEPINT3;                         /*!< (@ 0x00000B68) Device OUT Endpoint 3 Interrupt Register              */
    __IM uint32_t RESERVED57;
    __IOM uint32_t DOEPTSIZ3;                        /*!< (@ 0x00000B70) Device OUT Endpoint 3 Transfer Size Register          */
    __IOM uint32_t DOEPDMA3;                         /*!< (@ 0x00000B74) Device OUT Endpoint 3 DMA Address Register            */
    __IM uint32_t RESERVED58[2];
    __IOM uint32_t DOEPCTL4;                         /*!< (@ 0x00000B80) Device Control OUT Endpoint 4 Control Register        */
    __IM uint32_t RESERVED59;
    __IOM uint32_t DOEPINT4;                         /*!< (@ 0x00000B88) Device OUT Endpoint 4 Interrupt Register              */
    __IM uint32_t RESERVED60;
    __IOM uint32_t DOEPTSIZ4;                        /*!< (@ 0x00000B90) Device OUT Endpoint 4 Transfer Size Register          */
    __IOM uint32_t DOEPDMA4;                         /*!< (@ 0x00000B94) Device OUT Endpoint 4 DMA Address Register            */
    __IM uint32_t RESERVED61[2];
    __IOM uint32_t DOEPCTL5;                         /*!< (@ 0x00000BA0) Device Control OUT Endpoint 5 Control Register        */
    __IM uint32_t RESERVED62;
    __IOM uint32_t DOEPINT5;                         /*!< (@ 0x00000BA8) Device OUT Endpoint 5 Interrupt Register              */
    __IM uint32_t RESERVED63;
    __IOM uint32_t DOEPTSIZ5;                        /*!< (@ 0x00000BB0) Device OUT Endpoint 5 Transfer Size Register          */
    __IOM uint32_t DOEPDMA5;                         /*!< (@ 0x00000BB4) Device OUT Endpoint 5 DMA Address Register            */
    __IM uint32_t RESERVED64[50];
    __IOM uint32_t DOEPCTL12;                        /*!< (@ 0x00000C80) Device Control OUT Endpoint 12 Control Register       */
    __IM uint32_t RESERVED65;
    __IOM uint32_t DOEPINT12;                        /*!< (@ 0x00000C88) Device OUT Endpoint 12 Interrupt Register             */
    __IM uint32_t RESERVED66;
    __IOM uint32_t DOEPTSIZ12;                       /*!< (@ 0x00000C90) Device OUT Endpoint 12 Transfer Size Register         */
    __IOM uint32_t DOEPDMA12;                        /*!< (@ 0x00000C94) Device OUT Endpoint 12 DMA Address Register           */
    __IM uint32_t RESERVED67[2];
    __IOM uint32_t DOEPCTL13;                        /*!< (@ 0x00000CA0) Device Control OUT Endpoint 13 Control Register       */
    __IM uint32_t RESERVED68;
    __IOM uint32_t DOEPINT13;                        /*!< (@ 0x00000CA8) Device OUT Endpoint 13 Interrupt Register             */
    __IM uint32_t RESERVED69;
    __IOM uint32_t DOEPTSIZ13;                       /*!< (@ 0x00000CB0) Device OUT Endpoint 13 Transfer Size Register         */
    __IOM uint32_t DOEPDMA13;                        /*!< (@ 0x00000CB4) Device OUT Endpoint 13 DMA Address Register           */
    __IM uint32_t RESERVED70[2];
    __IOM uint32_t DOEPCTL14;                        /*!< (@ 0x00000CC0) Device Control OUT Endpoint 14 Control Register       */
    __IM uint32_t RESERVED71;
    __IOM uint32_t DOEPINT14;                        /*!< (@ 0x00000CC8) Device OUT Endpoint 14 Interrupt Register             */
    __IM uint32_t RESERVED72;
    __IOM uint32_t DOEPTSIZ14;                       /*!< (@ 0x00000CD0) Device OUT Endpoint 14 Transfer Size Register         */
    __IOM uint32_t DOEPDMA14;                        /*!< (@ 0x00000CD4) Device OUT Endpoint 14 DMA Address Register           */
    __IM uint32_t RESERVED73[2];
    __IOM uint32_t DOEPCTL15;                        /*!< (@ 0x00000CE0) Device Control OUT Endpoint 15 Control Register       */
    __IM uint32_t RESERVED74;
    __IOM uint32_t DOEPINT15;                        /*!< (@ 0x00000CE8) Device OUT Endpoint 15 Interrupt Register             */
    __IM uint32_t RESERVED75;
    __IOM uint32_t DOEPTSIZ15;                       /*!< (@ 0x00000CF0) Device OUT Endpoint 15 Transfer Size Register         */
    __IOM uint32_t DOEPDMA15;                        /*!< (@ 0x00000CF4) Device OUT Endpoint 15 DMA Address Register           */
    __IM uint32_t RESERVED76[66];
    __IOM uint32_t PCGCCTL;                          /*!< (@ 0x00000E00) Power and Clock Gating Control Register               */
    __IM uint32_t RESERVED77[127];
    __IOM NRF_USBHSCORE_DWCOTGDFIFO_Type DWCOTGDFIFO[16]; /*!< (@ 0x00001000) (unspecified)                                    */
    __IM uint32_t RESERVED78[15344];
    __IOM NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type DWCOTGDFIFODIRECTACCESS; /*!< (@ 0x00020000) (unspecified)                */
  } NRF_USBHSCORE_Type;                              /*!< Size = 147460 (0x24004)                                              */

/* USBHSCORE_GOTGCTL: OTG Control and Status Register */
  #define USBHSCORE_GOTGCTL_ResetValue (0x000D0000UL) /*!< Reset value of GOTGCTL register.                                    */

