tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* SESREQSCS @Bit 0 : Mode: Device only. Session Request Success (SesReqScs) */
  #define USBHSCORE_GOTGCTL_SESREQSCS_Pos (0UL)      /*!< Position of SESREQSCS field.                                         */
  #define USBHSCORE_GOTGCTL_SESREQSCS_Msk (0x1UL << USBHSCORE_GOTGCTL_SESREQSCS_Pos) /*!< Bit mask of SESREQSCS field.         */
  #define USBHSCORE_GOTGCTL_SESREQSCS_Min (0x0UL)    /*!< Min enumerator value of SESREQSCS field.                             */
  #define USBHSCORE_GOTGCTL_SESREQSCS_Max (0x1UL)    /*!< Max enumerator value of SESREQSCS field.                             */
  #define USBHSCORE_GOTGCTL_SESREQSCS_FAIL (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GOTGCTL_SESREQSCS_SUCCESS (0x1UL) /*!< (unspecified)                                                       */

/* SESREQ @Bit 1 : Mode: Device only. Session Request (SesReq) */
  #define USBHSCORE_GOTGCTL_SESREQ_Pos (1UL)         /*!< Position of SESREQ field.                                            */
  #define USBHSCORE_GOTGCTL_SESREQ_Msk (0x1UL << USBHSCORE_GOTGCTL_SESREQ_Pos) /*!< Bit mask of SESREQ field.                  */
  #define USBHSCORE_GOTGCTL_SESREQ_Min (0x0UL)       /*!< Min enumerator value of SESREQ field.                                */
  #define USBHSCORE_GOTGCTL_SESREQ_Max (0x1UL)       /*!< Max enumerator value of SESREQ field.                                */
  #define USBHSCORE_GOTGCTL_SESREQ_NOREQUEST (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GOTGCTL_SESREQ_REQUEST (0x1UL)   /*!< (unspecified)                                                        */

/* VBVALIDOVEN @Bit 2 : Mode: Host only. VBUS Valid Override Enable (VbvalidOvEn) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos (2UL)    /*!< Position of VBVALIDOVEN field.                                       */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos) /*!< Bit mask of VBVALIDOVEN field.   */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Min (0x0UL)  /*!< Min enumerator value of VBVALIDOVEN field.                           */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Max (0x1UL)  /*!< Max enumerator value of VBVALIDOVEN field.                           */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_DISABLED (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_ENABLED (0x1UL) /*!< (unspecified)                                                     */

/* VBVALIDOVVAL @Bit 3 : Mode: Host only. VBUS Valid OverrideValue (VbvalidOvVal) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos (3UL)   /*!< Position of VBVALIDOVVAL field.                                      */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos) /*!< Bit mask of VBVALIDOVVAL field.*/
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Min (0x0UL) /*!< Min enumerator value of VBVALIDOVVAL field.                          */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Max (0x1UL) /*!< Max enumerator value of VBVALIDOVVAL field.                          */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET0 (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET1 (0x1UL) /*!< (unspecified)                                                       */

/* AVALIDOVEN @Bit 4 : Mode: Host only. A-Peripheral Session Valid Override Enable (AvalidOvEn) */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Pos (4UL)     /*!< Position of AVALIDOVEN field.                                        */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVEN_Pos) /*!< Bit mask of AVALIDOVEN field.      */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Min (0x0UL)   /*!< Min enumerator value of AVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Max (0x1UL)   /*!< Max enumerator value of AVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* AVALIDOVVAL @Bit 5 : Mode: Host only A-Peripheral Session Valid OverrideValue (AvalidOvVal) */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos (5UL)    /*!< Position of AVALIDOVVAL field.                                       */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos) /*!< Bit mask of AVALIDOVVAL field.   */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Min (0x0UL)  /*!< Min enumerator value of AVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Max (0x1UL)  /*!< Max enumerator value of AVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE0 (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE1 (0x1UL) /*!< (unspecified)                                                      */

/* BVALIDOVEN @Bit 6 : Mode: Device only. B-Peripheral Session Valid Override Value (BvalidOvEn) */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Pos (6UL)     /*!< Position of BVALIDOVEN field.                                        */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVEN_Pos) /*!< Bit mask of BVALIDOVEN field.      */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Min (0x0UL)   /*!< Min enumerator value of BVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Max (0x1UL)   /*!< Max enumerator value of BVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* BVALIDOVVAL @Bit 7 : Mode: Device only. B-Peripheral Session Valid OverrideValue (BvalidOvVal) */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos (7UL)    /*!< Position of BVALIDOVVAL field.                                       */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos) /*!< Bit mask of BVALIDOVVAL field.   */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Min (0x0UL)  /*!< Min enumerator value of BVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Max (0x1UL)  /*!< Max enumerator value of BVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE0 (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE1 (0x1UL) /*!< (unspecified)                                                      */

/* DBNCEFLTRBYPASS @Bit 15 : Mode: Host and Device */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos (15UL) /*!< Position of DBNCEFLTRBYPASS field.                                 */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Msk (0x1UL << USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos) /*!< Bit mask of
                                                                            DBNCEFLTRBYPASS field.*/
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Min (0x0UL) /*!< Min enumerator value of DBNCEFLTRBYPASS field.                    */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Max (0x1UL) /*!< Max enumerator value of DBNCEFLTRBYPASS field.                    */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_DISABLED (0x0UL) /*!< (unspecified)                                                */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_ENABLED (0x1UL) /*!< (unspecified)                                                 */

/* CONIDSTS @Bit 16 : Mode: Host and Device. Connector ID Status (ConIDSts) */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Pos (16UL)      /*!< Position of CONIDSTS field.                                          */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Msk (0x1UL << USBHSCORE_GOTGCTL_CONIDSTS_Pos) /*!< Bit mask of CONIDSTS field.            */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Min (0x0UL)     /*!< Min enumerator value of CONIDSTS field.                              */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Max (0x1UL)     /*!< Max enumerator value of CONIDSTS field.                              */
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEA (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEB (0x1UL)   /*!< (unspecified)                                                        */

