tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* FSINTF @Bit 5 : Mode: Host and Device. Full-Speed Serial Interface Select (FSIntf) */
  #define USBHSCORE_GUSBCFG_FSINTF_Pos (5UL)         /*!< Position of FSINTF field.                                            */
  #define USBHSCORE_GUSBCFG_FSINTF_Msk (0x1UL << USBHSCORE_GUSBCFG_FSINTF_Pos) /*!< Bit mask of FSINTF field.                  */
  #define USBHSCORE_GUSBCFG_FSINTF_Min (0x0UL)       /*!< Min enumerator value of FSINTF field.                                */
  #define USBHSCORE_GUSBCFG_FSINTF_Max (0x1UL)       /*!< Max enumerator value of FSINTF field.                                */
  #define USBHSCORE_GUSBCFG_FSINTF_FS6PIN (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GUSBCFG_FSINTF_FS3PIN (0x1UL)    /*!< (unspecified)                                                        */

/* PHYSEL @Bit 6 : PHYSel */
  #define USBHSCORE_GUSBCFG_PHYSEL_Pos (6UL)         /*!< Position of PHYSEL field.                                            */
  #define USBHSCORE_GUSBCFG_PHYSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYSEL_Pos) /*!< Bit mask of PHYSEL field.                  */
  #define USBHSCORE_GUSBCFG_PHYSEL_Min (0x0UL)       /*!< Min enumerator value of PHYSEL field.                                */
  #define USBHSCORE_GUSBCFG_PHYSEL_Max (0x1UL)       /*!< Max enumerator value of PHYSEL field.                                */
  #define USBHSCORE_GUSBCFG_PHYSEL_USB20 (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GUSBCFG_PHYSEL_USB11 (0x1UL)     /*!< (unspecified)                                                        */

/* USBTRDTIM @Bits 10..13 : Mode: Device only. USB Turnaround Time (USBTrdTim) */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Pos (10UL)     /*!< Position of USBTRDTIM field.                                         */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Msk (0xFUL << USBHSCORE_GUSBCFG_USBTRDTIM_Pos) /*!< Bit mask of USBTRDTIM field.         */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Min (0x5UL)    /*!< Min enumerator value of USBTRDTIM field.                             */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Max (0x9UL)    /*!< Max enumerator value of USBTRDTIM field.                             */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME16BIT (0x5UL) /*!< (unspecified)                                                 */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME8BIT (0x9UL) /*!< (unspecified)                                                  */

/* PHYLPWRCLKSEL @Bit 15 : PHY Low-Power Clock Select (PhyLPwrClkSel) */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos (15UL) /*!< Position of PHYLPWRCLKSEL field.                                     */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos) /*!< Bit mask of PHYLPWRCLKSEL
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Min (0x0UL) /*!< Min enumerator value of PHYLPWRCLKSEL field.                        */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Max (0x1UL) /*!< Max enumerator value of PHYLPWRCLKSEL field.                        */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_INTPLLCLK (0x0UL) /*!< (unspecified)                                                 */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_EXTCLK (0x1UL) /*!< (unspecified)                                                    */

/* TERMSELDLPULSE @Bit 22 : Mode: Device only. TermSel DLine Pulsing Selection (TermSelDLPulse) */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos (22UL) /*!< Position of TERMSELDLPULSE field.                                   */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Msk (0x1UL << USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos) /*!< Bit mask of TERMSELDLPULSE
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Min (0x0UL) /*!< Min enumerator value of TERMSELDLPULSE field.                      */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Max (0x1UL) /*!< Max enumerator value of TERMSELDLPULSE field.                      */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TXVALID (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TERMSEL (0x1UL) /*!< (unspecified)                                                  */

/* ICUSBCAP @Bit 26 : Mode: Host and Device. IC_USB-Capable (IC_USBCap) */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Pos (26UL)      /*!< Position of ICUSBCAP field.                                          */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Msk (0x1UL << USBHSCORE_GUSBCFG_ICUSBCAP_Pos) /*!< Bit mask of ICUSBCAP field.            */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Min (0x0UL)     /*!< Min enumerator value of ICUSBCAP field.                              */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Max (0x1UL)     /*!< Max enumerator value of ICUSBCAP field.                              */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_NOTSELECTED (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_SELECTED (0x1UL) /*!< (unspecified)                                                       */

/* TXENDDELAY @Bit 28 : Mode: Device only. Tx End Delay (TxEndDelay) */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Pos (28UL)    /*!< Position of TXENDDELAY field.                                        */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Msk (0x1UL << USBHSCORE_GUSBCFG_TXENDDELAY_Pos) /*!< Bit mask of TXENDDELAY field.      */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Min (0x0UL)   /*!< Min enumerator value of TXENDDELAY field.                            */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Max (0x1UL)   /*!< Max enumerator value of TXENDDELAY field.                            */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* FORCEHSTMODE @Bit 29 : Mode: Host and device. Force Host Mode (ForceHstMode) */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos (29UL)  /*!< Position of FORCEHSTMODE field.                                      */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos) /*!< Bit mask of FORCEHSTMODE field.*/
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Min (0x0UL) /*!< Min enumerator value of FORCEHSTMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Max (0x1UL) /*!< Max enumerator value of FORCEHSTMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_DISABLED (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_ENABLED (0x1UL) /*!< (unspecified)                                                    */

/* FORCEDEVMODE @Bit 30 : Mode:Host and device. Force Device Mode (ForceDevMode) */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos (30UL)  /*!< Position of FORCEDEVMODE field.                                      */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos) /*!< Bit mask of FORCEDEVMODE field.*/
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Min (0x0UL) /*!< Min enumerator value of FORCEDEVMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Max (0x1UL) /*!< Max enumerator value of FORCEDEVMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_DISABLED (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_ENABLED (0x1UL) /*!< (unspecified)                                                    */

/* CORRUPTTXPKT @Bit 31 : Mode: Host and device. Corrupt Tx packet (CorruptTxPkt) */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos (31UL)  /*!< Position of CORRUPTTXPKT field.                                      */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Msk (0x1UL << USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos) /*!< Bit mask of CORRUPTTXPKT field.*/
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Min (0x0UL) /*!< Min enumerator value of CORRUPTTXPKT field.                          */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Max (0x1UL) /*!< Max enumerator value of CORRUPTTXPKT field.                          */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Disabled (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Enabled (0x1UL) /*!< (unspecified)                                                    */


/* USBHSCORE_GRSTCTL: Reset Register */
  #define USBHSCORE_GRSTCTL_ResetValue (0x80000000UL) /*!< Reset value of GRSTCTL register.                                    */

