tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NPTXFEMP @Bit 5 : Mode: Host and Device. Non-periodic TxFIFO Empty (NPTxFEmp) */
  #define USBHSCORE_GINTSTS_NPTXFEMP_Pos (5UL)       /*!< Position of NPTXFEMP field.                                          */
  #define USBHSCORE_GINTSTS_NPTXFEMP_Msk (0x1UL << USBHSCORE_GINTSTS_NPTXFEMP_Pos) /*!< Bit mask of NPTXFEMP field.            */
  #define USBHSCORE_GINTSTS_NPTXFEMP_Min (0x0UL)     /*!< Min enumerator value of NPTXFEMP field.                              */
  #define USBHSCORE_GINTSTS_NPTXFEMP_Max (0x1UL)     /*!< Max enumerator value of NPTXFEMP field.                              */
  #define USBHSCORE_GINTSTS_NPTXFEMP_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GINTSTS_NPTXFEMP_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* GINNAKEFF @Bit 6 : Mode: Device only. Global IN Non-periodic NAK Effective (GINNakEff) */
  #define USBHSCORE_GINTSTS_GINNAKEFF_Pos (6UL)      /*!< Position of GINNAKEFF field.                                         */
  #define USBHSCORE_GINTSTS_GINNAKEFF_Msk (0x1UL << USBHSCORE_GINTSTS_GINNAKEFF_Pos) /*!< Bit mask of GINNAKEFF field.         */
  #define USBHSCORE_GINTSTS_GINNAKEFF_Min (0x0UL)    /*!< Min enumerator value of GINNAKEFF field.                             */
  #define USBHSCORE_GINTSTS_GINNAKEFF_Max (0x1UL)    /*!< Max enumerator value of GINNAKEFF field.                             */
  #define USBHSCORE_GINTSTS_GINNAKEFF_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_GINTSTS_GINNAKEFF_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* GOUTNAKEFF @Bit 7 : Mode: Device only. Global OUT NAK Effective (GOUTNakEff) */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Pos (7UL)     /*!< Position of GOUTNAKEFF field.                                        */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Msk (0x1UL << USBHSCORE_GINTSTS_GOUTNAKEFF_Pos) /*!< Bit mask of GOUTNAKEFF field.      */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Min (0x0UL)   /*!< Min enumerator value of GOUTNAKEFF field.                            */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Max (0x1UL)   /*!< Max enumerator value of GOUTNAKEFF field.                            */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* ERLYSUSP @Bit 10 : Mode: Device only. Early Suspend (ErlySusp) */
  #define USBHSCORE_GINTSTS_ERLYSUSP_Pos (10UL)      /*!< Position of ERLYSUSP field.                                          */
  #define USBHSCORE_GINTSTS_ERLYSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_ERLYSUSP_Pos) /*!< Bit mask of ERLYSUSP field.            */
  #define USBHSCORE_GINTSTS_ERLYSUSP_Min (0x0UL)     /*!< Min enumerator value of ERLYSUSP field.                              */
  #define USBHSCORE_GINTSTS_ERLYSUSP_Max (0x1UL)     /*!< Max enumerator value of ERLYSUSP field.                              */
  #define USBHSCORE_GINTSTS_ERLYSUSP_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GINTSTS_ERLYSUSP_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* USBSUSP @Bit 11 : Mode: Device only. USB Suspend (USBSusp) */
  #define USBHSCORE_GINTSTS_USBSUSP_Pos (11UL)       /*!< Position of USBSUSP field.                                           */
  #define USBHSCORE_GINTSTS_USBSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_USBSUSP_Pos) /*!< Bit mask of USBSUSP field.               */
  #define USBHSCORE_GINTSTS_USBSUSP_Min (0x0UL)      /*!< Min enumerator value of USBSUSP field.                               */
  #define USBHSCORE_GINTSTS_USBSUSP_Max (0x1UL)      /*!< Max enumerator value of USBSUSP field.                               */
  #define USBHSCORE_GINTSTS_USBSUSP_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_USBSUSP_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* USBRST @Bit 12 : Mode: Device only. USB Reset (USBRst) */
  #define USBHSCORE_GINTSTS_USBRST_Pos (12UL)        /*!< Position of USBRST field.                                            */
  #define USBHSCORE_GINTSTS_USBRST_Msk (0x1UL << USBHSCORE_GINTSTS_USBRST_Pos) /*!< Bit mask of USBRST field.                  */
  #define USBHSCORE_GINTSTS_USBRST_Min (0x0UL)       /*!< Min enumerator value of USBRST field.                                */
  #define USBHSCORE_GINTSTS_USBRST_Max (0x1UL)       /*!< Max enumerator value of USBRST field.                                */
  #define USBHSCORE_GINTSTS_USBRST_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_USBRST_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* ENUMDONE @Bit 13 : Mode: Device only. Enumeration Done (EnumDone) */
  #define USBHSCORE_GINTSTS_ENUMDONE_Pos (13UL)      /*!< Position of ENUMDONE field.                                          */
  #define USBHSCORE_GINTSTS_ENUMDONE_Msk (0x1UL << USBHSCORE_GINTSTS_ENUMDONE_Pos) /*!< Bit mask of ENUMDONE field.            */
  #define USBHSCORE_GINTSTS_ENUMDONE_Min (0x0UL)     /*!< Min enumerator value of ENUMDONE field.                              */
  #define USBHSCORE_GINTSTS_ENUMDONE_Max (0x1UL)     /*!< Max enumerator value of ENUMDONE field.                              */
  #define USBHSCORE_GINTSTS_ENUMDONE_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GINTSTS_ENUMDONE_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* ISOOUTDROP @Bit 14 : Mode: Device only. Isochronous OUT Packet Dropped Interrupt (ISOOutDrop) */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Pos (14UL)    /*!< Position of ISOOUTDROP field.                                        */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Msk (0x1UL << USBHSCORE_GINTSTS_ISOOUTDROP_Pos) /*!< Bit mask of ISOOUTDROP field.      */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Min (0x0UL)   /*!< Min enumerator value of ISOOUTDROP field.                            */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Max (0x1UL)   /*!< Max enumerator value of ISOOUTDROP field.                            */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* EOPF @Bit 15 : Mode: Device only. End of Periodic Frame Interrupt (EOPF) */
  #define USBHSCORE_GINTSTS_EOPF_Pos (15UL)          /*!< Position of EOPF field.                                              */
  #define USBHSCORE_GINTSTS_EOPF_Msk (0x1UL << USBHSCORE_GINTSTS_EOPF_Pos) /*!< Bit mask of EOPF field.                        */
  #define USBHSCORE_GINTSTS_EOPF_Min (0x0UL)         /*!< Min enumerator value of EOPF field.                                  */
  #define USBHSCORE_GINTSTS_EOPF_Max (0x1UL)         /*!< Max enumerator value of EOPF field.                                  */
  #define USBHSCORE_GINTSTS_EOPF_INACTIVE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_EOPF_ACTIVE (0x1UL)      /*!< (unspecified)                                                        */

