tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* RSTRDONEINT @Bit 16 : Mode: Device only. Restore Done Interrupt (RstrDoneInt) */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Pos (16UL)   /*!< Position of RSTRDONEINT field.                                       */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Msk (0x1UL << USBHSCORE_GINTSTS_RSTRDONEINT_Pos) /*!< Bit mask of RSTRDONEINT field.   */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Min (0x0UL)  /*!< Min enumerator value of RSTRDONEINT field.                           */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Max (0x1UL)  /*!< Max enumerator value of RSTRDONEINT field.                           */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* EPMIS @Bit 17 : Mode: Device only. Endpoint Mismatch Interrupt (EPMis) */
  #define USBHSCORE_GINTSTS_EPMIS_Pos (17UL)         /*!< Position of EPMIS field.                                             */
  #define USBHSCORE_GINTSTS_EPMIS_Msk (0x1UL << USBHSCORE_GINTSTS_EPMIS_Pos) /*!< Bit mask of EPMIS field.                     */
  #define USBHSCORE_GINTSTS_EPMIS_Min (0x0UL)        /*!< Min enumerator value of EPMIS field.                                 */
  #define USBHSCORE_GINTSTS_EPMIS_Max (0x1UL)        /*!< Max enumerator value of EPMIS field.                                 */
  #define USBHSCORE_GINTSTS_EPMIS_INACTIVE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_EPMIS_ACTIVE (0x1UL)     /*!< (unspecified)                                                        */

/* IEPINT @Bit 18 : Mode: Device only. IN Endpoints Interrupt (IEPInt) */
  #define USBHSCORE_GINTSTS_IEPINT_Pos (18UL)        /*!< Position of IEPINT field.                                            */
  #define USBHSCORE_GINTSTS_IEPINT_Msk (0x1UL << USBHSCORE_GINTSTS_IEPINT_Pos) /*!< Bit mask of IEPINT field.                  */
  #define USBHSCORE_GINTSTS_IEPINT_Min (0x0UL)       /*!< Min enumerator value of IEPINT field.                                */
  #define USBHSCORE_GINTSTS_IEPINT_Max (0x1UL)       /*!< Max enumerator value of IEPINT field.                                */
  #define USBHSCORE_GINTSTS_IEPINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_IEPINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* OEPINT @Bit 19 : Mode: Device only. OUT Endpoints Interrupt (OEPInt) */
  #define USBHSCORE_GINTSTS_OEPINT_Pos (19UL)        /*!< Position of OEPINT field.                                            */
  #define USBHSCORE_GINTSTS_OEPINT_Msk (0x1UL << USBHSCORE_GINTSTS_OEPINT_Pos) /*!< Bit mask of OEPINT field.                  */
  #define USBHSCORE_GINTSTS_OEPINT_Min (0x0UL)       /*!< Min enumerator value of OEPINT field.                                */
  #define USBHSCORE_GINTSTS_OEPINT_Max (0x1UL)       /*!< Max enumerator value of OEPINT field.                                */
  #define USBHSCORE_GINTSTS_OEPINT_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_OEPINT_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INCOMPISOIN @Bit 20 : Mode: Device only. Incomplete Isochronous IN Transfer (incompISOIN) */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Pos (20UL)   /*!< Position of INCOMPISOIN field.                                       */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Msk (0x1UL << USBHSCORE_GINTSTS_INCOMPISOIN_Pos) /*!< Bit mask of INCOMPISOIN field.   */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Min (0x0UL)  /*!< Min enumerator value of INCOMPISOIN field.                           */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Max (0x1UL)  /*!< Max enumerator value of INCOMPISOIN field.                           */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* INCOMPLP @Bit 21 : Incomplete Periodic Transfer (incomplP) */
  #define USBHSCORE_GINTSTS_INCOMPLP_Pos (21UL)      /*!< Position of INCOMPLP field.                                          */
  #define USBHSCORE_GINTSTS_INCOMPLP_Msk (0x1UL << USBHSCORE_GINTSTS_INCOMPLP_Pos) /*!< Bit mask of INCOMPLP field.            */
  #define USBHSCORE_GINTSTS_INCOMPLP_Min (0x0UL)     /*!< Min enumerator value of INCOMPLP field.                              */
  #define USBHSCORE_GINTSTS_INCOMPLP_Max (0x1UL)     /*!< Max enumerator value of INCOMPLP field.                              */
  #define USBHSCORE_GINTSTS_INCOMPLP_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GINTSTS_INCOMPLP_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* FETSUSP @Bit 22 : Mode: Device only. Data Fetch Suspended (FetSusp) */
  #define USBHSCORE_GINTSTS_FETSUSP_Pos (22UL)       /*!< Position of FETSUSP field.                                           */
  #define USBHSCORE_GINTSTS_FETSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_FETSUSP_Pos) /*!< Bit mask of FETSUSP field.               */
  #define USBHSCORE_GINTSTS_FETSUSP_Min (0x0UL)      /*!< Min enumerator value of FETSUSP field.                               */
  #define USBHSCORE_GINTSTS_FETSUSP_Max (0x1UL)      /*!< Max enumerator value of FETSUSP field.                               */
  #define USBHSCORE_GINTSTS_FETSUSP_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GINTSTS_FETSUSP_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* RESETDET @Bit 23 : Mode: Device only. Reset detected Interrupt (ResetDet) */
  #define USBHSCORE_GINTSTS_RESETDET_Pos (23UL)      /*!< Position of RESETDET field.                                          */
  #define USBHSCORE_GINTSTS_RESETDET_Msk (0x1UL << USBHSCORE_GINTSTS_RESETDET_Pos) /*!< Bit mask of RESETDET field.            */
  #define USBHSCORE_GINTSTS_RESETDET_Min (0x0UL)     /*!< Min enumerator value of RESETDET field.                              */
  #define USBHSCORE_GINTSTS_RESETDET_Max (0x1UL)     /*!< Max enumerator value of RESETDET field.                              */
  #define USBHSCORE_GINTSTS_RESETDET_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GINTSTS_RESETDET_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

