tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PKTSTS @Bits 17..20 : Packet Status (PktSts) indicates the status of the received packet. */
  #define USBHSCORE_GRXSTSR_PKTSTS_Pos (17UL)        /*!< Position of PKTSTS field.                                            */
  #define USBHSCORE_GRXSTSR_PKTSTS_Msk (0xFUL << USBHSCORE_GRXSTSR_PKTSTS_Pos) /*!< Bit mask of PKTSTS field.                  */
  #define USBHSCORE_GRXSTSR_PKTSTS_Min (0x1UL)       /*!< Min enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSR_PKTSTS_Max (0x7UL)       /*!< Max enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSR_PKTSTS_OUTNAK (0x1UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTDPRX (0x2UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTTRCOM (0x3UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPCOM (0x4UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_PKTSTS_DTTOG (0x5UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPRX (0x6UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSR_PKTSTS_CHHALT (0x7UL)    /*!< (unspecified)                                                        */

/* FN @Bits 21..24 : Mode: Device only. Frame Number (FN) */
  #define USBHSCORE_GRXSTSR_FN_Pos (21UL)            /*!< Position of FN field.                                                */
  #define USBHSCORE_GRXSTSR_FN_Msk (0xFUL << USBHSCORE_GRXSTSR_FN_Pos) /*!< Bit mask of FN field.                              */


/* USBHSCORE_GRXSTSP: Receive Status Read/Pop Register */
  #define USBHSCORE_GRXSTSP_ResetValue (0x00000000UL) /*!< Reset value of GRXSTSP register.                                    */

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSP_CHNUM_Pos (0UL)          /*!< Position of CHNUM field.                                             */
  #define USBHSCORE_GRXSTSP_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSP_CHNUM_Pos) /*!< Bit mask of CHNUM field.                     */
  #define USBHSCORE_GRXSTSP_CHNUM_Min (0x0UL)        /*!< Min enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSP_CHNUM_Max (0xFUL)        /*!< Max enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP0 (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP1 (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP2 (0x2UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP3 (0x3UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP4 (0x4UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP5 (0x5UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP6 (0x6UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP7 (0x7UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP8 (0x8UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP9 (0x9UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP10 (0xAUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP11 (0xBUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP12 (0xCUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP13 (0xDUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP14 (0xEUL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP15 (0xFUL)     /*!< (unspecified)                                                        */

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSP_BCNT_Pos (4UL)           /*!< Position of BCNT field.                                              */
  #define USBHSCORE_GRXSTSP_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSP_BCNT_Pos) /*!< Bit mask of BCNT field.                      */

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSP_DPID_Pos (15UL)          /*!< Position of DPID field.                                              */
  #define USBHSCORE_GRXSTSP_DPID_Msk (0x3UL << USBHSCORE_GRXSTSP_DPID_Pos) /*!< Bit mask of DPID field.                        */
  #define USBHSCORE_GRXSTSP_DPID_Min (0x0UL)         /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSP_DPID_Max (0x3UL)         /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSP_DPID_DATA0 (0x0UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_DPID_DATA2 (0x1UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_DPID_DATA1 (0x2UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_GRXSTSP_DPID_MDATA (0x3UL)       /*!< (unspecified)                                                        */

