tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF7_INEPNTXFDEP_Pos (16UL)  /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF7_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF7_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP
                                                                            field.*/


/* USBHSCORE_HCFG: Host Configuration Register */
  #define USBHSCORE_HCFG_ResetValue (0x00000200UL)   /*!< Reset value of HCFG register.                                        */

/* FSLSPCLKSEL @Bits 0..1 : FS/LS PHY Clock Select (FSLSPclkSel) */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Pos (0UL)       /*!< Position of FSLSPCLKSEL field.                                       */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Msk (0x3UL << USBHSCORE_HCFG_FSLSPCLKSEL_Pos) /*!< Bit mask of FSLSPCLKSEL field.         */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Min (0x0UL)     /*!< Min enumerator value of FSLSPCLKSEL field.                           */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Max (0x2UL)     /*!< Max enumerator value of FSLSPCLKSEL field.                           */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK3060 (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK48 (0x1UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK6 (0x2UL)    /*!< (unspecified)                                                        */

/* FSLSSUPP @Bit 2 : FS- and LS-Only Support (FSLSSupp) */
  #define USBHSCORE_HCFG_FSLSSUPP_Pos (2UL)          /*!< Position of FSLSSUPP field.                                          */
  #define USBHSCORE_HCFG_FSLSSUPP_Msk (0x1UL << USBHSCORE_HCFG_FSLSSUPP_Pos) /*!< Bit mask of FSLSSUPP field.                  */
  #define USBHSCORE_HCFG_FSLSSUPP_Min (0x0UL)        /*!< Min enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_Max (0x1UL)        /*!< Max enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_HSFSLS (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HCFG_FSLSSUPP_FSLS (0x1UL)       /*!< (unspecified)                                                        */

/* ENA32KHZS @Bit 7 : Enable 32 KHz Suspend mode (Ena32KHzS) */
  #define USBHSCORE_HCFG_ENA32KHZS_Pos (7UL)         /*!< Position of ENA32KHZS field.                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_Msk (0x1UL << USBHSCORE_HCFG_ENA32KHZS_Pos) /*!< Bit mask of ENA32KHZS field.               */
  #define USBHSCORE_HCFG_ENA32KHZS_Min (0x0UL)       /*!< Min enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_Max (0x1UL)       /*!< Max enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_DISABLED (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_HCFG_ENA32KHZS_ENABLED (0x1UL)   /*!< (unspecified)                                                        */

/* RESVALID @Bits 8..15 : Resume Validation Period (ResValid) */
  #define USBHSCORE_HCFG_RESVALID_Pos (8UL)          /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_HCFG_RESVALID_Msk (0xFFUL << USBHSCORE_HCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */

/* MODECHTIMEN @Bit 31 : Mode Change Ready Timer Enable (ModeChTimEn) */
  #define USBHSCORE_HCFG_MODECHTIMEN_Pos (31UL)      /*!< Position of MODECHTIMEN field.                                       */
  #define USBHSCORE_HCFG_MODECHTIMEN_Msk (0x1UL << USBHSCORE_HCFG_MODECHTIMEN_Pos) /*!< Bit mask of MODECHTIMEN field.         */
  #define USBHSCORE_HCFG_MODECHTIMEN_Min (0x0UL)     /*!< Min enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_Max (0x1UL)     /*!< Max enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_ENABLED (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_HCFG_MODECHTIMEN_DISABLED (0x1UL) /*!< (unspecified)                                                       */


/* USBHSCORE_HFIR: Host Frame Interval Register */
  #define USBHSCORE_HFIR_ResetValue (0x0000EA60UL)   /*!< Reset value of HFIR register.                                        */

/* FRINT @Bits 0..15 : Frame Interval (FrInt) */
  #define USBHSCORE_HFIR_FRINT_Pos (0UL)             /*!< Position of FRINT field.                                             */
  #define USBHSCORE_HFIR_FRINT_Msk (0xFFFFUL << USBHSCORE_HFIR_FRINT_Pos) /*!< Bit mask of FRINT field.                        */

/* HFIRRLDCTRL @Bit 16 : Reload Control (HFIRRldCtrl) */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Pos (16UL)      /*!< Position of HFIRRLDCTRL field.                                       */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Msk (0x1UL << USBHSCORE_HFIR_HFIRRLDCTRL_Pos) /*!< Bit mask of HFIRRLDCTRL field.         */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Min (0x0UL)     /*!< Min enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Max (0x1UL)     /*!< Max enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_DISABLED (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_ENABLED (0x1UL) /*!< (unspecified)                                                        */


/* USBHSCORE_HFNUM: Host Frame Number/Frame Time Remaining Register */
  #define USBHSCORE_HFNUM_ResetValue (0x00003FFFUL)  /*!< Reset value of HFNUM register.                                       */

/* FRNUM @Bits 0..15 : Frame Number (FrNum) */
  #define USBHSCORE_HFNUM_FRNUM_Pos (0UL)            /*!< Position of FRNUM field.                                             */
  #define USBHSCORE_HFNUM_FRNUM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRNUM_Pos) /*!< Bit mask of FRNUM field.                      */
  #define USBHSCORE_HFNUM_FRNUM_Min (0x0UL)          /*!< Min enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_Max (0x1UL)          /*!< Max enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_INACTIVE (0x0000UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_HFNUM_FRNUM_ACTIVE (0x0001UL)    /*!< (unspecified)                                                        */

/* FRREM @Bits 16..31 : Frame Time Remaining (FrRem) */
  #define USBHSCORE_HFNUM_FRREM_Pos (16UL)           /*!< Position of FRREM field.                                             */
  #define USBHSCORE_HFNUM_FRREM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRREM_Pos) /*!< Bit mask of FRREM field.                      */


/* USBHSCORE_HAINT: Host All Channels Interrupt Register */
  #define USBHSCORE_HAINT_ResetValue (0x00000000UL)  /*!< Reset value of HAINT register.                                       */

/* HAINT @Bits 0..15 : Channel Interrupt for channel no. */
  #define USBHSCORE_HAINT_HAINT_Pos (0UL)            /*!< Position of HAINT field.                                             */
  #define USBHSCORE_HAINT_HAINT_Msk (0xFFFFUL << USBHSCORE_HAINT_HAINT_Pos) /*!< Bit mask of HAINT field.                      */
  #define USBHSCORE_HAINT_HAINT_Min (0x0UL)          /*!< Min enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_Max (0x1UL)          /*!< Max enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_INACTIVE (0x0000UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_HAINT_HAINT_ACTIVE (0x0001UL)    /*!< (unspecified)                                                        */


/* USBHSCORE_HAINTMSK: Host All Channels Interrupt Mask Register */
  #define USBHSCORE_HAINTMSK_ResetValue (0x00000000UL) /*!< Reset value of HAINTMSK register.                                  */

/* HAINTMSK @Bits 0..15 : Channel Interrupt Mask (HAINTMsk) */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Pos (0UL)      /*!< Position of HAINTMSK field.                                          */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Msk (0xFFFFUL << USBHSCORE_HAINTMSK_HAINTMSK_Pos) /*!< Bit mask of HAINTMSK field.       */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Min (0x0UL)    /*!< Min enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Max (0x1UL)    /*!< Max enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_UNMASK (0x0000UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_HAINTMSK_HAINTMSK_MASK (0x0001UL) /*!< (unspecified)                                                       */


