tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* USBHSCORE_HPRT: Host Port Control and Status Register */
  #define USBHSCORE_HPRT_ResetValue (0x00000000UL)   /*!< Reset value of HPRT register.                                        */

/* PRTCONNSTS @Bit 0 : Port Connect Status (PrtConnSts) */
  #define USBHSCORE_HPRT_PRTCONNSTS_Pos (0UL)        /*!< Position of PRTCONNSTS field.                                        */
  #define USBHSCORE_HPRT_PRTCONNSTS_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNSTS_Pos) /*!< Bit mask of PRTCONNSTS field.            */
  #define USBHSCORE_HPRT_PRTCONNSTS_Min (0x0UL)      /*!< Min enumerator value of PRTCONNSTS field.                            */
  #define USBHSCORE_HPRT_PRTCONNSTS_Max (0x1UL)      /*!< Max enumerator value of PRTCONNSTS field.                            */
  #define USBHSCORE_HPRT_PRTCONNSTS_NOTATTACHED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_HPRT_PRTCONNSTS_ATTACHED (0x1UL) /*!< (unspecified)                                                        */

/* PRTCONNDET @Bit 1 : Port Connect Detected (PrtConnDet) */
  #define USBHSCORE_HPRT_PRTCONNDET_Pos (1UL)        /*!< Position of PRTCONNDET field.                                        */
  #define USBHSCORE_HPRT_PRTCONNDET_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNDET_Pos) /*!< Bit mask of PRTCONNDET field.            */
  #define USBHSCORE_HPRT_PRTCONNDET_Min (0x0UL)      /*!< Min enumerator value of PRTCONNDET field.                            */
  #define USBHSCORE_HPRT_PRTCONNDET_Max (0x1UL)      /*!< Max enumerator value of PRTCONNDET field.                            */
  #define USBHSCORE_HPRT_PRTCONNDET_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTCONNDET_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* PRTENA @Bit 2 : Port Enable (PrtEna) */
  #define USBHSCORE_HPRT_PRTENA_Pos (2UL)            /*!< Position of PRTENA field.                                            */
  #define USBHSCORE_HPRT_PRTENA_Msk (0x1UL << USBHSCORE_HPRT_PRTENA_Pos) /*!< Bit mask of PRTENA field.                        */
  #define USBHSCORE_HPRT_PRTENA_Min (0x0UL)          /*!< Min enumerator value of PRTENA field.                                */
  #define USBHSCORE_HPRT_PRTENA_Max (0x1UL)          /*!< Max enumerator value of PRTENA field.                                */
  #define USBHSCORE_HPRT_PRTENA_DISABLED (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTENA_ENABLED (0x1UL)      /*!< (unspecified)                                                        */

/* PRTENCHNG @Bit 3 : Port Enable/Disable Change (PrtEnChng) */
  #define USBHSCORE_HPRT_PRTENCHNG_Pos (3UL)         /*!< Position of PRTENCHNG field.                                         */
  #define USBHSCORE_HPRT_PRTENCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTENCHNG_Pos) /*!< Bit mask of PRTENCHNG field.               */
  #define USBHSCORE_HPRT_PRTENCHNG_Min (0x0UL)       /*!< Min enumerator value of PRTENCHNG field.                             */
  #define USBHSCORE_HPRT_PRTENCHNG_Max (0x1UL)       /*!< Max enumerator value of PRTENCHNG field.                             */
  #define USBHSCORE_HPRT_PRTENCHNG_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTENCHNG_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* PRTOVRCURRACT @Bit 4 : Port Overcurrent Active (PrtOvrCurrAct) */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Pos (4UL)     /*!< Position of PRTOVRCURRACT field.                                     */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRACT_Pos) /*!< Bit mask of PRTOVRCURRACT field.   */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Min (0x0UL)   /*!< Min enumerator value of PRTOVRCURRACT field.                         */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Max (0x1UL)   /*!< Max enumerator value of PRTOVRCURRACT field.                         */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* PRTOVRCURRCHNG @Bit 5 : Port Overcurrent Change (PrtOvrCurrChng) */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos (5UL)    /*!< Position of PRTOVRCURRCHNG field.                                    */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos) /*!< Bit mask of PRTOVRCURRCHNG field.*/
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Min (0x0UL)  /*!< Min enumerator value of PRTOVRCURRCHNG field.                        */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Max (0x1UL)  /*!< Max enumerator value of PRTOVRCURRCHNG field.                        */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* PRTRES @Bit 6 : Port Resume (PrtRes) */
  #define USBHSCORE_HPRT_PRTRES_Pos (6UL)            /*!< Position of PRTRES field.                                            */
  #define USBHSCORE_HPRT_PRTRES_Msk (0x1UL << USBHSCORE_HPRT_PRTRES_Pos) /*!< Bit mask of PRTRES field.                        */
  #define USBHSCORE_HPRT_PRTRES_Min (0x0UL)          /*!< Min enumerator value of PRTRES field.                                */
  #define USBHSCORE_HPRT_PRTRES_Max (0x1UL)          /*!< Max enumerator value of PRTRES field.                                */
  #define USBHSCORE_HPRT_PRTRES_NORESUME (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTRES_RESUME (0x1UL)       /*!< (unspecified)                                                        */

/* PRTSUSP @Bit 7 : Port Suspend (PrtSusp) */
  #define USBHSCORE_HPRT_PRTSUSP_Pos (7UL)           /*!< Position of PRTSUSP field.                                           */
  #define USBHSCORE_HPRT_PRTSUSP_Msk (0x1UL << USBHSCORE_HPRT_PRTSUSP_Pos) /*!< Bit mask of PRTSUSP field.                     */
  #define USBHSCORE_HPRT_PRTSUSP_Min (0x0UL)         /*!< Min enumerator value of PRTSUSP field.                               */
  #define USBHSCORE_HPRT_PRTSUSP_Max (0x1UL)         /*!< Max enumerator value of PRTSUSP field.                               */
  #define USBHSCORE_HPRT_PRTSUSP_INACTIVE (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTSUSP_ACTIVE (0x1UL)      /*!< (unspecified)                                                        */

/* PRTRST @Bit 8 : Port Reset (PrtRst) */
  #define USBHSCORE_HPRT_PRTRST_Pos (8UL)            /*!< Position of PRTRST field.                                            */
  #define USBHSCORE_HPRT_PRTRST_Msk (0x1UL << USBHSCORE_HPRT_PRTRST_Pos) /*!< Bit mask of PRTRST field.                        */
  #define USBHSCORE_HPRT_PRTRST_Min (0x0UL)          /*!< Min enumerator value of PRTRST field.                                */
  #define USBHSCORE_HPRT_PRTRST_Max (0x1UL)          /*!< Max enumerator value of PRTRST field.                                */
  #define USBHSCORE_HPRT_PRTRST_DISABLED (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTRST_ENABLED (0x1UL)      /*!< (unspecified)                                                        */

/* PRTLNSTS @Bits 10..11 : Port Line Status (PrtLnSts) */
  #define USBHSCORE_HPRT_PRTLNSTS_Pos (10UL)         /*!< Position of PRTLNSTS field.                                          */
  #define USBHSCORE_HPRT_PRTLNSTS_Msk (0x3UL << USBHSCORE_HPRT_PRTLNSTS_Pos) /*!< Bit mask of PRTLNSTS field.                  */
  #define USBHSCORE_HPRT_PRTLNSTS_Min (0x1UL)        /*!< Min enumerator value of PRTLNSTS field.                              */
  #define USBHSCORE_HPRT_PRTLNSTS_Max (0x2UL)        /*!< Max enumerator value of PRTLNSTS field.                              */
  #define USBHSCORE_HPRT_PRTLNSTS_PLUSD (0x1UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_HPRT_PRTLNSTS_MINUSD (0x2UL)     /*!< (unspecified)                                                        */

