tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PERSCHINTVL @Bits 24..25 : Periodic Scheduling Interval (PerSchIntvl) */
  #define USBHSCORE_DCFG_PERSCHINTVL_Pos (24UL)      /*!< Position of PERSCHINTVL field.                                       */
  #define USBHSCORE_DCFG_PERSCHINTVL_Msk (0x3UL << USBHSCORE_DCFG_PERSCHINTVL_Pos) /*!< Bit mask of PERSCHINTVL field.         */
  #define USBHSCORE_DCFG_PERSCHINTVL_Min (0x0UL)     /*!< Min enumerator value of PERSCHINTVL field.                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_Max (0x2UL)     /*!< Max enumerator value of PERSCHINTVL field.                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF25 (0x0UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF50 (0x1UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF75 (0x2UL)    /*!< (unspecified)                                                        */

/* RESVALID @Bits 26..31 : Resume Validation Period (ResValid) */
  #define USBHSCORE_DCFG_RESVALID_Pos (26UL)         /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_DCFG_RESVALID_Msk (0x3FUL << USBHSCORE_DCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */


/* USBHSCORE_DCTL: Device Control Register */
  #define USBHSCORE_DCTL_ResetValue (0x00000002UL)   /*!< Reset value of DCTL register.                                        */

/* RMTWKUPSIG @Bit 0 : Remote Wakeup Signaling (RmtWkUpSig) */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Pos (0UL)        /*!< Position of RMTWKUPSIG field.                                        */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Msk (0x1UL << USBHSCORE_DCTL_RMTWKUPSIG_Pos) /*!< Bit mask of RMTWKUPSIG field.            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Min (0x0UL)      /*!< Min enumerator value of RMTWKUPSIG field.                            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Max (0x1UL)      /*!< Max enumerator value of RMTWKUPSIG field.                            */
  #define USBHSCORE_DCTL_RMTWKUPSIG_DISABLEDRMWKUP (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DCTL_RMTWKUPSIG_ENABLERMWKUP (0x1UL) /*!< (unspecified)                                                    */

/* SFTDISCON @Bit 1 : Soft Disconnect (SftDiscon) */
  #define USBHSCORE_DCTL_SFTDISCON_Pos (1UL)         /*!< Position of SFTDISCON field.                                         */
  #define USBHSCORE_DCTL_SFTDISCON_Msk (0x1UL << USBHSCORE_DCTL_SFTDISCON_Pos) /*!< Bit mask of SFTDISCON field.               */
  #define USBHSCORE_DCTL_SFTDISCON_Min (0x0UL)       /*!< Min enumerator value of SFTDISCON field.                             */
  #define USBHSCORE_DCTL_SFTDISCON_Max (0x1UL)       /*!< Max enumerator value of SFTDISCON field.                             */
  #define USBHSCORE_DCTL_SFTDISCON_NODISCONNECT (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DCTL_SFTDISCON_DISCONNECT (0x1UL) /*!< (unspecified)                                                       */

/* GNPINNAKSTS @Bit 2 : Global Non-periodic IN NAK Status (GNPINNakSts) */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Pos (2UL)       /*!< Position of GNPINNAKSTS field.                                       */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GNPINNAKSTS_Pos) /*!< Bit mask of GNPINNAKSTS field.         */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Min (0x0UL)     /*!< Min enumerator value of GNPINNAKSTS field.                           */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Max (0x1UL)     /*!< Max enumerator value of GNPINNAKSTS field.                           */
  #define USBHSCORE_DCTL_GNPINNAKSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DCTL_GNPINNAKSTS_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* GOUTNAKSTS @Bit 3 : Global OUT NAK Status (GOUTNakSts) */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Pos (3UL)        /*!< Position of GOUTNAKSTS field.                                        */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GOUTNAKSTS_Pos) /*!< Bit mask of GOUTNAKSTS field.            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Min (0x0UL)      /*!< Min enumerator value of GOUTNAKSTS field.                            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Max (0x1UL)      /*!< Max enumerator value of GOUTNAKSTS field.                            */
  #define USBHSCORE_DCTL_GOUTNAKSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_GOUTNAKSTS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TSTCTL @Bits 4..6 : Test Control (TstCtl) */
  #define USBHSCORE_DCTL_TSTCTL_Pos (4UL)            /*!< Position of TSTCTL field.                                            */
  #define USBHSCORE_DCTL_TSTCTL_Msk (0x7UL << USBHSCORE_DCTL_TSTCTL_Pos) /*!< Bit mask of TSTCTL field.                        */
  #define USBHSCORE_DCTL_TSTCTL_Min (0x0UL)          /*!< Min enumerator value of TSTCTL field.                                */
  #define USBHSCORE_DCTL_TSTCTL_Max (0x5UL)          /*!< Max enumerator value of TSTCTL field.                                */
  #define USBHSCORE_DCTL_TSTCTL_DISABLED (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_TSTCTL_TESTJ (0x1UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_TSTCTL_TESTK (0x2UL)        /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_TSTCTL_TESTSN (0x3UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_TSTCTL_TESTPM (0x4UL)       /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_TSTCTL_TESTFE (0x5UL)       /*!< (unspecified)                                                        */

/* SGNPINNAK @Bit 7 : Set Global Non-periodic IN NAK (SGNPInNak) */
  #define USBHSCORE_DCTL_SGNPINNAK_Pos (7UL)         /*!< Position of SGNPINNAK field.                                         */
  #define USBHSCORE_DCTL_SGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_SGNPINNAK_Pos) /*!< Bit mask of SGNPINNAK field.               */
  #define USBHSCORE_DCTL_SGNPINNAK_Min (0x0UL)       /*!< Min enumerator value of SGNPINNAK field.                             */
  #define USBHSCORE_DCTL_SGNPINNAK_Max (0x1UL)       /*!< Max enumerator value of SGNPINNAK field.                             */
  #define USBHSCORE_DCTL_SGNPINNAK_DISABLE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_SGNPINNAK_ENABLE (0x1UL)    /*!< (unspecified)                                                        */

/* CGNPINNAK @Bit 8 : Clear Global Non-periodic IN NAK (CGNPInNak) */
  #define USBHSCORE_DCTL_CGNPINNAK_Pos (8UL)         /*!< Position of CGNPINNAK field.                                         */
  #define USBHSCORE_DCTL_CGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_CGNPINNAK_Pos) /*!< Bit mask of CGNPINNAK field.               */
  #define USBHSCORE_DCTL_CGNPINNAK_Min (0x0UL)       /*!< Min enumerator value of CGNPINNAK field.                             */
  #define USBHSCORE_DCTL_CGNPINNAK_Max (0x1UL)       /*!< Max enumerator value of CGNPINNAK field.                             */
  #define USBHSCORE_DCTL_CGNPINNAK_DISABLE (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_CGNPINNAK_ENABLE (0x1UL)    /*!< (unspecified)                                                        */

/* SGOUTNAK @Bit 9 : Set Global OUT NAK (SGOUTNak) */
  #define USBHSCORE_DCTL_SGOUTNAK_Pos (9UL)          /*!< Position of SGOUTNAK field.                                          */
  #define USBHSCORE_DCTL_SGOUTNAK_Msk (0x1UL << USBHSCORE_DCTL_SGOUTNAK_Pos) /*!< Bit mask of SGOUTNAK field.                  */
  #define USBHSCORE_DCTL_SGOUTNAK_Min (0x0UL)        /*!< Min enumerator value of SGOUTNAK field.                              */
  #define USBHSCORE_DCTL_SGOUTNAK_Max (0x1UL)        /*!< Max enumerator value of SGOUTNAK field.                              */
  #define USBHSCORE_DCTL_SGOUTNAK_DISABLED (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DCTL_SGOUTNAK_ENABLED (0x1UL)    /*!< (unspecified)                                                        */

