tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* NAKMSK @Bit 13 : NAK interrupt Mask (NAKMsk) */
  #define USBHSCORE_DOEPMSK_NAKMSK_Pos (13UL)        /*!< Position of NAKMSK field.                                            */
  #define USBHSCORE_DOEPMSK_NAKMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_NAKMSK_Pos) /*!< Bit mask of NAKMSK field.                  */
  #define USBHSCORE_DOEPMSK_NAKMSK_Min (0x0UL)       /*!< Min enumerator value of NAKMSK field.                                */
  #define USBHSCORE_DOEPMSK_NAKMSK_Max (0x1UL)       /*!< Max enumerator value of NAKMSK field.                                */
  #define USBHSCORE_DOEPMSK_NAKMSK_MASK (0x0UL)      /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPMSK_NAKMSK_NOMASK (0x1UL)    /*!< (unspecified)                                                        */

/* NYETMSK @Bit 14 : NYET interrupt Mask (NYETMsk) */
  #define USBHSCORE_DOEPMSK_NYETMSK_Pos (14UL)       /*!< Position of NYETMSK field.                                           */
  #define USBHSCORE_DOEPMSK_NYETMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_NYETMSK_Pos) /*!< Bit mask of NYETMSK field.               */
  #define USBHSCORE_DOEPMSK_NYETMSK_Min (0x0UL)      /*!< Min enumerator value of NYETMSK field.                               */
  #define USBHSCORE_DOEPMSK_NYETMSK_Max (0x1UL)      /*!< Max enumerator value of NYETMSK field.                               */
  #define USBHSCORE_DOEPMSK_NYETMSK_MASK (0x0UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPMSK_NYETMSK_NOMASK (0x1UL)   /*!< (unspecified)                                                        */


/* USBHSCORE_DAINT: Device All Endpoints Interrupt Register */
  #define USBHSCORE_DAINT_ResetValue (0x00000000UL)  /*!< Reset value of DAINT register.                                       */

/* INEPINT0 @Bit 0 : IN Endpoint 0 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT0_Pos (0UL)         /*!< Position of INEPINT0 field.                                          */
  #define USBHSCORE_DAINT_INEPINT0_Msk (0x1UL << USBHSCORE_DAINT_INEPINT0_Pos) /*!< Bit mask of INEPINT0 field.                */
  #define USBHSCORE_DAINT_INEPINT0_Min (0x0UL)       /*!< Min enumerator value of INEPINT0 field.                              */
  #define USBHSCORE_DAINT_INEPINT0_Max (0x1UL)       /*!< Max enumerator value of INEPINT0 field.                              */
  #define USBHSCORE_DAINT_INEPINT0_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT0_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INEPINT1 @Bit 1 : IN Endpoint 1 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT1_Pos (1UL)         /*!< Position of INEPINT1 field.                                          */
  #define USBHSCORE_DAINT_INEPINT1_Msk (0x1UL << USBHSCORE_DAINT_INEPINT1_Pos) /*!< Bit mask of INEPINT1 field.                */
  #define USBHSCORE_DAINT_INEPINT1_Min (0x0UL)       /*!< Min enumerator value of INEPINT1 field.                              */
  #define USBHSCORE_DAINT_INEPINT1_Max (0x1UL)       /*!< Max enumerator value of INEPINT1 field.                              */
  #define USBHSCORE_DAINT_INEPINT1_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT1_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INEPINT2 @Bit 2 : IN Endpoint 2 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT2_Pos (2UL)         /*!< Position of INEPINT2 field.                                          */
  #define USBHSCORE_DAINT_INEPINT2_Msk (0x1UL << USBHSCORE_DAINT_INEPINT2_Pos) /*!< Bit mask of INEPINT2 field.                */
  #define USBHSCORE_DAINT_INEPINT2_Min (0x0UL)       /*!< Min enumerator value of INEPINT2 field.                              */
  #define USBHSCORE_DAINT_INEPINT2_Max (0x1UL)       /*!< Max enumerator value of INEPINT2 field.                              */
  #define USBHSCORE_DAINT_INEPINT2_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT2_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INEPINT3 @Bit 3 : IN Endpoint 3 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT3_Pos (3UL)         /*!< Position of INEPINT3 field.                                          */
  #define USBHSCORE_DAINT_INEPINT3_Msk (0x1UL << USBHSCORE_DAINT_INEPINT3_Pos) /*!< Bit mask of INEPINT3 field.                */
  #define USBHSCORE_DAINT_INEPINT3_Min (0x0UL)       /*!< Min enumerator value of INEPINT3 field.                              */
  #define USBHSCORE_DAINT_INEPINT3_Max (0x1UL)       /*!< Max enumerator value of INEPINT3 field.                              */
  #define USBHSCORE_DAINT_INEPINT3_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT3_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INEPINT4 @Bit 4 : IN Endpoint 4 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT4_Pos (4UL)         /*!< Position of INEPINT4 field.                                          */
  #define USBHSCORE_DAINT_INEPINT4_Msk (0x1UL << USBHSCORE_DAINT_INEPINT4_Pos) /*!< Bit mask of INEPINT4 field.                */
  #define USBHSCORE_DAINT_INEPINT4_Min (0x0UL)       /*!< Min enumerator value of INEPINT4 field.                              */
  #define USBHSCORE_DAINT_INEPINT4_Max (0x1UL)       /*!< Max enumerator value of INEPINT4 field.                              */
  #define USBHSCORE_DAINT_INEPINT4_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT4_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* INEPINT5 @Bit 5 : IN Endpoint 5 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT5_Pos (5UL)         /*!< Position of INEPINT5 field.                                          */
  #define USBHSCORE_DAINT_INEPINT5_Msk (0x1UL << USBHSCORE_DAINT_INEPINT5_Pos) /*!< Bit mask of INEPINT5 field.                */
  #define USBHSCORE_DAINT_INEPINT5_Min (0x0UL)       /*!< Min enumerator value of INEPINT5 field.                              */
  #define USBHSCORE_DAINT_INEPINT5_Max (0x1UL)       /*!< Max enumerator value of INEPINT5 field.                              */
  #define USBHSCORE_DAINT_INEPINT5_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINT_INEPINT5_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

