tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INEPMSK8 @Bit 8 : IN Endpoint 8 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Pos (8UL)      /*!< Position of INEPMSK8 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK8_Pos) /*!< Bit mask of INEPMSK8 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Min (0x0UL)    /*!< Min enumerator value of INEPMSK8 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Max (0x1UL)    /*!< Max enumerator value of INEPMSK8 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK8_MASK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_INEPMSK8_NOMASK (0x1UL) /*!< (unspecified)                                                        */

/* INEPMSK9 @Bit 9 : IN Endpoint 9 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Pos (9UL)      /*!< Position of INEPMSK9 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK9_Pos) /*!< Bit mask of INEPMSK9 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Min (0x0UL)    /*!< Min enumerator value of INEPMSK9 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Max (0x1UL)    /*!< Max enumerator value of INEPMSK9 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK9_MASK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_INEPMSK9_NOMASK (0x1UL) /*!< (unspecified)                                                        */

/* INEPMSK10 @Bit 10 : IN Endpoint 10 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Pos (10UL)    /*!< Position of INEPMSK10 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK10_Pos) /*!< Bit mask of INEPMSK10 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Min (0x0UL)   /*!< Min enumerator value of INEPMSK10 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Max (0x1UL)   /*!< Max enumerator value of INEPMSK10 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK10_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_INEPMSK10_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* INEPMSK11 @Bit 11 : IN Endpoint 11 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Pos (11UL)    /*!< Position of INEPMSK11 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK11_Pos) /*!< Bit mask of INEPMSK11 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Min (0x0UL)   /*!< Min enumerator value of INEPMSK11 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Max (0x1UL)   /*!< Max enumerator value of INEPMSK11 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK11_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_INEPMSK11_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* OUTEPMSK0 @Bit 16 : OUT Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Pos (16UL)    /*!< Position of OUTEPMSK0 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK0_Pos) /*!< Bit mask of OUTEPMSK0 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK0 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK0 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* OUTEPMSK1 @Bit 17 : OUT Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Pos (17UL)    /*!< Position of OUTEPMSK1 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK1_Pos) /*!< Bit mask of OUTEPMSK1 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK1 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK1 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* OUTEPMSK2 @Bit 18 : OUT Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Pos (18UL)    /*!< Position of OUTEPMSK2 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK2_Pos) /*!< Bit mask of OUTEPMSK2 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK2 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK2 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* OUTEPMSK3 @Bit 19 : OUT Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Pos (19UL)    /*!< Position of OUTEPMSK3 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK3_Pos) /*!< Bit mask of OUTEPMSK3 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK3 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK3 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_NOMASK (0x1UL) /*!< (unspecified)                                                       */

/* OUTEPMSK4 @Bit 20 : OUT Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Pos (20UL)    /*!< Position of OUTEPMSK4 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK4_Pos) /*!< Bit mask of OUTEPMSK4 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK4 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK4 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_MASK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_NOMASK (0x1UL) /*!< (unspecified)                                                       */

