tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TXTHRLEN @Bits 2..10 : Transmit Threshold Length (TxThrLen) */
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Pos (2UL)       /*!< Position of TXTHRLEN field.                                          */
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_TXTHRLEN_Pos) /*!< Bit mask of TXTHRLEN field.          */

/* AHBTHRRATIO @Bits 11..12 : AHB Threshold Ratio (AHBThrRatio) */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos (11UL)   /*!< Position of AHBTHRRATIO field.                                       */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Msk (0x3UL << USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos) /*!< Bit mask of AHBTHRRATIO field.   */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Min (0x0UL)  /*!< Min enumerator value of AHBTHRRATIO field.                           */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Max (0x3UL)  /*!< Max enumerator value of AHBTHRRATIO field.                           */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESZERO (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESONE (0x1UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTWO (0x2UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTHREE (0x3UL) /*!< (unspecified)                                                  */

/* RXTHREN @Bit 16 : Receive Threshold Enable (RxThrEn) */
  #define USBHSCORE_DTHRCTL_RXTHREN_Pos (16UL)       /*!< Position of RXTHREN field.                                           */
  #define USBHSCORE_DTHRCTL_RXTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_RXTHREN_Pos) /*!< Bit mask of RXTHREN field.               */
  #define USBHSCORE_DTHRCTL_RXTHREN_Min (0x0UL)      /*!< Min enumerator value of RXTHREN field.                               */
  #define USBHSCORE_DTHRCTL_RXTHREN_Max (0x1UL)      /*!< Max enumerator value of RXTHREN field.                               */
  #define USBHSCORE_DTHRCTL_RXTHREN_DISABLED (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DTHRCTL_RXTHREN_ENABLED (0x1UL)  /*!< (unspecified)                                                        */

/* RXTHRLEN @Bits 17..25 : Receive Threshold Length (RxThrLen) */
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Pos (17UL)      /*!< Position of RXTHRLEN field.                                          */
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_RXTHRLEN_Pos) /*!< Bit mask of RXTHRLEN field.          */

/* ARBPRKEN @Bit 27 : Arbiter Parking Enable (ArbPrkEn) */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Pos (27UL)      /*!< Position of ARBPRKEN field.                                          */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Msk (0x1UL << USBHSCORE_DTHRCTL_ARBPRKEN_Pos) /*!< Bit mask of ARBPRKEN field.            */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Min (0x0UL)     /*!< Min enumerator value of ARBPRKEN field.                              */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Max (0x1UL)     /*!< Max enumerator value of ARBPRKEN field.                              */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_DISABLED (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_ENABLED (0x1UL) /*!< (unspecified)                                                        */


/* USBHSCORE_DIEPEMPMSK: Device IN Endpoint FIFO Empty Interrupt Mask Register */
  #define USBHSCORE_DIEPEMPMSK_ResetValue (0x00000000UL) /*!< Reset value of DIEPEMPMSK register.                              */

/* INEPTXFEMPMSK @Bits 0..15 : IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk) */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos (0UL) /*!< Position of INEPTXFEMPMSK field.                                   */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Msk (0xFFFFUL << USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos) /*!< Bit mask of
                                                                            INEPTXFEMPMSK field.*/
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Min (0x1UL) /*!< Min enumerator value of INEPTXFEMPMSK field.                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Max (0x8000UL) /*!< Max enumerator value of INEPTXFEMPMSK field.                  */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP0_MASK (0x0001UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP1_MASK (0x0002UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP2_MASK (0x0004UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP3_MASK (0x0008UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP4_MASK (0x0010UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP5_MASK (0x0020UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP6_MASK (0x0040UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP7_MASK (0x0080UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP8_MASK (0x0100UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP9_MASK (0x0200UL) /*!< (unspecified)                                            */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP10_MASK (0x0400UL) /*!< (unspecified)                                           */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP11_MASK (0x0800UL) /*!< (unspecified)                                           */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP12_MASK (0x1000UL) /*!< (unspecified)                                           */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP13_MASK (0x2000UL) /*!< (unspecified)                                           */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP14_MASK (0x4000UL) /*!< (unspecified)                                           */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP15_MASK (0x8000UL) /*!< (unspecified)                                           */


