tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Pos (6UL)    /*!< Position of INEPNAKEFF field.                                        */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT0_INEPNAKEFF_Pos) /*!< Bit mask of INEPNAKEFF field.    */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Min (0x0UL)  /*!< Min enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Max (0x1UL)  /*!< Max enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT0_TXFEMP_Pos (7UL)        /*!< Position of TXFEMP field.                                            */
  #define USBHSCORE_DIEPINT0_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT0_TXFEMP_Pos) /*!< Bit mask of TXFEMP field.                */
  #define USBHSCORE_DIEPINT0_TXFEMP_Min (0x0UL)      /*!< Min enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT0_TXFEMP_Max (0x1UL)      /*!< Max enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT0_TXFEMP_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPINT0_TXFEMP_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Pos (8UL)   /*!< Position of TXFIFOUNDRN field.                                       */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT0_TXFIFOUNDRN_Pos) /*!< Bit mask of TXFIFOUNDRN field. */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Min (0x0UL) /*!< Min enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Max (0x1UL) /*!< Max enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT0_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DIEPINT0_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT0_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DIEPINT0_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT0_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT0_BNAINTR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT0_BNAINTR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT0_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT0_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DIEPINT0_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT0_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DIEPINT0_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT0_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT0_BBLEERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT0_BBLEERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT0_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT0_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_ACTIVE (0x1UL) /*!< (unspecified)                                                      */


