tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* USBHSCORE_DIEPTSIZ8: Device IN Endpoint 8 Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ8_ResetValue (0x00000000UL) /*!< Reset value of DIEPTSIZ8 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ8_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DIEPTSIZ8_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ8_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ8_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DIEPTSIZ8_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ8_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ8_MC_Pos (29UL)          /*!< Position of MC field.                                                */
  #define USBHSCORE_DIEPTSIZ8_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ8_MC_Pos) /*!< Bit mask of MC field.                          */
  #define USBHSCORE_DIEPTSIZ8_MC_Min (0x1UL)         /*!< Min enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ8_MC_Max (0x3UL)         /*!< Max enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETONE (0x1UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETTWO (0x2UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETTHREE (0x3UL) /*!< (unspecified)                                                        */


/* USBHSCORE_DIEPDMA8: Device IN Endpoint 8 DMA Address Register */
  #define USBHSCORE_DIEPDMA8_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA8 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA8_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA8_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA8_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


/* USBHSCORE_DTXFSTS8: Device IN Endpoint Transmit FIFO Status Register 8 */
  #define USBHSCORE_DTXFSTS8_ResetValue (0x00000200UL) /*!< Reset value of DTXFSTS8 register.                                  */

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Pos (0UL) /*!< Position of INEPTXFSPCAVAIL field.                                 */
  #define USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DIEPCTL9: Device Control IN Endpoint 9 Control Register */
  #define USBHSCORE_DIEPCTL9_ResetValue (0x00000000UL) /*!< Reset value of DIEPCTL9 register.                                  */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL9_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DIEPCTL9_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL9_MPS_Pos) /*!< Bit mask of MPS field.                       */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL9_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Min (0x0UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL9_USBACTEP_DISABLED (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DIEPCTL9_USBACTEP_ENABLED (0x1UL) /*!< (unspecified)                                                       */

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DIEPCTL9_DPID_Pos (16UL)         /*!< Position of DPID field.                                              */
  #define USBHSCORE_DIEPCTL9_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL9_DPID_Pos) /*!< Bit mask of DPID field.                      */
  #define USBHSCORE_DIEPCTL9_DPID_Min (0x0UL)        /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL9_DPID_Max (0x1UL)        /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL9_DPID_DATA0EVENFRM (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DIEPCTL9_DPID_DATA1ODDFRM (0x1UL) /*!< (unspecified)                                                       */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL9_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_NONNAK (0x0UL)   /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL9_NAKSTS_NAK (0x1UL)      /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL9_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Max (0x3UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_CONTROL (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL9_EPTYPE_ISOCHRONOUS (0x1UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL9_EPTYPE_BULK (0x2UL)     /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL9_EPTYPE_INTERRUP (0x3UL) /*!< (unspecified)                                                        */

