tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* USBHSCORE_DIEPCTL10: Device Control IN Endpoint 10 Control Register */
  #define USBHSCORE_DIEPCTL10_ResetValue (0x00000000UL) /*!< Reset value of DIEPCTL10 register.                                */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL10_MPS_Pos (0UL)          /*!< Position of MPS field.                                               */
  #define USBHSCORE_DIEPCTL10_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL10_MPS_Pos) /*!< Bit mask of MPS field.                     */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL10_USBACTEP_Pos (15UL)    /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DIEPCTL10_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL10_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.        */
  #define USBHSCORE_DIEPCTL10_USBACTEP_Min (0x0UL)   /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL10_USBACTEP_Max (0x1UL)   /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL10_USBACTEP_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL10_USBACTEP_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DIEPCTL10_DPID_Pos (16UL)        /*!< Position of DPID field.                                              */
  #define USBHSCORE_DIEPCTL10_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL10_DPID_Pos) /*!< Bit mask of DPID field.                    */
  #define USBHSCORE_DIEPCTL10_DPID_Min (0x0UL)       /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL10_DPID_Max (0x1UL)       /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL10_DPID_DATA0EVENFRM (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL10_DPID_DATA1ODDFRM (0x1UL) /*!< (unspecified)                                                      */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL10_NAKSTS_Pos (17UL)      /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DIEPCTL10_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL10_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.              */
  #define USBHSCORE_DIEPCTL10_NAKSTS_Min (0x0UL)     /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL10_NAKSTS_Max (0x1UL)     /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL10_NAKSTS_NONNAK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_NAKSTS_NAK (0x1UL)     /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL10_EPTYPE_Pos (18UL)      /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DIEPCTL10_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL10_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.              */
  #define USBHSCORE_DIEPCTL10_EPTYPE_Min (0x0UL)     /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL10_EPTYPE_Max (0x3UL)     /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL10_EPTYPE_CONTROL (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_EPTYPE_ISOCHRONOUS (0x1UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPCTL10_EPTYPE_BULK (0x2UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_EPTYPE_INTERRUP (0x3UL) /*!< (unspecified)                                                       */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL10_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DIEPCTL10_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL10_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DIEPCTL10_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL10_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL10_STALL_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_STALL_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Pos (22UL)      /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL10_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.              */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Min (0x0UL)     /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Max (0xFUL)     /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO0 (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO1 (0x1UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO2 (0x2UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO3 (0x3UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO4 (0x4UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO5 (0x5UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO6 (0x6UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO7 (0x7UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO8 (0x8UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO9 (0x9UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO10 (0xAUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO11 (0xBUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO12 (0xCUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO13 (0xDUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO14 (0xEUL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO15 (0xFUL) /*!< (unspecified)                                                       */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DIEPCTL10_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DIEPCTL10_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DIEPCTL10_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_CNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_CNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DIEPCTL10_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DIEPCTL10_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DIEPCTL10_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_SNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_SNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SETD0PID @Bit 28 : SetD0PID */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD0PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL10_SETD0PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* SETD1PID @Bit 29 : SetD1PID */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD1PID_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPCTL10_SETD1PID_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL10_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DIEPCTL10_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_EPDIS_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL10_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DIEPCTL10_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DIEPCTL10_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL10_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL10_EPENA_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DIEPCTL10_EPENA_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */


/* USBHSCORE_DIEPINT10: Device IN Endpoint 10 Interrupt Register */
  #define USBHSCORE_DIEPINT10_ResetValue (0x00000080UL) /*!< Reset value of DIEPINT10 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT10_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT10_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT10_EPDISBLD_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT10_EPDISBLD_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT10_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DIEPINT10_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT10_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DIEPINT10_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT10_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT10_AHBERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT10_AHBERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Pos (3UL)      /*!< Position of TIMEOUT field.                                           */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT10_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.           */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Min (0x0UL)    /*!< Min enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Max (0x1UL)    /*!< Max enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT10_TIMEOUT_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DIEPINT10_TIMEOUT_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos (4UL)  /*!< Position of INTKNTXFEMP field.                                       */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP
                                                                            field.*/
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_INACTIVE (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_ACTIVE (0x1UL) /*!< (unspecified)                                                    */

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Pos (5UL)   /*!< Position of INTKNEPMIS field.                                        */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNEPMIS_Pos) /*!< Bit mask of INTKNEPMIS field.  */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Min (0x0UL) /*!< Min enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Max (0x1UL) /*!< Max enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

