tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* USBHSCORE_DIEPINT11: Device IN Endpoint 11 Interrupt Register */
  #define USBHSCORE_DIEPINT11_ResetValue (0x00000080UL) /*!< Reset value of DIEPINT11 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT11_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DIEPINT11_XFERCOMPL_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT11_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DIEPINT11_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT11_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DIEPINT11_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT11_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT11_EPDISBLD_INACTIVE (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DIEPINT11_EPDISBLD_ACTIVE (0x1UL) /*!< (unspecified)                                                       */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT11_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DIEPINT11_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT11_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DIEPINT11_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT11_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT11_AHBERR_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_DIEPINT11_AHBERR_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT11_TIMEOUT_Pos (3UL)      /*!< Position of TIMEOUT field.                                           */
  #define USBHSCORE_DIEPINT11_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT11_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.           */
  #define USBHSCORE_DIEPINT11_TIMEOUT_Min (0x0UL)    /*!< Min enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT11_TIMEOUT_Max (0x1UL)    /*!< Max enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT11_TIMEOUT_INACTIVE (0x0UL) /*!< (unspecified)                                                      */
  #define USBHSCORE_DIEPINT11_TIMEOUT_ACTIVE (0x1UL) /*!< (unspecified)                                                        */

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_Pos (4UL)  /*!< Position of INTKNTXFEMP field.                                       */
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT11_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP
                                                                            field.*/
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_INACTIVE (0x0UL) /*!< (unspecified)                                                  */
  #define USBHSCORE_DIEPINT11_INTKNTXFEMP_ACTIVE (0x1UL) /*!< (unspecified)                                                    */

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_Pos (5UL)   /*!< Position of INTKNEPMIS field.                                        */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT11_INTKNEPMIS_Pos) /*!< Bit mask of INTKNEPMIS field.  */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_Min (0x0UL) /*!< Min enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_Max (0x1UL) /*!< Max enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DIEPINT11_INTKNEPMIS_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Pos (6UL)   /*!< Position of INEPNAKEFF field.                                        */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT11_INEPNAKEFF_Pos) /*!< Bit mask of INEPNAKEFF field.  */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Min (0x0UL) /*!< Min enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Max (0x1UL) /*!< Max enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

