tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* USBHSCORE_DOEPCTL12: Device Control OUT Endpoint 12 Control Register */
  #define USBHSCORE_DOEPCTL12_ResetValue (0x00000000UL) /*!< Reset value of DOEPCTL12 register.                                */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL12_MPS_Pos (0UL)          /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL12_MPS_Msk (0x7FFUL << USBHSCORE_DOEPCTL12_MPS_Pos) /*!< Bit mask of MPS field.                     */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL12_USBACTEP_Pos (15UL)    /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL12_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL12_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.        */
  #define USBHSCORE_DOEPCTL12_USBACTEP_Min (0x0UL)   /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL12_USBACTEP_Max (0x1UL)   /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL12_USBACTEP_DISABLED (0x0UL) /*!< (unspecified)                                                     */
  #define USBHSCORE_DOEPCTL12_USBACTEP_ENABLED (0x1UL) /*!< (unspecified)                                                      */

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DOEPCTL12_DPID_Pos (16UL)        /*!< Position of DPID field.                                              */
  #define USBHSCORE_DOEPCTL12_DPID_Msk (0x1UL << USBHSCORE_DOEPCTL12_DPID_Pos) /*!< Bit mask of DPID field.                    */
  #define USBHSCORE_DOEPCTL12_DPID_Min (0x0UL)       /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL12_DPID_Max (0x1UL)       /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL12_DPID_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_DPID_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL12_NAKSTS_Pos (17UL)      /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL12_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL12_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.              */
  #define USBHSCORE_DOEPCTL12_NAKSTS_Min (0x0UL)     /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL12_NAKSTS_Max (0x1UL)     /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL12_NAKSTS_NONNAK (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_NAKSTS_NAK (0x1UL)     /*!< (unspecified)                                                        */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL12_EPTYPE_Pos (18UL)      /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL12_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL12_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.              */
  #define USBHSCORE_DOEPCTL12_EPTYPE_Min (0x0UL)     /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL12_EPTYPE_Max (0x3UL)     /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL12_EPTYPE_CONTROL (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_EPTYPE_ISOCHRONOUS (0x1UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_DOEPCTL12_EPTYPE_BULK (0x2UL)    /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_EPTYPE_INTERRUPT (0x3UL) /*!< (unspecified)                                                      */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL12_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DOEPCTL12_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL12_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DOEPCTL12_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL12_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL12_STALL_INACTIVE (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_STALL_ACTIVE (0x1UL)   /*!< (unspecified)                                                        */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DOEPCTL12_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DOEPCTL12_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL12_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DOEPCTL12_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL12_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL12_CNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_CNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL12_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DOEPCTL12_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL12_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DOEPCTL12_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL12_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL12_SNAK_INACTIVE (0x0UL)  /*!< (unspecified)                                                        */
  #define USBHSCORE_DOEPCTL12_SNAK_ACTIVE (0x1UL)    /*!< (unspecified)                                                        */

