tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* PHYSLEEP @Bit 6 : PHY In Sleep */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Pos (6UL)       /*!< Position of PHYSLEEP field.                                          */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Msk (0x1UL << USBHSCORE_PCGCCTL_PHYSLEEP_Pos) /*!< Bit mask of PHYSLEEP field.            */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Min (0x0UL)     /*!< Min enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Max (0x1UL)     /*!< Max enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_INACTIVE (0x0UL) /*!< (unspecified)                                                       */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_ACTIVE (0x1UL)  /*!< (unspecified)                                                        */

/* L1SUSPENDED @Bit 7 : L1 Deep Sleep */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Pos (7UL)    /*!< Position of L1SUSPENDED field.                                       */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Msk (0x1UL << USBHSCORE_PCGCCTL_L1SUSPENDED_Pos) /*!< Bit mask of L1SUSPENDED field.   */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Min (0x0UL)  /*!< Min enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Max (0x1UL)  /*!< Max enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_INACTIVE (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_ACTIVE (0x1UL) /*!< (unspecified)                                                      */

/* RESTOREMODE @Bit 9 : Restore Mode (RestoreMode) */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Pos (9UL)    /*!< Position of RESTOREMODE field.                                       */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Msk (0x1UL << USBHSCORE_PCGCCTL_RESTOREMODE_Pos) /*!< Bit mask of RESTOREMODE field.   */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Min (0x0UL)  /*!< Min enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Max (0x1UL)  /*!< Max enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_DISABLED (0x0UL) /*!< (unspecified)                                                    */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_ENABLED (0x1UL) /*!< (unspecified)                                                     */

/* ESSREGRESTORED @Bit 13 : Essential Register Values Restored (EssRegRestored) */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos (13UL) /*!< Position of ESSREGRESTORED field.                                   */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Msk (0x1UL << USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos) /*!< Bit mask of ESSREGRESTORED
                                                                            field.*/
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Min (0x0UL) /*!< Min enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Max (0x1UL) /*!< Max enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_NOT_RESTORED (0x0UL) /*!< (unspecified)                                             */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_RESTORED (0x1UL) /*!< (unspecified)                                                 */

/* RESTOREVALUE @Bits 14..31 : Restore Value (RestoreValue) */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Pos (14UL)  /*!< Position of RESTOREVALUE field.                                      */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Msk (0x3FFFFUL << USBHSCORE_PCGCCTL_RESTOREVALUE_Pos) /*!< Bit mask of RESTOREVALUE
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0x0UL) /*!< Min enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0x6UL) /*!< Max enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_ByteSwap (0x00UL) /*!< Byte swap attribute.                                          */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_JobList (0x01UL) /*!< Job list attribute.                                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_BufferFill (0x02UL) /*!< Buffer fill attribute.                                      */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_FixedSize (0x03UL) /*!< Fixed size attribute.                                        */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_StaticAddress (0x04UL) /*!< Static address attribute.                                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_PlainDataBufferWrite (0x05UL) /*!< Plain data buffer write attribute.                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Crc (0x06UL) /*!< CRC attribute.                                                     */

