tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED7 @Bit 7 : Enable or disable interrupt for event TRIGGERED[7] */
  #define VPR_INTEN_TRIGGERED7_Pos (7UL)             /*!< Position of TRIGGERED7 field.                                        */
  #define VPR_INTEN_TRIGGERED7_Msk (0x1UL << VPR_INTEN_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field.                      */
  #define VPR_INTEN_TRIGGERED7_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED7 field.                            */
  #define VPR_INTEN_TRIGGERED7_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED7 field.                            */
  #define VPR_INTEN_TRIGGERED7_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED7_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED8 @Bit 8 : Enable or disable interrupt for event TRIGGERED[8] */
  #define VPR_INTEN_TRIGGERED8_Pos (8UL)             /*!< Position of TRIGGERED8 field.                                        */
  #define VPR_INTEN_TRIGGERED8_Msk (0x1UL << VPR_INTEN_TRIGGERED8_Pos) /*!< Bit mask of TRIGGERED8 field.                      */
  #define VPR_INTEN_TRIGGERED8_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED8 field.                            */
  #define VPR_INTEN_TRIGGERED8_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED8 field.                            */
  #define VPR_INTEN_TRIGGERED8_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED8_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED9 @Bit 9 : Enable or disable interrupt for event TRIGGERED[9] */
  #define VPR_INTEN_TRIGGERED9_Pos (9UL)             /*!< Position of TRIGGERED9 field.                                        */
  #define VPR_INTEN_TRIGGERED9_Msk (0x1UL << VPR_INTEN_TRIGGERED9_Pos) /*!< Bit mask of TRIGGERED9 field.                      */
  #define VPR_INTEN_TRIGGERED9_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED9 field.                            */
  #define VPR_INTEN_TRIGGERED9_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED9 field.                            */
  #define VPR_INTEN_TRIGGERED9_Disabled (0x0UL)      /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED9_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIGGERED10 @Bit 10 : Enable or disable interrupt for event TRIGGERED[10] */
  #define VPR_INTEN_TRIGGERED10_Pos (10UL)           /*!< Position of TRIGGERED10 field.                                       */
  #define VPR_INTEN_TRIGGERED10_Msk (0x1UL << VPR_INTEN_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10 field.                   */
  #define VPR_INTEN_TRIGGERED10_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED10 field.                           */
  #define VPR_INTEN_TRIGGERED10_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED10 field.                           */
  #define VPR_INTEN_TRIGGERED10_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED10_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED11 @Bit 11 : Enable or disable interrupt for event TRIGGERED[11] */
  #define VPR_INTEN_TRIGGERED11_Pos (11UL)           /*!< Position of TRIGGERED11 field.                                       */
  #define VPR_INTEN_TRIGGERED11_Msk (0x1UL << VPR_INTEN_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11 field.                   */
  #define VPR_INTEN_TRIGGERED11_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED11 field.                           */
  #define VPR_INTEN_TRIGGERED11_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED11 field.                           */
  #define VPR_INTEN_TRIGGERED11_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED11_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED12 @Bit 12 : Enable or disable interrupt for event TRIGGERED[12] */
  #define VPR_INTEN_TRIGGERED12_Pos (12UL)           /*!< Position of TRIGGERED12 field.                                       */
  #define VPR_INTEN_TRIGGERED12_Msk (0x1UL << VPR_INTEN_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12 field.                   */
  #define VPR_INTEN_TRIGGERED12_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED12 field.                           */
  #define VPR_INTEN_TRIGGERED12_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED12 field.                           */
  #define VPR_INTEN_TRIGGERED12_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED12_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED13 @Bit 13 : Enable or disable interrupt for event TRIGGERED[13] */
  #define VPR_INTEN_TRIGGERED13_Pos (13UL)           /*!< Position of TRIGGERED13 field.                                       */
  #define VPR_INTEN_TRIGGERED13_Msk (0x1UL << VPR_INTEN_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13 field.                   */
  #define VPR_INTEN_TRIGGERED13_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED13 field.                           */
  #define VPR_INTEN_TRIGGERED13_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED13 field.                           */
  #define VPR_INTEN_TRIGGERED13_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED13_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED14 @Bit 14 : Enable or disable interrupt for event TRIGGERED[14] */
  #define VPR_INTEN_TRIGGERED14_Pos (14UL)           /*!< Position of TRIGGERED14 field.                                       */
  #define VPR_INTEN_TRIGGERED14_Msk (0x1UL << VPR_INTEN_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14 field.                   */
  #define VPR_INTEN_TRIGGERED14_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED14 field.                           */
  #define VPR_INTEN_TRIGGERED14_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED14 field.                           */
  #define VPR_INTEN_TRIGGERED14_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED14_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED15 @Bit 15 : Enable or disable interrupt for event TRIGGERED[15] */
  #define VPR_INTEN_TRIGGERED15_Pos (15UL)           /*!< Position of TRIGGERED15 field.                                       */
  #define VPR_INTEN_TRIGGERED15_Msk (0x1UL << VPR_INTEN_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15 field.                   */
  #define VPR_INTEN_TRIGGERED15_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED15 field.                           */
  #define VPR_INTEN_TRIGGERED15_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED15 field.                           */
  #define VPR_INTEN_TRIGGERED15_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED15_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED16 @Bit 16 : Enable or disable interrupt for event TRIGGERED[16] */
  #define VPR_INTEN_TRIGGERED16_Pos (16UL)           /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTEN_TRIGGERED16_Msk (0x1UL << VPR_INTEN_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.                   */
  #define VPR_INTEN_TRIGGERED16_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTEN_TRIGGERED16_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTEN_TRIGGERED16_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED16_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED17 @Bit 17 : Enable or disable interrupt for event TRIGGERED[17] */
  #define VPR_INTEN_TRIGGERED17_Pos (17UL)           /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTEN_TRIGGERED17_Msk (0x1UL << VPR_INTEN_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.                   */
  #define VPR_INTEN_TRIGGERED17_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTEN_TRIGGERED17_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTEN_TRIGGERED17_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED17_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED18 @Bit 18 : Enable or disable interrupt for event TRIGGERED[18] */
  #define VPR_INTEN_TRIGGERED18_Pos (18UL)           /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTEN_TRIGGERED18_Msk (0x1UL << VPR_INTEN_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.                   */
  #define VPR_INTEN_TRIGGERED18_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTEN_TRIGGERED18_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTEN_TRIGGERED18_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED18_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED19 @Bit 19 : Enable or disable interrupt for event TRIGGERED[19] */
  #define VPR_INTEN_TRIGGERED19_Pos (19UL)           /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTEN_TRIGGERED19_Msk (0x1UL << VPR_INTEN_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.                   */
  #define VPR_INTEN_TRIGGERED19_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTEN_TRIGGERED19_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTEN_TRIGGERED19_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED19_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED20 @Bit 20 : Enable or disable interrupt for event TRIGGERED[20] */
  #define VPR_INTEN_TRIGGERED20_Pos (20UL)           /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTEN_TRIGGERED20_Msk (0x1UL << VPR_INTEN_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.                   */
  #define VPR_INTEN_TRIGGERED20_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTEN_TRIGGERED20_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTEN_TRIGGERED20_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED20_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED21 @Bit 21 : Enable or disable interrupt for event TRIGGERED[21] */
  #define VPR_INTEN_TRIGGERED21_Pos (21UL)           /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTEN_TRIGGERED21_Msk (0x1UL << VPR_INTEN_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.                   */
  #define VPR_INTEN_TRIGGERED21_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTEN_TRIGGERED21_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTEN_TRIGGERED21_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED21_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED22 @Bit 22 : Enable or disable interrupt for event TRIGGERED[22] */
  #define VPR_INTEN_TRIGGERED22_Pos (22UL)           /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTEN_TRIGGERED22_Msk (0x1UL << VPR_INTEN_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.                   */
  #define VPR_INTEN_TRIGGERED22_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTEN_TRIGGERED22_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTEN_TRIGGERED22_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED22_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED23 @Bit 23 : Enable or disable interrupt for event TRIGGERED[23] */
  #define VPR_INTEN_TRIGGERED23_Pos (23UL)           /*!< Position of TRIGGERED23 field.                                       */
  #define VPR_INTEN_TRIGGERED23_Msk (0x1UL << VPR_INTEN_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23 field.                   */
  #define VPR_INTEN_TRIGGERED23_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTEN_TRIGGERED23_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTEN_TRIGGERED23_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED23_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED24 @Bit 24 : Enable or disable interrupt for event TRIGGERED[24] */
  #define VPR_INTEN_TRIGGERED24_Pos (24UL)           /*!< Position of TRIGGERED24 field.                                       */
  #define VPR_INTEN_TRIGGERED24_Msk (0x1UL << VPR_INTEN_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field.                   */
  #define VPR_INTEN_TRIGGERED24_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTEN_TRIGGERED24_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTEN_TRIGGERED24_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED24_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED25 @Bit 25 : Enable or disable interrupt for event TRIGGERED[25] */
  #define VPR_INTEN_TRIGGERED25_Pos (25UL)           /*!< Position of TRIGGERED25 field.                                       */
  #define VPR_INTEN_TRIGGERED25_Msk (0x1UL << VPR_INTEN_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field.                   */
  #define VPR_INTEN_TRIGGERED25_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTEN_TRIGGERED25_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTEN_TRIGGERED25_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED25_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED26 @Bit 26 : Enable or disable interrupt for event TRIGGERED[26] */
  #define VPR_INTEN_TRIGGERED26_Pos (26UL)           /*!< Position of TRIGGERED26 field.                                       */
  #define VPR_INTEN_TRIGGERED26_Msk (0x1UL << VPR_INTEN_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field.                   */
  #define VPR_INTEN_TRIGGERED26_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTEN_TRIGGERED26_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTEN_TRIGGERED26_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED26_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED27 @Bit 27 : Enable or disable interrupt for event TRIGGERED[27] */
  #define VPR_INTEN_TRIGGERED27_Pos (27UL)           /*!< Position of TRIGGERED27 field.                                       */
  #define VPR_INTEN_TRIGGERED27_Msk (0x1UL << VPR_INTEN_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27 field.                   */
  #define VPR_INTEN_TRIGGERED27_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED27 field.                           */
  #define VPR_INTEN_TRIGGERED27_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED27 field.                           */
  #define VPR_INTEN_TRIGGERED27_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED27_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED28 @Bit 28 : Enable or disable interrupt for event TRIGGERED[28] */
  #define VPR_INTEN_TRIGGERED28_Pos (28UL)           /*!< Position of TRIGGERED28 field.                                       */
  #define VPR_INTEN_TRIGGERED28_Msk (0x1UL << VPR_INTEN_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28 field.                   */
  #define VPR_INTEN_TRIGGERED28_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED28 field.                           */
  #define VPR_INTEN_TRIGGERED28_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED28 field.                           */
  #define VPR_INTEN_TRIGGERED28_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED28_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED29 @Bit 29 : Enable or disable interrupt for event TRIGGERED[29] */
  #define VPR_INTEN_TRIGGERED29_Pos (29UL)           /*!< Position of TRIGGERED29 field.                                       */
  #define VPR_INTEN_TRIGGERED29_Msk (0x1UL << VPR_INTEN_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29 field.                   */
  #define VPR_INTEN_TRIGGERED29_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED29 field.                           */
  #define VPR_INTEN_TRIGGERED29_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED29 field.                           */
  #define VPR_INTEN_TRIGGERED29_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED29_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED30 @Bit 30 : Enable or disable interrupt for event TRIGGERED[30] */
  #define VPR_INTEN_TRIGGERED30_Pos (30UL)           /*!< Position of TRIGGERED30 field.                                       */
  #define VPR_INTEN_TRIGGERED30_Msk (0x1UL << VPR_INTEN_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30 field.                   */
  #define VPR_INTEN_TRIGGERED30_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED30 field.                           */
  #define VPR_INTEN_TRIGGERED30_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED30 field.                           */
  #define VPR_INTEN_TRIGGERED30_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED30_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED31 @Bit 31 : Enable or disable interrupt for event TRIGGERED[31] */
  #define VPR_INTEN_TRIGGERED31_Pos (31UL)           /*!< Position of TRIGGERED31 field.                                       */
  #define VPR_INTEN_TRIGGERED31_Msk (0x1UL << VPR_INTEN_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31 field.                   */
  #define VPR_INTEN_TRIGGERED31_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED31 field.                           */
  #define VPR_INTEN_TRIGGERED31_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED31 field.                           */
  #define VPR_INTEN_TRIGGERED31_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED31_Enabled (0x1UL)      /*!< Enable                                                               */


/* VPR_INTENSET: Enable interrupt */
  #define VPR_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TRIGGERED0 @Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
  #define VPR_INTENSET_TRIGGERED0_Pos (0UL)          /*!< Position of TRIGGERED0 field.                                        */
  #define VPR_INTENSET_TRIGGERED0_Msk (0x1UL << VPR_INTENSET_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.                */
  #define VPR_INTENSET_TRIGGERED0_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define VPR_INTENSET_TRIGGERED0_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define VPR_INTENSET_TRIGGERED0_Set (0x1UL)        /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TRIGGERED1 @Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
  #define VPR_INTENSET_TRIGGERED1_Pos (1UL)          /*!< Position of TRIGGERED1 field.                                        */
  #define VPR_INTENSET_TRIGGERED1_Msk (0x1UL << VPR_INTENSET_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.                */
  #define VPR_INTENSET_TRIGGERED1_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define VPR_INTENSET_TRIGGERED1_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define VPR_INTENSET_TRIGGERED1_Set (0x1UL)        /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

