tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* TRIGGERED19 @Bit 19 : Write '1' to enable interrupt for event TRIGGERED[19] */
  #define VPR_INTENSET_TRIGGERED19_Pos (19UL)        /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTENSET_TRIGGERED19_Msk (0x1UL << VPR_INTENSET_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.             */
  #define VPR_INTENSET_TRIGGERED19_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENSET_TRIGGERED19_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENSET_TRIGGERED19_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED19_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED19_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED20 @Bit 20 : Write '1' to enable interrupt for event TRIGGERED[20] */
  #define VPR_INTENSET_TRIGGERED20_Pos (20UL)        /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTENSET_TRIGGERED20_Msk (0x1UL << VPR_INTENSET_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.             */
  #define VPR_INTENSET_TRIGGERED20_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENSET_TRIGGERED20_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENSET_TRIGGERED20_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED20_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED20_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED21 @Bit 21 : Write '1' to enable interrupt for event TRIGGERED[21] */
  #define VPR_INTENSET_TRIGGERED21_Pos (21UL)        /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTENSET_TRIGGERED21_Msk (0x1UL << VPR_INTENSET_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.             */
  #define VPR_INTENSET_TRIGGERED21_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENSET_TRIGGERED21_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENSET_TRIGGERED21_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED21_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED21_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED22 @Bit 22 : Write '1' to enable interrupt for event TRIGGERED[22] */
  #define VPR_INTENSET_TRIGGERED22_Pos (22UL)        /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTENSET_TRIGGERED22_Msk (0x1UL << VPR_INTENSET_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.             */
  #define VPR_INTENSET_TRIGGERED22_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENSET_TRIGGERED22_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENSET_TRIGGERED22_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED22_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED22_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED23 @Bit 23 : Write '1' to enable interrupt for event TRIGGERED[23] */
  #define VPR_INTENSET_TRIGGERED23_Pos (23UL)        /*!< Position of TRIGGERED23 field.                                       */
  #define VPR_INTENSET_TRIGGERED23_Msk (0x1UL << VPR_INTENSET_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23 field.             */
  #define VPR_INTENSET_TRIGGERED23_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTENSET_TRIGGERED23_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED23 field.                           */
  #define VPR_INTENSET_TRIGGERED23_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED23_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED23_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED24 @Bit 24 : Write '1' to enable interrupt for event TRIGGERED[24] */
  #define VPR_INTENSET_TRIGGERED24_Pos (24UL)        /*!< Position of TRIGGERED24 field.                                       */
  #define VPR_INTENSET_TRIGGERED24_Msk (0x1UL << VPR_INTENSET_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24 field.             */
  #define VPR_INTENSET_TRIGGERED24_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTENSET_TRIGGERED24_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED24 field.                           */
  #define VPR_INTENSET_TRIGGERED24_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED24_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED24_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED25 @Bit 25 : Write '1' to enable interrupt for event TRIGGERED[25] */
  #define VPR_INTENSET_TRIGGERED25_Pos (25UL)        /*!< Position of TRIGGERED25 field.                                       */
  #define VPR_INTENSET_TRIGGERED25_Msk (0x1UL << VPR_INTENSET_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25 field.             */
  #define VPR_INTENSET_TRIGGERED25_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTENSET_TRIGGERED25_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED25 field.                           */
  #define VPR_INTENSET_TRIGGERED25_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED25_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED25_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED26 @Bit 26 : Write '1' to enable interrupt for event TRIGGERED[26] */
  #define VPR_INTENSET_TRIGGERED26_Pos (26UL)        /*!< Position of TRIGGERED26 field.                                       */
  #define VPR_INTENSET_TRIGGERED26_Msk (0x1UL << VPR_INTENSET_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26 field.             */
  #define VPR_INTENSET_TRIGGERED26_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTENSET_TRIGGERED26_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED26 field.                           */
  #define VPR_INTENSET_TRIGGERED26_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED26_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED26_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

