tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* MODE10 @Bit 10 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE10_Pos (10UL)     /*!< Position of MODE10 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE10_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE10_Pos) /*!< Bit mask of MODE10 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE10_Min (0x0UL)    /*!< Min enumerator value of MODE10 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE10_Max (0x1UL)    /*!< Max enumerator value of MODE10 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE10_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE10_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */

/* MODE11 @Bit 11 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE11_Pos (11UL)     /*!< Position of MODE11 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE11_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE11_Pos) /*!< Bit mask of MODE11 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE11_Min (0x0UL)    /*!< Min enumerator value of MODE11 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE11_Max (0x1UL)    /*!< Max enumerator value of MODE11 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE11_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE11_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */

/* MODE12 @Bit 12 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE12_Pos (12UL)     /*!< Position of MODE12 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE12_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE12_Pos) /*!< Bit mask of MODE12 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE12_Min (0x0UL)    /*!< Min enumerator value of MODE12 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE12_Max (0x1UL)    /*!< Max enumerator value of MODE12 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE12_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE12_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */

/* MODE13 @Bit 13 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE13_Pos (13UL)     /*!< Position of MODE13 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE13_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE13_Pos) /*!< Bit mask of MODE13 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE13_Min (0x0UL)    /*!< Min enumerator value of MODE13 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE13_Max (0x1UL)    /*!< Max enumerator value of MODE13 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE13_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE13_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */

/* MODE14 @Bit 14 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE14_Pos (14UL)     /*!< Position of MODE14 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE14_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE14_Pos) /*!< Bit mask of MODE14 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE14_Min (0x0UL)    /*!< Min enumerator value of MODE14 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE14_Max (0x1UL)    /*!< Max enumerator value of MODE14 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE14_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE14_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */

/* MODE15 @Bit 15 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE15_Pos (15UL)     /*!< Position of MODE15 field.                                            */
  #define VPRCSR_NORDIC_INMODE_MODE15_Msk (0x1UL << VPRCSR_NORDIC_INMODE_MODE15_Pos) /*!< Bit mask of MODE15 field.            */
  #define VPRCSR_NORDIC_INMODE_MODE15_Min (0x0UL)    /*!< Min enumerator value of MODE15 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE15_Max (0x1UL)    /*!< Max enumerator value of MODE15 field.                                */
  #define VPRCSR_NORDIC_INMODE_MODE15_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                     */
  #define VPRCSR_NORDIC_INMODE_MODE15_EVENT (0x1UL)  /*!< Sampling on Counter1 event                                           */


/**
  * @brief OUTB [VPRCSR_NORDIC_OUTB] Buffered GPIO Output
  */
  #define VPRCSR_NORDIC_OUTB (0x00000BC4ul)
  #define VPRCSR_NORDIC_OUTB_ResetValue (0x00000000UL) /*!< Reset value of OUTB register.                                      */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN0_Pos (0UL)          /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN0_Pos) /*!< Bit mask of PIN0 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN0_Min (0x0UL)        /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN0_Max (0x1UL)        /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN0_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN0_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN1_Pos (1UL)          /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN1_Pos) /*!< Bit mask of PIN1 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN1_Min (0x0UL)        /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN1_Max (0x1UL)        /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN1_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN1_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN2_Pos (2UL)          /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN2_Pos) /*!< Bit mask of PIN2 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN2_Min (0x0UL)        /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN2_Max (0x1UL)        /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN2_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN2_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN3_Pos (3UL)          /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN3_Pos) /*!< Bit mask of PIN3 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN3_Min (0x0UL)        /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN3_Max (0x1UL)        /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN3_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN3_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

