tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54h20_enga_types.h
/* DIR @Bits 16..31 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR_Pos (16UL)        /*!< Position of DIR field.                                               */
  #define VPRCSR_NORDIC_DIROUT_DIR_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUT_DIR_Pos) /*!< Bit mask of DIR field.                  */


/**
  * @brief DIROUTB [VPRCSR_NORDIC_DIROUTB] Concatenation of DIRB and OUTB
  */
  #define VPRCSR_NORDIC_DIROUTB (0x00000BC7ul)
  #define VPRCSR_NORDIC_DIROUTB_ResetValue (0x00000000UL) /*!< Reset value of DIROUTB register.                                */

/* OUTB @Bits 0..15 : Buffered GPIO Output */
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Pos (0UL)       /*!< Position of OUTB field.                                              */
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUTB_OUTB_Pos) /*!< Bit mask of OUTB field.             */

/* DIRB @Bits 16..31 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB_Pos (16UL)      /*!< Position of DIRB field.                                              */
  #define VPRCSR_NORDIC_DIROUTB_DIRB_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUTB_DIRB_Pos) /*!< Bit mask of DIRB field.             */


/**
  * @brief OUTTGL [VPRCSR_NORDIC_OUTTGL] GPIO Output Toggle
  */
  #define VPRCSR_NORDIC_OUTTGL (0x00000BD0ul)
  #define VPRCSR_NORDIC_OUTTGL_ResetValue (0x00000000UL) /*!< Reset value of OUTTGL register.                                  */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Pos (0UL)        /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN0_Pos) /*!< Bit mask of PIN0 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Min (0x0UL)      /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Max (0x1UL)      /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Pos (1UL)        /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN1_Pos) /*!< Bit mask of PIN1 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Min (0x0UL)      /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Max (0x1UL)      /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Pos (2UL)        /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN2_Pos) /*!< Bit mask of PIN2 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Min (0x0UL)      /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Max (0x1UL)      /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Pos (3UL)        /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN3_Pos) /*!< Bit mask of PIN3 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Min (0x0UL)      /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Max (0x1UL)      /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Pos (4UL)        /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN4_Pos) /*!< Bit mask of PIN4 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Min (0x0UL)      /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Max (0x1UL)      /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Pos (5UL)        /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN5_Pos) /*!< Bit mask of PIN5 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Min (0x0UL)      /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Max (0x1UL)      /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Pos (6UL)        /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN6_Pos) /*!< Bit mask of PIN6 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Min (0x0UL)      /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Max (0x1UL)      /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Pos (7UL)        /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN7_Pos) /*!< Bit mask of PIN7 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Min (0x0UL)      /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Max (0x1UL)      /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

